import { Topic } from "..";
import dedent from 'dedent';

export const A1_1_TOPIC: Topic = {
    title: {
        kk: "АЛҒАШҚЫ ТАНЫСТЫҚ",
        ru: "ЗНАКОМСТВО",
        en: "FIRST MEETING"
    },
    description: {
        kk: "src/assets/document/a1/ru/1-сабақ. А1. Алғашқы таныстық. (каз-рус).docx",
        ru: "src/assets/document/a1/ru/1-сабақ. А1. Алғашқы таныстық. (каз-рус).docx",
        en: "src/assets/document/a1/en/1-сабақ. А1. Алғашқы таныстық (кз-анг).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Ат_ңы_ кім?
        К_ші_ің_з.
        Ра_м_т!
        Қ_й_рлы т_н!
        Қ_ш к_лдің_з!
        С_ле_!
        Қай_рлы т_ң!
        Са_ б_лыңы_!
        Оқа_ы ж_қ.
        С_ле_етсі_ бе!
        К_ш ж_рық!
        Та_ысқ_ны_а қ_а_ышты_ын!
    `),
    writingAnswer: dedent(`
        Атыңыз кім? Кешіріңіз. Рақмет! Қайырлы түн! Қош келдіңіз! Сәлем! Қайырлы таң! Сау болыңыз! Оқасы жоқ. Сәлеметсіз бе! Кеш жарық! Танысқаныма қуаныштымын!
    `),
    reading: dedent(`
        <b>Демалыс күні</b>

        Жексенбі күні Айдос ерте тұрды. Ауа райы жақсы болды. Ол таңғы ас ішті.
        Содан кейін Айдос жұбайы мен баласымен саябаққа барды. Олар саябақта серуендеді. Баласы балалар алаңында ойнады.Түсте олар дәмханаға барды. Шай ішіп, бауырсақ жеді. Отбасы бірге жақсы уақыт өткізді.Кешке олар үйге қайтты. Айдос гүлдерге су құйды. Барлығы жақсы демалып, жаңа аптаға дайын болды.
    `),
    readingTest: [
        {
            question: "Айдос қай күні ерте тұрды?",
            answers: [
                "Дүйсенбі күні",
                "Жексенбі күні",
                "Сейсенбі күні",
                "Жұма күні"
            ],
        },
        {
            question: "Айдос кімдермен саябаққа барды?",
            answers: [
                "Досымен",
                "Жұбайы және баласымен",
                "Әкесімен",
                "Жұбайы және қызымен"
            ],
        },
        {
            question: "Кешке Айдос не істеді?",
            answers: [
                "Теледидар көрді",
                "Достарымен кездесті",
                "Спортпен айналысты",
                "Гүлдерге су құйды"
            ],
        },
        {
            question: "Қазақ тіліне тән төл дыбыстарды белгілеңіз?",
            answers: [
                "А, Ә, Б, В, Г, Ғ, Д, Е, Ё",
                "Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І",
                "А, Ә, И, Й, К, Қ, Л, М, Н",
                "Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, С"
            ],
        },
        {
            question: "Қатаң дауыссыз дыбыстарды белгілеңіз?",
            answers: [
                "П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч",
                "Б, В, Г, Ғ, Д, Ж, З",
                "Й, Л, М, Н, Ң, Р",
                "Р, Г, Ғ, Д, Ж, З, П, Ф, К, Қ"
            ],
        },
    ],
    readingAnswer: dedent(`
        1. ә) Жексенбі күні
        2. ә) Жұбайы және баласымен
        3. в) Гүлдерге су құйды
        4. ә) Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І
        5. а) П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-1_Алғашқы-таныстық.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Сәлеметсіздер ме!  ________– Айбек. Мен ________. Ақтөбе қаласында тұрамын, бірақ туған жерім – ________. Осыдан екі жыл бұрын жұмысқа байланысты Ақтөбеге көшіп келдім. Қазір ақпараттық технологиялар саласында ________ болып жұмыс істеймін.
        Бос уақытымда спортпен айналысқанды, ________және жаңа жерлерге саяхаттағанды ұнатамын. Сонымен қатар ________ және ________ тілдерін үйреніп жүрмін. Себебі болашақта халықаралық компанияда жұмыс істегім келеді.
        Мен қазақ тілі курсына ________ қатысып отырмын. Бұл курсқа әртүрлі мамандық иелері келген екен. Бүгін бірнеше адаммен таныстым. Олардың арасында ________, ________ және студенттер бар. Барлығы қазақ тілінде еркін сөйлегісі келеді. Мен де күн сайын жаңа сөздерді жаттап, сөйлесу дағдыларымды дамытуға тырысамын.
        Менің ойымша, жаңа адамдармен танысу – өзіңді дамытуға жақсы мүмкіндік. Себебі әр адамның өмірлік ________ мен ________ әртүрлі болады. Сондықтан бұл курста жақсы достар тауып, қазақ тілінде еркін сөйлеймін деп сенемін.
    `),
    listeningAnswer: dedent(`
        Сәлеметсіздер ме! Менің атым – Айбек. Мен жиырма жеті жастамын. Ақтөбе қаласында тұрамын, бірақ туған жерім – Қостанай облысы. Осыдан екі жыл бұрын жұмысқа байланысты Ақтөбеге көшіп келдім. Қазір ақпараттық технологиялар саласында бағдарламашы болып жұмыс істеймін.
        Бос уақытымда спортпен айналысқанды, кітап оқығанды және жаңа жерлерге саяхаттағанды ұнатамын. Сонымен қатар қазақ және ағылшын тілдерін үйреніп жүрмін. Себебі болашақта халықаралық компанияда жұмыс істегім келеді.
        Мен қазақ тілі курсына алғаш рет қатысып отырмын. Бұл курсқа әртүрлі мамандық иелері келген екен. Бүгін бірнеше адаммен таныстым. Олардың арасында мұғалімдер, дәрігерлер және студенттер бар. Барлығы қазақ тілінде еркін сөйлегісі келеді. Мен де күн сайын жаңа сөздерді жаттап, сөйлесу дағдыларымды дамытуға тырысамын.
        Менің ойымша, жаңа адамдармен танысу – өзіңді дамытуға жақсы мүмкіндік. Себебі әр адамның өмірлік тәжірибесі мен қызығушылығы әртүрлі болады. Сондықтан бұл курста жақсы достар тауып, қазақ тілінде еркін сөйлеймін деп сенемін.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Айбектің жасы нешеде?
        2.	Айбек қай қалада тұрады?
        3.	Айбектің туған жері қай облыс?
        4.	Ол Ақтөбеге қашан көшіп келді?
        5.	Қазақ тіліне тән төл дыбыстар саны неше?
    `),
    speakingAnswer: dedent(`
        1.	Айбек жиырма жеті жаста.
        2.	Айбек Ақтөбе қаласында тұрады.
        3.	Қостанай облысы.
        4.	Осыдан екі жыл бұрын көшіп келді.
        5.	Қазақ тіліне тән төл дыбыстар саны – 9.
    `)
};
