import { Topic } from "..";
import dedent from 'dedent';

export const A1_10_TOPIC: Topic = {
    title: {
        kk: "ҚҰТТЫҚТАУ. ОДАҒАЙ СӨЗДЕР",
        ru: "ПОЗДРАВЛЕНИЕ. МЕЖДОМЕТИЯ",
        en: "CONGRATULATIONS. INTERJECTIONS"
    },
    description: {
        kk: "src/assets/document/a1/ru/10-сабақ. А1. Құттықтау. Одағай сөз (каз-рус).docx",
        ru: "src/assets/document/a1/ru/10-сабақ. А1. Құттықтау. Одағай сөз (каз-рус).docx",
        en: "src/assets/document/a1/en/10-сабақ. А1. Құттықтау. Одағай сөз (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Қ_ттықтаймын! Туғ_н күн_ңіз қ_тты болсын! Мер_кеңіз құтты болсын! Б_рекелді! Әл_ай! Әттег_н-ай! Ойп_рмай! С_зге денсаулық тілеймін. Қу_ныш тілеймін. Б_қыт тілеймін.
    `),
    writingAnswer: dedent(`
        Құттықтаймын! Туған күніңіз құтты болсын! Мерекеңіз құтты болсын! Бәрекелді! Алақай! Әттеген-ай! Ойпырмай! Сізге денсаулық тілеймін. Қуаныш тілеймін. Бақыт тілеймін.
    `),
    reading: dedent(`
        Бүгін – Айдостың туған күні. Ура! Бүгін мереке! Достары оған қонаққа келді. Олар гүл мен сыйлық әкелді. Құттықтаймыз! Туған күніңмен! Денің сау болсын! Бақытты бол! Айдос өте қуанды. Алақай! Бәрі бірге ән айтты. Олар торт жеді, шай ішті. Кеш өте көңілді өтті. Рақмет! – деді Айдос достарына.
    `),
    readingTest: [
        {
            "question": "Бүгін қандай мереке?",
            "answers": [
                "Наурыз",
                "Туған күн",
                "Жаңа жыл",
                "Тәуелсіздік күні"
            ]
        },
        {
            "question": "Достары не әкелді?",
            "answers": [
                "Кітап",
                "Гүл мен сыйлық",
                "Киім",
                "Доп"
            ]
        },
        {
            "question": "Айдос қандай көңіл күйде болды?",
            "answers": [
                "Мұңайып тұрды",
                "Қуанды",
                "Ұйықтады",
                "Ашуланды"
            ]
        },
        {
            "question": "Қонақтар не істеді?",
            "answers": [
                "Фильм көрді",
                "Ән айтты",
                "Сабақ оқыды",
                "Жаттығу жасады"
            ]
        },
        {
            "question": "Мәтіндегі одағай сөзді табыңыз.",
            "answers": [
                "Бақытты",
                "Ура!",
                "Әдемі",
                "Сыйлық"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	Ә) Туған күн 
        2.	Ә) Гүл мен сыйлық 
        3.	Ә) Қуанды  
        4.	Ә) Ән айтты 
        5.	Ә) Ура!
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-10_Құттықтау.-Одағай-сөздер.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Бүгін біздің ұжымда ерекше __________. Әріптесіміздің аты – __________. Біз оған __________ сыйладық. Мен оған зор __________ және мол __________ тіледім. Ерлан __________ айтты. Директор «__________!» деді. Соңында барлығы бірге __________ түсті. Мереке өте __________ өтті.
    `),
    listeningAnswer: dedent(`
        Бүгін біздің ұжымда ерекше күн. Әріптесіміздің аты – Ерлан. Біз оған гүл шоғын сыйладық. Мен оған зор денсаулық және мол бақыт тіледім. Ерлан рақмет айтты. Директор «Рақмет!» деді. Соңында барлығы бірге суретке түсті. Мереке өте көңілді өтті.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Бүгін кімнің туған күні?
        2.	Әріптестері Ерланға не сыйлады?
        3.	Олар қандай тілек айтты?
        4.	Ерлан не деді?
        5.	Директор қандай одағай сөз айтты?
    `),
    speakingAnswer: dedent(`
        1 - Бүгін Ерланның туған күні. 
        2 - Олар Ерланға гүл шоғын сыйлады. 
        3 - Олар зор денсаулық, ұзақ ғұмыр, мол бақыт және табыс тіледі. 
        4 - Ерлан: «Рақмет! Осындай әдемі тілектеріңізге өте қуаныштымын», – деді. 
        5 - Директор: «Бәрекелді!» – деді.
    `)
};
