import { Topic } from "..";
import dedent from 'dedent';

export const A1_10_TOPIC: Topic = {
    title: {
        kk: "ҚҰТТЫҚТАУ. ОДАҒАЙ СӨЗДЕР",
        ru: "ПОЗДРАВЛЕНИЕ. МЕЖДОМЕТИЯ",
        en: "CONGRATULATIONS. INTERJECTIONS"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    құттықтау
                    құттықтаймын
                    мереке
                    туған күн
                    сыйлық
                    гүл шоғы
                    тілек
                    қуаныш
                    бақыт
                    денсаулық
                    табыс
                    амандық
                    ұзақ өмір
                    қонақ
                    мерейтой
                    той
                    шақыру
                    қуану
                    күлімдеу
                    қол шапалақтау
                    одағай
                    алақай!
                    бәрекелді!
                    әттеген-ай!
                    ойпырмай!
                    па, шіркін!
                    япырмай!
                    рақмет
                    қабыл алыңыз
                    қуаныштымын

                    ГРАММАТИКА. 
                    ОДАҒАЙ СӨЗДЕР. МЕЖДОМЕТИЯ.

                    Одағай – адамның көңіл күйін, сезімін, қуанышын, таңданысын, өкінуін білдіретін сөздер. Одағай сөздер сөйлем мүшесі болмайды.
                    Мысалдар:
                    – Алақай! Бүгін демалыс. 
                    – Бәрекелді! Жарайсың! 
                    – Ойпырмай! Қандай әдемі гүл!
                    – Әттеген-ай! Автобус кетіп қалды. 
                    – Па, шіркін! Неткен керемет күн!
                    Есте сақтаңыз!
                    Одағай	Мағынасы
                    Алақай!	қуаныш
                    Бәрекелді!	мақтау
                    Ойпырмай!	таңдану
                    Әттеген-ай!	өкіну
                    Па, шіркін!	сүйсіну
                    Япырмай!	таңғалу
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақ тілі	Руский
                    құттықтау	поздравление
                    құттықтаймын	поздравляю
                    мереке	праздник
                    туған күн	день рождения
                    сыйлық	подарок
                    гүл шоғы	букет цветов
                    тілек	пожелание
                    қуаныш	радость
                    бақыт	счастье
                    денсаулық	здоровье
                    табыс	успех
                    амандық	благополучие
                    ұзақ өмір	долгая жизнь
                    қонақ	гость
                    мерейтой	юбилей
                    той	праздник
                    шақыру	приглашение
                    қуану	радоваться
                    күлімдеу	улыбаться
                    қол шапалақтау	аплодировать
                    одағай	междометие
                    алақай!	ура!
                    бәрекелді!	молодец!
                    әттеген-ай!	эх!
                    ойпырмай!	ого!
                    па, шіркін!	вот это да!
                    япырмай!	ничего себе!
                    рақмет	спасибо
                    қабыл алыңыз	примите
                    қуаныштымын	рад(а)

                    ГРАММАТИКА. 
                    ОДАҒАЙ СӨЗДЕР. МЕЖДОМЕТИЯ.

                    Междометия — слова, выражающие эмоциональное состояние человека, его чувства, радость, удивление, сожаление и другие эмоции. Междометия не являются членами предложения.
                    Примеры:
                    – Алақай! Бүгін демалыс. — Ура! Сегодня выходной.
                    – Бәрекелді! Жарайсың! — Молодец! Хорошо!
                    – Ойпырмай! Қандай әдемі гүл! — Ой! Какой красивый цветок!
                    – Әттеген-ай! Автобус кетіп қалды. — Эх! Автобус уехал.
                    – Па, шіркін! Неткен керемет күн! — Ах, какой прекрасный день!

                    Запомните!
                    Междометия	Значение
                    Алақай!	радость
                    Бәрекелді!	похвала
                    Ойпырмай!	удивление
                    Әттеген-ай!	сожаление
                    Па, шіркін!	восхищение
                    Япырмай!	изумление / удивление
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақ тілі	English
                    құттықтау	congratulations
                    құттықтаймын	congratulate
                    мереке	holiday
                    туған күн	birthday
                    сыйлық	gift
                    гүл шоғы	bouquet
                    тілек	wish
                    қуаныш	joy
                    бақыт	happiness
                    денсаулық	health
                    табыс	success
                    амандық	well-being
                    ұзақ өмір	long life
                    қонақ	guest
                    мерейтой	anniversary
                    той	celebration
                    шақыру	invitation
                    қуану	be happy
                    күлімдеу	smile
                    қол шапалақтау	applaud
                    одағай	interjection
                    алақай!	hooray!
                    бәрекелді!	well done!
                    әттеген-ай!	what a pity!
                    ойпырмай!	wow!
                    па, шіркін!	wonderful!
                    япырмай!	goodness!
                    рақмет	thank you
                    қабыл алыңыз	accept
                    қуаныштымын	glad

                    ГРАММАТИКА. GRAMMAR.
                    ОДАҒАЙ СӨЗДЕР. INTERJECTIONS.

                    An interjection is a word that expresses a person’s emotional state, feelings, joy, surprise, regret, and other emotions. Interjections are not parts of a sentence.
                    Examples:
                    – Алақай! Бүгін демалыс. — Hooray! Today is a day off.
                    – Бәрекелді! Жарайсың! — Well done! Good job!
                    – Ойпырмай! Қандай әдемі гүл! — Oh my! What a beautiful flower!
                    – Әттеген-ай! Автобус кетіп қалды. — Oh no! The bus has left.
                    – Па, шіркін! Неткен керемет күн! — Oh, what a wonderful day!
                    Remember!
                    Interjection	Meaning
                    Алақай!	joy
                    Бәрекелді!	praise
                    Ойпырмай!	surprise
                    Әттеген-ай!	regret
                    Па, шіркін!	admiration
                    Япырмай!	amazement / surprise
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                Қ_ттықтаймын! Туғ_н күн_ңіз қ_тты болсын! Мер_кеңіз құтты болсын! Б_рекелді! Әл_ай! Әттег_н-ай! Ойп_рмай! С_зге денсаулық тілеймін. Қу_ныш тілеймін. Б_қыт тілеймін.
            `),
    reading: dedent(`
                Бүгін – Айдостың туған күні. Ура! Бүгін мереке! Достары оған қонаққа келді. Олар гүл мен сыйлық әкелді. Құттықтаймыз! Туған күніңмен! Денің сау болсын! Бақытты бол! Айдос өте қуанды. Алақай! Бәрі бірге ән айтты. Олар торт жеді, шай ішті. Кеш өте көңілді өтті. Рақмет! – деді Айдос достарына.
            `),
    readingTest: [
        {
            "question": "Бүгін қандай мереке?",
            "answers": [
                "Наурыз",
                "Туған күн",
                "Жаңа жыл",
                "Тәуелсіздік күні"
            ]
        },
        {
            "question": "Достары не әкелді?",
            "answers": [
                "Кітап",
                "Гүл мен сыйлық",
                "Киім",
                "Доп"
            ]
        },
        {
            "question": "Айдос қандай көңіл күйде болды?",
            "answers": [
                "Мұңайып тұрды",
                "Қуанды",
                "Ұйықтады",
                "Ашуланды"
            ]
        },
        {
            "question": "Қонақтар не істеді?",
            "answers": [
                "Фильм көрді",
                "Ән айтты",
                "Сабақ оқыды",
                "Жаттығу жасады"
            ]
        },
        {
            "question": "Мәтіндегі одағай сөзді табыңыз.",
            "answers": [
                "Бақытты",
                "Ура!",
                "Әдемі",
                "Сыйлық"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-10_Құттықтау.-Одағай-сөздер.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Бүгін біздің ұжымда ерекше __________. Әріптесіміздің аты – __________. Біз оған __________ сыйладық. Мен оған зор __________ және мол __________ тіледім. Ерлан __________ айтты. Директор «__________!» деді. Соңында барлығы бірге __________ түсті. Мереке өте __________ өтті.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Құттықтау, туған күн, сыйлық, тілек, бақыт, денсаулық, мереке.
            `)
};
