import { Topic } from "..";
import dedent from 'dedent';

export const A1_2_TOPIC: Topic = {
    title: {
        kk: "МЕНІҢ АПТАЛЫҚ КЕСТЕМ",
        ru: "МОЁ НЕДЕЛЬНОЕ РАСПИСАНИЕ",
        en: "MY WEEKLY SCHEDULE"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    апта
                    бүгін
                    кеше
                    ертең
                    қазір
                    таңертең
                    күндіз
                    кешке
                    түнде
                    дүйсенбі
                    сейсенбі
                    сәрсенбі
                    бейсенбі
                    жұма
                    сенбі
                    жексенбі
                    демалыс
                    жұмыс күндері
                    дейін
                    кейін
                    жарым

                    ГРАММАТИКА
                    САН ЕСІМ. РЕТТІК САН ЕСІМ

                    Қазақ тілінде.
                    Сан есім — заттың санын, мөлшерін, ретін немесе шамасын білдіретін сөз табы.
                    Сан есімдерге қанша? неше? нешінші? деген сұрақтар қойылады.
                    Қазақ тілінде мағынасына қарай сан есімдер 6 топқа бөлінеді.
                    Атауы	Сұрақтары	Мысалы
                    Есептік сан есім	неше? қанша?	бір, бес, жиырма, жүз.
                    Реттік сан есім	нешінші?	бірінші, бесінші, жиырмасыншы.
                    Жинақтық сан есім	нешеу?	екеу, үшеу, төртеу
                    Топтау сан есім	нешеден? қаншадан?	екіден, бестен
                    Болжалдық сан есім	неше? қанша?	он шақты, жүздей
                    Бөлшектік сан есім	нешеден неше? қаншадан қанша?	екіден бір (1/2), үштен екі (2/3)
                    Есептік сан есім: Заттың нақты санын білдіреді.
                    •	Сұрақтары: қанша? неше?
                    •	Мысалы: бір кітап, үш адам, бес дәптер, он оқушы.
                    Реттік сан есім: Заттың санау тәртібін, ретін білдіреді. Есептік сан есімге -ншы, -нші, -ыншы, -інші жұрнақтары жалғану арқылы жасалады.
                    •	Сұрақтары: нешінші?
                    •	Мысалы: бірінші қабат, екінші күн, үшінші сабақ, оныншы сынып
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақ тілі	русский
                    апта	неделя
                    бүгін	сегодня
                    кеше	вчера
                    ертең	завтра
                    қазір	сейчас
                    таңертең	утром
                    күндіз	днём
                    кешке	вечером
                    түнде	ночью
                    дүйсенбі	понедельник
                    сейсенбі	вторник
                    сәрсенбі	среда
                    бейсенбі	четверг
                    жұма	пятница
                    сенбі	суббота
                    жексенбі	воскресенье
                    демалыс	выходной
                    жұмыс күндері	рабочие дни
                    дейін	до
                    кейін	после
                    жарым	половина

                    ГРАММАТИКА.
                    САН ЕСІМ. РЕТТІК САН ЕСІМ. ИМЯ ЧИСЛИТЕЛЬНОЕ. Порядковое числительное.

                    Имя числительное
                    Имя числительное — это часть речи, которая обозначает количество, число или порядок предметов. Вопросы: Сколько? Какой по счёту?
                    В казахском языке по значению имена числительные делятся на 6 групп.
                    Название	Вопросы	Примеры
                    Количественное числительное	сколько?	один, пять, двадцать, сто
                    Порядковое числительное	который?	первый, пятый, двадцатый
                    Собирательное числительное	сколько? (сколько человек/предметов вместе?)	двое, трое, четверо
                    Распределительное числительное	по сколько?	по два, по пять
                    Приблизительное числительное	сколько? (примерно)	около десяти, примерно сто
                    Дробное числительное	сколько из скольких?	одна вторая (1/2), две третьих (2/3)
                    1. Количественное числительное. Обозначает точное количество предметов.
                    Вопрос: Сколько?
                    Примеры: одна книга,три человека, пять тетрадей, десять учеников
                    2. Порядковое числительное. Обозначает порядок предметов при счёте. Образуется от количественного числительного. Вопрос: Какой по счёту?
                    Примеры: первый этаж, второй день, третий урок, десятый класс.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақ тілі	english
                    апта	week
                    бүгін	today
                    кеше	yesterday
                    ертең	tomorrow
                    қазір	now
                    таңертең	in the morning
                    күндіз	during the day
                    кешке	in the evening
                    түнде	at night
                    дүйсенбі	monday
                    сейсенбі	tuesday
                    сәрсенбі	wednesday
                    бейсенбі	thursday
                    жұма	friday
                    сенбі	saturday
                    жексенбі	sunday
                    демалыс	day off
                    жұмыс күндері	working days
                    дейін	until
                    кейін	after
                    жарым	half

                    ГРАММАТИКА. GRAMMAR.
                    САН ЕСІМ. NUMBER.
                    A number is a part of speech that shows the number, quantity, or order of people or things.
                    Questions: How many? Which (in order)?
                    In the Kazakh language, numerals are divided into six groups according to their meaning.
                    Name	Questions	Examples
                    Cardinal Number	How many? How much?	one, five, twenty, one hundred
                    Ordinal Number	Which one? / What number?	first, fifth, twentieth
                    Collective Number	How many (as a group)?	two people, three people, four people
                        Distributive Number	How many each?	two each, five each
                        Approximate Number	How many? (approximately)	about ten, around one hundred
                    Fractional Number	How many out of how many?	one half (1/2), two thirds (2/3)
                    1. Cardinal Numbers
                    Cardinal numbers show the exact number of people or things.
                    Question: How many?
                    Examples: one book, three people, five notebooks, ten students
                    2. Ordinal Numbers
                    Ordinal numbers show the order of people or things. They are formed from cardinal numbers.
                    Question: Which (in order)?
                    Examples:first floor, second day, third lesson, tenth grade
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                Апт..., бүг...н, ерте..., демал...с, д...с...нбі, с...йс...нбі, с...рсенбі, б...йс...нб..., ж...ма, сенб..., жекс...нбі, де...ін, жар...м, кей...н, к...ше, кешк..., к...з, к...нд...з, көк...ем, та...ерте..., т...нде, ж...з, қ...з...р
            `),
    reading: dedent(`
                Сәлем! Менің атым – Айдос. Мен кеңседе жұмыс істеймін. Мен дүйсенбіден жұмаға дейін жұмысқа барамын. Сенбі мен жексенбі – демалыс күндері.Мен таңертең сағат жетіде тұрамын. Таңғы ас ішемін. Содан кейін жұмысқа барамын. Жұмысым сағат тоғызда басталады. Мен әріптестеріммен бірге жұмыс істеймін. Түсте түскі ас ішемін. Кешкі сағат алтыда жұмысым аяқталады. Кешке үйге қайтамын. Кітап оқимын немесе теледидар көремін.Кеше жексенбі болды. Мен үйде демалдым. Үйді жинадым. Дүкенге барып, азық-түлік сатып алдым. Кешке отбасыммен бірге кешкі ас іштім.
            `),
    readingTest: [
        {
            "question": "Айдос қайда жұмыс істейді?",
            "answers": [
                "Мектепте",
                "Кеңседе",
                "Ауруханада",
                "Дүкенде"
            ]
        },
        {
            "question": "Айдостың жұмыс күндері қай күндер?",
            "answers": [
                "Сенбі–жексенбі",
                "Сейсенбі–сенбі",
                "Дүйсенбі–жұма",
                "Сәрсенбі–жексенбі"
            ]
        },
        {
            "question": "Айдос таңертең сағат нешеде тұрады?",
            "answers": [
                "Сағат 7-де",
                "Сағат 6-да",
                "Сағат 8-де",
                "Сағат 9-да"
            ]
        },
        {
            "question": "Сан есімнің неше түрі бар?",
            "answers": [
                "3",
                "4",
                "5",
                "6"
            ]
        },
        {
            "question": "Реттік сан есімді табыңыз.",
            "answers": [
                "бес, жиырма, жүз.",
                "он шақты, жүздей.",
                "екеу, үшеу, төртеу",
                "бірінші, бесінші."
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-2_Менің-апталық-кестем.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Уақытты дұрыс жоспарлау – күнделікті өмірдің маңызды бөлігі. Бір апта ___________күннен тұрады: ___________, ___________, ___________, ___________, ___________, ___________ және ___________. Жұмыс күндері дүйсенбіден жұмаға дейін жалғасады, ал ___________ мен ___________ – демалыс күндері. Бүгін көптеген адамдардың күні ___________ ерте басталады. Таңертең олар жұмысқа немесе сабаққа дайындалады. Кейбір мекемелерде жұмыс ___________басталып, кешкі алтыға дейін жалғасады. Күндіз адамдар жиналысқа қатысады, құжаттармен жұмыс істейді немесе білім алады. Сабақтан немесе жұмыстан кейін олар дүкенге барады, спортпен айналысады немесе үй шаруаларын орындайды. Кешке __________ мүшелері бірге кешкі ас ішіп, күннің қалай өткенін әңгімелейді. Түнде адамдар ___________, келесі күнге күш жинайды.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Апта, бүгін, кеше, ертең, қазір, таңертең, күндіз.
            `)
};
