import { Topic } from "..";
import dedent from 'dedent';

export const A1_2_TOPIC: Topic = {
    title: {
        kk: "МЕНІҢ АПТАЛЫҚ КЕСТЕМ",
        ru: "МОЁ НЕДЕЛЬНОЕ РАСПИСАНИЕ",
        en: "MY WEEKLY SCHEDULE"
    },
    description: {
        kk: "src/assets/document/a1/ru/2-сабақ. А1. Менің апталық кестем (каз-рус).docx",
        ru: "src/assets/document/a1/ru/2-сабақ. А1. Менің апталық кестем (каз-рус).docx",
        en: "src/assets/document/a1/en/2-сабақ. А1. Менің апталық кестем (каз-анг).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Апт..., бүг...н, ерте..., демал...с, д...с...нбі, с...йс...нбі, с...рсенбі, б...йс...нб..., ж...ма, сенб..., жекс...нбі, де...ін, жар...м, кей...н, к...ше, кешк..., к...з, к...нд...з, көк...ем, та...ерте..., т...нде, ж...з, қ...з...р
    `),
    writingAnswer: dedent(`
        Апта, бүгін, ертең, демалыс, дүйсенбі, сейсенбі, сәрсенбі, бейсенбі, жұма, сенбі, жексенбі, дейін, жарым, кейін, кеше, кешке, күз, күндіз, көктем, таңертең, түнде, жаз, қазір
    `),
    reading: dedent(`
        Сәлем! Менің атым – Айдос. Мен кеңседе жұмыс істеймін. Мен дүйсенбіден жұмаға дейін жұмысқа барамын. Сенбі мен жексенбі – демалыс күндері.Мен таңертең сағат жетіде тұрамын. Таңғы ас ішемін. Содан кейін жұмысқа барамын. Жұмысым сағат тоғызда басталады. Мен әріптестеріммен бірге жұмыс істеймін. Түсте түскі ас ішемін. Кешкі сағат алтыда жұмысым аяқталады. Кешке үйге қайтамын. Кітап оқимын немесе теледидар көремін.Кеше жексенбі болды. Мен үйде демалдым. Үйді жинадым. Дүкенге барып, азық-түлік сатып алдым. Кешке отбасыммен бірге кешкі ас іштім.
    `),
    readingTest: [
        {
            "question": "Айдос қайда жұмыс істейді?",
            "answers": [
                "Мектепте",
                "Кеңседе",
                "Ауруханада",
                "Дүкенде"
            ]
        },
        {
            "question": "Айдостың жұмыс күндері қай күндер?",
            "answers": [
                "Сенбі–жексенбі",
                "Сейсенбі–сенбі",
                "Дүйсенбі–жұма",
                "Сәрсенбі–жексенбі"
            ]
        },
        {
            "question": "Айдос таңертең сағат нешеде тұрады?",
            "answers": [
                "Сағат 7-де",
                "Сағат 6-да",
                "Сағат 8-де",
                "Сағат 9-да"
            ]
        },
        {
            "question": "Сан есімнің неше түрі бар?",
            "answers": [
                "3",
                "4",
                "5",
                "6"
            ]
        },
        {
            "question": "Реттік сан есімді табыңыз.",
            "answers": [
                "бес, жиырма, жүз.",
                "он шақты, жүздей.",
                "екеу, үшеу, төртеу",
                "бірінші, бесінші."
            ]
        }
    ],
    readingAnswer: dedent(`
        1. Ә) Кеңседе
        2. Б) Дүйсенбі–жұма
        3. A) Сағат 7-де
        4. В) 6
        5. В) бірінші, бесінші.
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-2_Менің-апталық-кестем.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Уақытты дұрыс жоспарлау – күнделікті өмірдің маңызды бөлігі. Бір апта ___________күннен тұрады: ___________, ___________, ___________, ___________, ___________, ___________ және ___________. Жұмыс күндері дүйсенбіден жұмаға дейін жалғасады, ал ___________ мен ___________ – демалыс күндері. Бүгін көптеген адамдардың күні ___________ ерте басталады. Таңертең олар жұмысқа немесе сабаққа дайындалады. Кейбір мекемелерде жұмыс ___________басталып, кешкі алтыға дейін жалғасады. Күндіз адамдар жиналысқа қатысады, құжаттармен жұмыс істейді немесе білім алады. Сабақтан немесе жұмыстан кейін олар дүкенге барады, спортпен айналысады немесе үй шаруаларын орындайды. Кешке __________ мүшелері бірге кешкі ас ішіп, күннің қалай өткенін әңгімелейді. Түнде адамдар ___________, келесі күнге күш жинайды.
    `),
    listeningAnswer: dedent(`
        Уақытты дұрыс жоспарлау – күнделікті өмірдің маңызды бөлігі. Бір апта жеті күннен тұрады: дүйсенбі, сейсенбі, сәрсенбі, бейсенбі, жұма, сенбі және жексенбі. Жұмыс күндері дүйсенбіден жұмаға дейін жалғасады, ал сенбі мен жексенбі – демалыс күндері.Бүгін көптеген адамдардың күні таңертең ерте басталады. Таңертең олар жұмысқа немесе сабаққа дайындалады. Кейбір мекемелерде жұмыс сегіз жарымда басталып, кешкі алтыға дейін жалғасады. Күндіз адамдар жиналысқа қатысады, құжаттармен жұмыс істейді немесе білім алады. Сабақтан немесе жұмыстан кейін олар дүкенге барады, спортпен айналысады немесе үй шаруаларын орындайды. Кешке отбасы мүшелері бірге кешкі ас ішіп, күннің қалай өткенін әңгімелейді. Түнде адамдар демалып, келесі күнге күш жинайды.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Бір апта неше күннен тұрады?
        2.	Жұмыс күндері қай күннен қай күнге дейін жалғасады?
        3.	Демалыс күндері қай күндер?
        4.	Бүгін көптеген адамдардың күні қашан басталады?
        5.	Таңертең адамдар неге дайындалады?
    `),
    speakingAnswer: dedent(`
        1.	Жеті күннен тұрады.
        2.	Жұмыс күндері дүйсенбіден жұмаға дейін жалғасады.
        3.	Демалыс күндері – сенбі мен жексенбі.
        4.	Күні таңертең ерте басталады.
        5.	Олар жұмысқа немесе сабаққа дайындалады.
    `)
};
