import { Topic } from "..";
import dedent from 'dedent';

export const A1_3_TOPIC: Topic = {
    title: {
        kk: "ТАБИҒАТТЫҢ ТОСЫН СЫЙЫ",
        ru: "НЕОЖИДАННЫЙ ПОДАРОК ПРИРОДЫ",
        en: "NATURE’S UNEXPECTED GIFT"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    ауа райы болжамы
                    ашық күн
                    аяз
                    боран
                    бұлтты
                    кемпірқосақ
                    найзағай
                    су тасқыны
                    қар аралас жаңбыр
                    қар көшкіні
                    қолшатыр
                    жел
                    суық
                    ыстық
                    көктайғақ
                    ылғал
                    құрғақ

                    ГРАММАТИКА
                    СЫН ЕСІМ

                    Сын есім — заттың түрін, түсін, сапасын, белгісін, күйін, салмағын, көлемін, иісін т.б. қасиеттерін білдіретін сөздер.
                    Қазақ тілінде сын есімдердің сұрақтары: қандай? қай?
                    Мысалы:  Біздің кеңсе кең және жарық. (Қандай?)  Далада салқын жел соғып тұр. (Қандай?) Ең жақсы демалыс — таза ауада серуендеу. (Қай?) Мен тәтті кофе ішкенді ұнатамын. (Қандай?).
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақ тілі	русский
                    ауа райы болжамы	прогноз погоды
                    ашық күн	ясная погода
                    аяз	мороз
                    боран	буран
                    бұлтты	облачно
                    кемпірқосақ	радуга
                    найзағай	молния
                    су тасқыны	наводнение
                    қар аралас жаңбыр	дождь со снегом
                    қар көшкіні	лавина
                    қолшатыр	зонт
                    жел	ветер
                    суық	холодно
                    ыстық	жарко
                    көктайғақ	гололёд
                    ылғал	влажность
                    құрғақ	сухо

                    ГРАММАТИКА. 
                    СЫН ЕСІМ. ИМЯ ПРИЛАГАТЕЛЬНОЕ.

                    Имя прилагательное — это слова, обозначающие вид, цвет, качество, признаки, состояние, вес, объем, запах и другие свойства предмета.
                    В казахском языке имена прилагательные отвечают на вопросы: қандай? қай? (какой? какая? какое? какие?).
                    Примеры: Наш офис просторный и светлый. На улице дует прохладный ветер. Самый лучший отдых — прогулка на свежем воздухе. Я люблю пить сладкий кофе.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақ тілі	english
                    ауа райы болжамы	weather forecast
                    ашық күн	clear weather
                    аяз	frost
                    боран	blizzard
                    бұлтты	cloudy
                    кемпірқосақ	rainbow
                    найзағай	lightning
                    су тасқыны	flood
                    қар аралас жаңбыр	sleet (rain and snow)
                    қар көшкіні	avalanche
                    қолшатыр	umbrella
                    жел	wind
                    суық	cold
                    ыстық	hot
                    көктайғақ	icy roads (black ice)
                    ылғал	humidity
                    құрғақ	dry

                    ГРАММАТИКА. GRAMMAR.
                    СЫН ЕСІМ. ADJECTIVE
                    An adjective is a part of speech that describes the appearance, color, quality, characteristics, condition, weight, size, smell, and other properties of an object.
                    In the Kazakh language, adjectives answer the questions: what kind? which?
                    Examples: Our office is spacious and bright. A cool wind is blowing outside. The best rest is a walk in the fresh air. I like drinking sweet coffee.
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                А...а-рай... болжа...ы, ашы... к...н, а...з, б...ран, б...лтт..., к...мп...рқ...сақ, н...йз...ғай, су т...сқ...н...,қ...р ар...л...с жа...б...р, қ...лш...тыр, с...ық, қ...р...ақ.
            `),
    reading: dedent(`
                Ауа райы әрдайым өзгеріп тұрады. Қыста күн суық болады. Қар жауады, аяз болады. Адамдар жылы киім киеді.Көктемде күн жылынады. Кейде жаңбыр жауады, жел соғады. Жазда күн ыстық болады. Күзде күн салқын болады. Адамдар ауа райына қарай киінеді.Жаңбырдан кейін аспанда кемпірқосақ көрінеді. Ауа райын білу маңызды. Ол адамдарға күнделікті өмірін дұрыс жоспарлауға көмектеседі.
            `),
    readingTest: [
        {
            "question": "Қыста ауа райы қандай болады?",
            "answers": [
                "Ыстық болады",
                "Суық болады",
                "Жел болмайды",
                "Жаңбырлы болады"
            ]
        },
        {
            "question": "Көктемде не болады?",
            "answers": [
                "Қар жауады",
                "Күн жылы болады",
                "Күн өте ыстық болады",
                "Ыстық болады"
            ]
        },
        {
            "question": "Жазда күн қандай болады?",
            "answers": [
                "Суық болады",
                "Ыстық болады",
                "Қар жауады",
                "Боран болады"
            ]
        },
        {
            "question": "Адамдар неге ауа райын білуі керек?",
            "answers": [
                "Кітап оқу үшін",
                "Киім таңдау және күнді жоспарлау үшін",
                "Теледидар көру үшін",
                "Спортпен айналысу үшін"
            ]
        },
        {
            "question": "Сын есімнің сұрақтары.",
            "answers": [
                "Қандай?",
                "Қанша? Неше?",
                "Кімнің? Ненің?",
                "Қалай?"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-3_Табиғаттың-тосын-сыйы.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                ____________ болжамы адамдарға алдағы табиғи өзгерістер туралы ақпарат береді. Бірақ ___________ кейде күтпеген жағдайлармен таңғалдырады. Бір күні ашық күн болып, келесі күні ауа райы ___________ немесе ___________ болуы мүмкін.
                Қыста қатты ___________ болып, ___________ соғады. Суық күндері көшелерде ___ пайда болып, таулы аймақтарда қар көшкіні қаупі артады. ___________ мен ___________ ауа райы тұрақсыз болып, жел соғып, қар аралас жаңбыр жауады.
                Жазда күн ыстық болып, кейбір жерлерде ауа райы ___________ болады. Ал ___________ кейін ауадағы ылғал көбейеді. Кейде аспанда ___________ жарқылдап, жаңбырдан соң әдемі ___________ пайда болады. Қатты жауын-шашын кезінде ___________ болуы мүмкін.
                Сондықтан адамдар ___________ бақылап, қажетті заттарын алдын ала дайындап, табиғат өзгерістеріне дайын болуы керек.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Ауа райы болжамы, ашық күн, аяз, боран, бұлтты, кемпірқосақ, найзағай.
            `)
};
