import { Topic } from "..";
import dedent from 'dedent';

export const A1_3_TOPIC: Topic = {
    title: {
        kk: "ТАБИҒАТТЫҢ ТОСЫН СЫЙЫ",
        ru: "НЕОЖИДАННЫЙ ПОДАРОК ПРИРОДЫ",
        en: "NATURE’S UNEXPECTED GIFT"
    },
    description: {
        kk: "src/assets/document/a1/ru/3-cабақ. А1. Табиғаттың тосын сыйы (каз-рус).docx",
        ru: "src/assets/document/a1/ru/3-cабақ. А1. Табиғаттың тосын сыйы (каз-рус).docx",
        en: "src/assets/document/a1/en/3-сабақ. А1. Табиғаттың тосын сыйы (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        А...а-рай... болжа...ы, ашы... к...н, а...з, б...ран, б...лтт..., к...мп...рқ...сақ, н...йз...ғай, су т...сқ...н...,қ...р ар...л...с жа...б...р, қ...лш...тыр, с...ық, қ...р...ақ.
    `),
    writingAnswer: dedent(`
        Ауа-райы болжамы, ашық күн, аяз, боран, бұлтты, кемпірқосақ, найзағай, су тасқыны,қар аралас жаңбыр, қолшатыр, суық, құрғақ.
    `),
    reading: dedent(`
        Ауа райы әрдайым өзгеріп тұрады. Қыста күн суық болады. Қар жауады, аяз болады. Адамдар жылы киім киеді.Көктемде күн жылынады. Кейде жаңбыр жауады, жел соғады. Жазда күн ыстық болады. Күзде күн салқын болады. Адамдар ауа райына қарай киінеді.Жаңбырдан кейін аспанда кемпірқосақ көрінеді. Ауа райын білу маңызды. Ол адамдарға күнделікті өмірін дұрыс жоспарлауға көмектеседі.
    `),
    readingTest: [
        {
            "question": "Қыста ауа райы қандай болады?",
            "answers": [
                "Ыстық болады",
                "Суық болады",
                "Жел болмайды",
                "Жаңбырлы болады"
            ]
        },
        {
            "question": "Көктемде не болады?",
            "answers": [
                "Қар жауады",
                "Күн жылы болады",
                "Күн өте ыстық болады",
                "Ыстық болады"
            ]
        },
        {
            "question": "Жазда күн қандай болады?",
            "answers": [
                "Суық болады",
                "Ыстық болады",
                "Қар жауады",
                "Боран болады"
            ]
        },
        {
            "question": "Адамдар неге ауа райын білуі керек?",
            "answers": [
                "Кітап оқу үшін",
                "Киім таңдау және күнді жоспарлау үшін",
                "Теледидар көру үшін",
                "Спортпен айналысу үшін"
            ]
        },
        {
            "question": "Сын есімнің сұрақтары.",
            "answers": [
                "Қандай?",
                "Қанша? Неше?",
                "Кімнің? Ненің?",
                "Қалай?"
            ]
        }
    ],
    readingAnswer: dedent(`
        1. Ә) Үлкен 					
        2. Ә) Күн жылы болады
        3. Ә) Ыстық болады 	  
        4. Ә) Киім таңдау және күнді жоспарлау үшін 
        5. A) Қандай?
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-3_Табиғаттың-тосын-сыйы.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        ____________ болжамы адамдарға алдағы табиғи өзгерістер туралы ақпарат береді. Бірақ ___________ кейде күтпеген жағдайлармен таңғалдырады. Бір күні ашық күн болып, келесі күні ауа райы ___________ немесе ___________ болуы мүмкін.
        Қыста қатты ___________ болып, ___________ соғады. Суық күндері көшелерде ___ пайда болып, таулы аймақтарда қар көшкіні қаупі артады. ___________ мен ___________ ауа райы тұрақсыз болып, жел соғып, қар аралас жаңбыр жауады.
        Жазда күн ыстық болып, кейбір жерлерде ауа райы ___________ болады. Ал ___________ кейін ауадағы ылғал көбейеді. Кейде аспанда ___________ жарқылдап, жаңбырдан соң әдемі ___________ пайда болады. Қатты жауын-шашын кезінде ___________ болуы мүмкін.
        Сондықтан адамдар ___________ бақылап, қажетті заттарын алдын ала дайындап, табиғат өзгерістеріне дайын болуы керек.
    `),
    listeningAnswer: dedent(`
        Ауа райы болжамы адамдарға алдағы табиғи өзгерістер туралы ақпарат береді. Бірақ табиғат кейде күтпеген жағдайлармен таңғалдырады. Бір күні ашық күн болып, келесі күні ауа райы бұлтты немесе салқын болуы мүмкін.
        Қыста қатты аяз болып, боран соғады. Суық күндері көшелерде көктайғақ пайда болып, таулы аймақтарда қар көшкіні қаупі артады. Көктем мен күзде ауа райы тұрақсыз болып, жел соғып, қар аралас жаңбыр жауады.
        Жазда күн ыстық болып, кейбір жерлерде ауа райы құрғақ болады. Ал жаңбырдан кейін ауадағы ылғал көбейеді. Кейде аспанда найзағай жарқылдап, жаңбырдан соң әдемі кемпірқосақ пайда болады. Қатты жауын-шашын кезінде су тасқыны болуы мүмкін.
        Сондықтан адамдар ауа райын бақылап, қажетті заттарын алдын ала дайындап, табиғат өзгерістеріне дайын болуы керек.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Ауа райы болжамы адамдарға қандай ақпарат береді?
        2.	Табиғат кейде адамдарды немен таңғалдырады?
        3.	Мәтінде қандай ауа райы құбылыстары аталған?
        4.	Неліктен адамдар ауа райын бақылауы керек?
        5.	Сын есім қандай сөз табы?
    `),
    speakingAnswer: dedent(`
        1.	Ауа райы болжамы адамдарға алдағы табиғи өзгерістер туралы ақпарат береді.
        2.	Күтпеген жағдайларымен таңғалдырады.
        3.	Мәтінде ашық күн, аяз, боран, көктайғақ, жел, қар аралас жаңбыр, найзағай, кемпірқосақ және су тасқыны сияқты құбылыстар аталған.
        4.	Адамдар табиғат өзгерістеріне дайын болу үшін ауа райын бақылауы керек.
        5.	Сын есім — заттың түрін, түсін, сапасын, белгісін, күйін, салмағын, көлемін, иісін т.б. қасиеттерін білдіретін сөздер.
    `)
};
