import { Topic } from "..";
import dedent from 'dedent';

export const A1_4_TOPIC: Topic = {
    title: {
        kk: "МЕНІҢ ОТБАСЫМ",
        ru: "МОЯ СЕМЬЯ",
        en: "MY FAMILY"
    },
    description: {
        kk: "src/assets/document/a1/ru/4-сабақ. А1. Менің отбасым (каз-рус).docx",
        ru: "src/assets/document/a1/ru/4-сабақ. А1. Менің отбасым (каз-рус).docx",
        en: "src/assets/document/a1/en/4-сабақ. А1. Менің отбасым (каз-анг).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Отб_сы, әк_м, ан_м, ағ_м, әпк_м, ін_м, қарынд_сым, сіңл_м, ұл_м, қыз_м, жұб_йым, үй_м.
    `),
    writingAnswer: dedent(`
        Отбасы, Әкем, Анам, Ағам, Әпкем, Інім, Қарындасым, Сіңлім, Ұлым, Қызым, Жұбайым, Үйім
    `),
    reading: dedent(`
        Менің атым – Айдана. Менің отбасым үлкен емес. Біздің отбасымызда бес адам бар. Олар: әкем, анам, ағам, қарындасым және мен. Менің әкемнің аты – Ерлан. Менің әкем жүргізуші. Менің анамның аты – Гүлнар. Менің анам мұғалім. Менің ағам студент. Менің қарындасым мектепте оқиды. Біз бір-бірімізді жақсы көреміз. Демалыс күні біздің отбасымыз бірге серуендейді. Мен отбасымды жақсы көремін.
    `),
    readingTest: [
        {
            "question": "Айдананың отбасында неше адам бар?",
            "answers": [
                "3 адам",
                "4 адам",
                "5 адам",
                "6 адам"
            ]
        },
        {
            "question": "Айдананың әкесі кім болып жұмыс істейді?",
            "answers": [
                "Мұғалім",
                "Жүргізуші",
                "Дәрігер",
                "Сатушы"
            ]
        },
        {
            "question": "Айдананың анасының аты кім?",
            "answers": [
                "Айдана",
                "Айнұр",
                "Гүлнар",
                "Әсел"
            ]
        },
        {
            "question": "Сенің сөзіне дұрыс жалғанатын сөзді табыңыз.",
            "answers": [
                "апам",
                "апа",
                "апаң",
                "апасы"
            ]
        },
        {
            "question": "Демалыс күні отбасы не істейді?",
            "answers": [
                "Үйде ұйықтайды",
                "Теледидар көреді",
                "Жұмыс істейді",
                "Бірге серуендейді"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	Б) 5 адам 
        2.	Ә) Жүргізуші 
        3.	Б) Гүлнар 
        4.	Б) апаң
        5.	В) Бірге серуендейді
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-4_Менің-отбасым.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Менің атым – __________. Мен __________ қаласында тұрамын. Менің отбасымда __________ адам бар. Әкем __________ болып жұмыс істейді. Анам __________ болып жұмыс істейді. Ағам __________ тілін үйреніп жүр. Інім __________ ойнағанды ұнатады. Демалыс күндері біз __________ шығамыз. Мен өз __________ мақтан тұтамын. Отбасым әрқашан __________ көмектеседі.
    `),
    listeningAnswer: dedent(`
        Менің атым – Дана. Мен Ақтөбе қаласында тұрамын. Менің отбасымда бес адам бар. Әкем құрылысшы болып жұмыс істейді. Анам кітапханада кітапханашы болып жұмыс істейді. Ағам ағылшын тілін үйреніп жүр. Інім футбол ойнағанды ұнатады.  Демалыс күндері табиғатқа шығамыз. Мен өз отбасымды мақтан тұтамын. Отбасым әрқашан бір-біріне көмектеседі. 
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Сенің отбасыңда неше адам бар?
        2.	Әкең кім болып жұмыс істейді?
        3.	Анаң кім болып жұмыс істейді?
        4.	Отбасыңмен демалыста не істейсің?
        5.	Сен отбасыңды жақсы көресің бе?
    `),
    speakingAnswer: dedent(`
        1.	Менің отбасымда бес адам бар.
        2.	Менің әкем жүргізуші болып жұмыс істейді.
        3.	Менің анам мұғалім болып жұмыс істейді.
        4.	Біз бірге қыдырамыз және қонаққа барамыз.
        5.	Иә, мен өз отбасымды өте жақсы көремін.
    `)
};
