import { Topic } from "..";
import dedent from 'dedent';

export const A1_4_TOPIC: Topic = {
    title: {
        kk: "МЕНІҢ ОТБАСЫМ",
        ru: "МОЯ СЕМЬЯ",
        en: "MY FAMILY"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    отбасы
                    әке
                    ана
                    ата
                    әже
                    аға
                    әпке
                    іні
                    қарындас
                    сіңлі
                    ұл
                    қыз
                    бала
                    жұбай
                    туыс
                    үй
                    ата-ана
                    тату
                    мейірімді
                    қамқор
                    жақсы көру
                    бірге
                    мереке
                    қонақ
                    немере

                    ГРАММАТИКА.
                    ТӘУЕЛДІК ЖАЛҒАУЫ.

                    Тәуелдік жалғауы – бір заттың басқа бір затқа тәуелді екенін білдіретін қосымша. Негізінде зат есімге тән қосымша бола тұрса да, зат есім қызметін атқаратын, демек, заттанатын сөздердің барлығына да жалғана береді. 

                    Жекеше
                    Жақ	Жалғаулары	Мысалдар
                    I жақ           Менің	-ым, -ім, -м	отбасым
                    II жақ          Сенің	-ың, -ің, -ң	отбасың
                                        Сіздің	-ыңыз, -іңіз	отбасыңыз
                    III жақ        Оның	-ы, -і, -сы	отбасы
                            
                    Көпше
                    Жақ	Жалғаулары	Мысалдар
                    I жақ          Біздің	-ымыз, -іміз	отбасымыз
                    II жақ         Сендердің	-ың, -ің, -ң	отбасыларың
                                    Сіздердің	-ыңыз, -іңіз	Отбасыларыңыз
                    III жақ        Олардың	-ы, -і	отбасылары
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақ тілі	Русский
                    отбасы	семья
                    әке	отец
                    ана	мать
                    ата	дедушка
                    әже	бабушка
                    аға	старший брат
                    әпке	старшая сестра
                    іні	младший брат
                    қарындас	младшая сестра
                    сіңлі	младшая сестра
                    ұл	сын
                    қыз	дочь
                    бала	ребёнок
                    жұбай	супруг(а)
                    туыс	родственник
                    үй	дом
                    ата-ана	родители
                    тату	дружный
                    мейірімді	добрый
                    қамқор	заботливый
                    жақсы көру	любить
                    бірге	вместе
                    мереке	праздник
                    қонақ	гость
                    немере	внук, внучка

                    ГРАММАТИКА.
                    ТӘУЕЛДІК ЖАЛҒАУЫ. ПРИТЯЖАТЕЛЬНЫЕ ОКОНЧАНИЯ. 

                    Притяжательные окончания - это дополнение, которое означает, что одно вещество зависит от другого. Хотя в принципе это типичное дополнение к существительному, оно продолжает ложиться на все слова, которые действуют как существительные и, следовательно, являются существительными.

                    Лицо	Окончание	Примеры
                    I жақ           Менің	-ым, -ім, -м	отбасым
                    II жақ          Сенің	-ың, -ің, -ң	отбасың
                                        Сіздің	-ыңыз, -іңіз	отбасыңыз
                    III жақ        Оның	-ы, -і, -сы	отбасы


                    Лицо	Окончание	Примеры
                    I жақ          Біздің	-ымыз, -іміз	отбасымыз
                    II жақ         Сендердің	-ың, -ің, -ң	отбасыларың
                                    Сіздердің	-ыңыз, -іңіз	Отбасыларыңыз
                    III жақ        Олардың	-ы, -і	отбасылары

                    Мысалы: Например: 
                    Менің әкем – мой отец 
                    Менің анам – моя мама 
                    Сенің ағаң – твой брат 
                    Сіздің отбасыңыз – ваша семья 
                    Оның қарындасы – его сестра
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақ тілі	English
                    отбасы	family
                    әке	father
                    ана	mother
                    ата	grandfather
                    әже	grandmother
                    аға	elder brother
                    әпке	elder sister
                    іні	younger brother
                    қарындас	younger sister
                    сіңлі	younger sister
                    ұл	son
                    қыз	daughter
                    бала	child
                    жұбай	spouse
                    туыс	relative
                    үй	house
                    ата-ана	parents
                    тату	friendly
                    мейірімді	kind
                    қамқор	caring
                    жақсы көру	love
                    бірге	together
                    мереке	holiday
                    қонақ	guest
                    немере	grandchild

                    ГРАММАТИКА. GRAMMAR. 
                    ТӘУЕЛДІК ЖАЛҒАУЫ. POSSESSIVE SUFFIXES.
                    Possessive suffixes is an adjunct that indicates that one thing depends on another. In principle, although it is a characteristic addition to the noun, it also applies to all words that act as nouns and, therefore, materialize.

                    Singular
                        Ending	Examples
                    I жақ           Менің	-ым, -ім, -м	отбасым
                    II жақ          Сенің	-ың, -ің, -ң	отбасың
                                        Сіздің	-ыңыз, -іңіз	отбасыңыз
                    III жақ        Оның	-ы, -і, -сы	отбасы
                            
                    Plurals
                        Ending	Examples
                    I жақ          Біздің	-ымыз, -іміз	отбасымыз
                    II жақ         Сендердің	-ың, -ің, -ң	отбасыларың
                                    Сіздердің	-ыңыз, -іңіз	Отбасыларыңыз
                    III жақ        Олардың	-ы, -і	отбасылары

                    Мысал: Example:
                    Менің әкем – my father
                    Менің анам – my mother
                    Сенің ағаң – your brother
                    Сіздің отбасыңыз – your family
                    Оның қарындасы – his sister
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                Отб_сы, әк_м, ан_м, ағ_м, әпк_м, ін_м, қарынд_сым, сіңл_м, ұл_м, қыз_м, жұб_йым, үй_м.
            `),
    reading: dedent(`
                Менің атым – Айдана. Менің отбасым үлкен емес. Біздің отбасымызда бес адам бар. Олар: әкем, анам, ағам, қарындасым және мен. Менің әкемнің аты – Ерлан. Менің әкем жүргізуші. Менің анамның аты – Гүлнар. Менің анам мұғалім. Менің ағам студент. Менің қарындасым мектепте оқиды. Біз бір-бірімізді жақсы көреміз. Демалыс күні біздің отбасымыз бірге серуендейді. Мен отбасымды жақсы көремін.
            `),
    readingTest: [
        {
            "question": "Айдананың отбасында неше адам бар?",
            "answers": [
                "3 адам",
                "4 адам",
                "5 адам",
                "6 адам"
            ]
        },
        {
            "question": "Айдананың әкесі кім болып жұмыс істейді?",
            "answers": [
                "Мұғалім",
                "Жүргізуші",
                "Дәрігер",
                "Сатушы"
            ]
        },
        {
            "question": "Айдананың анасының аты кім?",
            "answers": [
                "Айдана",
                "Айнұр",
                "Гүлнар",
                "Әсел"
            ]
        },
        {
            "question": "Сенің сөзіне дұрыс жалғанатын сөзді табыңыз.",
            "answers": [
                "апам",
                "апа",
                "апаң",
                "апасы"
            ]
        },
        {
            "question": "Демалыс күні отбасы не істейді?",
            "answers": [
                "Үйде ұйықтайды",
                "Теледидар көреді",
                "Жұмыс істейді",
                "Бірге серуендейді"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a1/A1-4_Менің-отбасым.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Менің атым – __________. Мен __________ қаласында тұрамын. Менің отбасымда __________ адам бар. Әкем __________ болып жұмыс істейді. Анам __________ болып жұмыс істейді. Ағам __________ тілін үйреніп жүр. Інім __________ ойнағанды ұнатады. Демалыс күндері біз __________ шығамыз. Мен өз __________ мақтан тұтамын. Отбасым әрқашан __________ көмектеседі.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Отбасы, әке, ана, ата, әже, аға, іні.
            `)
};
