import { Topic } from "..";
import dedent from 'dedent';

export const A1_5_TOPIC: Topic = {
    title: {
        kk: "КИІМ ТҮСТЕРІ",
        ru: "ЦВЕТА ОДЕЖДЫ",
        en: "CLOTHING COLORS"
    },
    description: {
        kk: "src/assets/document/a1/ru/5-сабақ. А1. Киім түстері (каз-рус).docx",
        ru: "src/assets/document/a1/ru/5-сабақ. А1. Киім түстері (каз-рус).docx",
        en: "src/assets/document/a1/en/5-cабақ. А1. Киім түстері (каз-анг).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        К_йлек, ж_йде, ш_лбар, к_рте, яқк_ім, баски_м, қ_зыл, к_к, жас_л, с_ры, қ_ра, ақк_ім
    `),
    writingAnswer: dedent(`
        көйлек, жейде, шалбар, күрте, аяқкиім, баскиім, қызыл, көк, жасыл, сары, қара, ақкиім.
    `),
    reading: dedent(`
        Айгүл бүгін дүкенге барды. Ол қып-қызыл көйлек көрді. Көйлегі өте әдемі болды. Айгүл оны сатып алды. Оның ағасы аппақ көйлек емес, көк жейде алды. Әкесі қап-қара шалбар киді. Анасы жап-жасыл орамал тақты. Қарындасы сап-сары белдемше киді. Біздің отбасымыз түрлі түсті киімдерді жақсы көреді. 
    `),
    readingTest: [
        {
            "question": "Айгүл қандай көйлек сатып алды?",
            "answers": [
                "Көк",
                "Қып-қызыл",
                "Ақ",
                "Жасыл"
            ]
        },
        {
            "question": "Ағасы не алды?",
            "answers": [
                "Шалбар",
                "Көйлек",
                "Көк жейде",
                "Белдемше"
            ]
        },
        {
            "question": "Әкесі қандай шалбар киді?",
            "answers": [
                "Қап-қара",
                "Аппақ",
                "Сап-сары",
                "Жап-жасыл"
            ]
        },
        {
            "question": "Анасы қандай орамал тақты?",
            "answers": [
                "Көк",
                "Жап-жасыл",
                "Қып-қызыл",
                "Ақ"
            ]
        },
        {
            "question": "Күшейтпелі шырай сөзін табыңыз.",
            "answers": [
                "Көк",
                "Әдемі",
                "Қып-қызыл",
                "Киім"
            ]
        }
    ],
    readingAnswer: dedent(`
        1. ә) Қып-қызыл 
        2. б) Көк жейде 
        3. а) Қап-қара 
        4. ә) Жап-жасыл 
        5. б) Қып-қызыл
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-5_Киім-түстері.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Менің атым – __________. Менің сүйікті түсім – __________. Бүгін мен __________ бірге дүкенге бардым. Мен __________ футболка сатып алдым. Сонымен қатар __________ шалбар алдым. Анам __________ көйлек сатып алды. Дүкенде көптеген __________ болды. Мен әрқашан __________ және сәнді киінуге тырысамын. Сыртқы келбет адамның __________ көрсетеді. Менің жаңа киімдерім маған өте __________.
    `),
    listeningAnswer: dedent(`
        Менің атым – Алина. Менің сүйікті түсім – көк. Бүгін мен анаммен бірге дүкенге бардым. Мен аппақ футболка сатып алдым. Сонымен қатар қап-қара шалбар алдым. Анам жап-жасыл көйлек сатып алды. Дүкенде көптеген киімдер болды. Мен әрқашан таза, ұқыпты және сәнді киінуге тырысамын. Сыртқы келбет адамның мәдениетін көрсетеді. Менің жаңа киімдерім маған өте ұнайды.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Сенің сүйікті түсің қандай?
        2.	Бүгін қандай киім кидің?
        3.	Саған қандай түсті киім ұнайды?
        4.	Қыста қандай киім киесің?
        5.	Сен жаңа киім сатып алғанды ұнатасың ба?
    `),
    speakingAnswer: dedent(`
        1.	Менің сүйікті түсім – көк.
        2.	Бүгін мен ақ жейде мен қара шалбар кидім.
        3.	Маған көк және қара түсті киім ұнайды.
        4.	Қыста мен жылы күрте, етік және қолғап киемін.
        5.	Иә, мен жаңа киім сатып алғанды ұнатамын.
    `)
};
