import { Topic } from "..";
import dedent from 'dedent';

export const A1_5_TOPIC: Topic = {
    title: {
        kk: "КИІМ ТҮСТЕРІ",
        ru: "ЦВЕТА ОДЕЖДЫ",
        en: "CLOTHING COLORS"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    киім
                    көйлек
                    жейде
                    шалбар
                    белдемше
                    күрте
                    аяқкиім
                    етік
                    баскиім
                    орамал
                    қолғап
                    қызыл
                    көк
                    жасыл
                    сары
                    ақ
                    қара
                    қоңыр
                    сұр
                    күлгін
                    қызғылт
                    қызғылт сары
                    ашық
                    қою
                    сәнді

                    ГРАММАТИКА.
                    КҮШЕЙТПЕЛІ ШЫРАЙ.

                    ЕРЕЖЕ	ЖАСАЛУ ЖОЛЫ	МЫСАЛ
                    Белгілі бір сындық белгінің нәрседен өте артық не өте кем екенін білдіретін шырай түрі	Негізгі сын есімдердің алдынан күшейткіш буынның қосарлануы арқылы жасалады.	Сап – сары, жап – жарық, үп – үлкен.

                    Ескерту: Ақ, көк сөздерінің күшейтпелі шырай түрі төмендегідей болады: аппақ, көкпеңбек.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақ тілі	Русский
                    киім	одежда
                    көйлек	платье
                    жейде	рубашка
                    шалбар	брюки
                    белдемше	юбка
                    күрте	куртка
                    аяқкиім	обувь
                    етік	сапоги
                    баскиім	головной убор
                    орамал	платок
                    қолғап	перчатки
                    қызыл	красный
                    көк	синий
                    жасыл	зелёный
                    сары	жёлтый
                    ақ	белый
                    қара	чёрный
                    қоңыр	коричневый
                    сұр	серый
                    күлгін	фиолетовый
                    қызғылт	розовый
                    қызғылт сары	оранжевый
                    ашық	светлый
                    қою	тёмный
                    сәнді	модный

                    ГРАММАТИКА.
                    КҮШЕЙТПЕЛІ ШЫРАЙ. 
                    ПРЕВОСХОДНАЯ СТЕПЕНЬ ПРИЛАГАТЕЛЬНОГО.

                    ПРАВИЛО	СПОСОБ ОБРАЗОВАНИЯ	ПРИМЕР
                    Разряд прилагательного, обозначающий очень высокую или очень низкую степень признака предмета	Образуется путём добавления усилительного слога перед основой качественного прилагательного.	Ярко-жёлтый, очень светлый, очень большой.

                    Примечание: Усилительная форма слов «ақ» и «көк» образуется следующим образом: аппақ — белоснежный, көкпеңбек — очень синий.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақ тілі	English
                    киім	clothes
                    көйлек	dress
                    жейде	shirt
                    шалбар	trousers
                    белдемше	skirt
                    күрте	jacket
                    аяқкиім	shoes
                    етік	boots
                    баскиім	hat
                    орамал	scarf
                    қолғап	gloves
                    қызыл	red
                    көк	blue
                    жасыл	green
                    сары	yellow
                    ақ	white
                    қара	black
                    қоңыр	brown
                    сұр	grey
                    күлгін	purple
                    қызғылт	pink
                    қызғылт сары	orange
                    ашық	light
                    қою	dark
                    сәнді	fashionable

                    ГРАММАТИКА. GRAMMAR. 
                    КҮШЕЙТПЕЛІ ШЫРАЙ. SUPERLATIVE DEGREE OF ADJECTIVES.

                    RULE	FORMATION	EXAMPLE
                    A degree of an adjective that indicates a very high or very low degree of a quality of an object.	It is formed by adding an intensifying syllable before the stem of a qualitative adjective.	Bright yellow, very bright, very big.

                    Note: The intensified forms of the words «ақ» (white) and «көк» (blue) are formed as follows: аппақ — snow-white, көкпеңбек — very blue.
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                К_йлек, ж_йде, ш_лбар, к_рте, яқк_ім, баски_м, қ_зыл, к_к, жас_л, с_ры, қ_ра, ақк_ім
            `),
    reading: dedent(`
                Айгүл бүгін дүкенге барды. Ол қып-қызыл көйлек көрді. Көйлегі өте әдемі болды. Айгүл оны сатып алды. Оның ағасы аппақ көйлек емес, көк жейде алды. Әкесі қап-қара шалбар киді. Анасы жап-жасыл орамал тақты. Қарындасы сап-сары белдемше киді. Біздің отбасымыз түрлі түсті киімдерді жақсы көреді. 
            `),
    readingTest: [
        {
            "question": "Айгүл қандай көйлек сатып алды?",
            "answers": [
                "Көк",
                "Қып-қызыл",
                "Ақ",
                "Жасыл"
            ]
        },
        {
            "question": "Ағасы не алды?",
            "answers": [
                "Шалбар",
                "Көйлек",
                "Көк жейде",
                "Белдемше"
            ]
        },
        {
            "question": "Әкесі қандай шалбар киді?",
            "answers": [
                "Қап-қара",
                "Аппақ",
                "Сап-сары",
                "Жап-жасыл"
            ]
        },
        {
            "question": "Анасы қандай орамал тақты?",
            "answers": [
                "Көк",
                "Жап-жасыл",
                "Қып-қызыл",
                "Ақ"
            ]
        },
        {
            "question": "Күшейтпелі шырай сөзін табыңыз.",
            "answers": [
                "Көк",
                "Әдемі",
                "Қып-қызыл",
                "Киім"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-5_Киім-түстері.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Менің атым – __________. Менің сүйікті түсім – __________. Бүгін мен __________ бірге дүкенге бардым. Мен __________ футболка сатып алдым. Сонымен қатар __________ шалбар алдым. Анам __________ көйлек сатып алды. Дүкенде көптеген __________ болды. Мен әрқашан __________ және сәнді киінуге тырысамын. Сыртқы келбет адамның __________ көрсетеді. Менің жаңа киімдерім маған өте __________.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Қызыл, көк, жасыл, ақ, қара, сары, киім.
            `)
};
