import { Topic } from "..";
import dedent from 'dedent';

export const A1_6_TOPIC: Topic = {
    title: {
        kk: "КЕЛБЕТ. МІНЕЗ",
        ru: "ВНЕШНОСТЬ. ХАРАКТЕР",
        en: "APPEARANCE. CHARACTER"
    },
    description: {
        kk: "src/assets/document/a1/ru/6-сабақ. А1. Келбет, мінез (каз-рус).docx",
        ru: "src/assets/document/a1/ru/6-сабақ. А1. Келбет, мінез (каз-рус).docx",
        en: "src/assets/document/a1/en/6-сабақ. А1. Келбет, мінез (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        к_лбет, м_нез, әд_мі, ақылд_, мей_рімді, еңбекқ_р, көң_лді, саб_рлы, ұз_н бойлы, тол_қ, ары_, ұқ_пты.
    `),
    writingAnswer: dedent(`
        келбет, мінез, әдемі, ақылды, мейірімді, еңбекқор, көңілді, сабырлы, ұзын бойлы, толық, арық, ұқыпты.
    `),
    reading: dedent(`
        Менің атым – Данияр. Менің бойым орташа. Шашым қысқа әрі қара. Көзім қоңыр. Менің мінезім сабырлы және ашық. Мен адамдармен тез тіл табысамын. Достарым мені мейірімді, жауапты және еңбекқор адам деп айтады.Менің досымның аты – Арман. Ол менен ұзынырақ. Оның шашы қара, көзі көк. Арман өте көңілді әрі ақкөңіл. Ол спортты жақсы көреді. Біз екеуміз бір ұйымда жұмыс істейміз. Мен қазақ тілі пәнінің оқытушысымын, ал Арман бағдарламашы. Жұмыста бір-бірімізге көмектесеміз. Менің ойымша, адамның сыртқы келбеті маңызды, бірақ жақсы мінезі одан да маңыздырақ. Мейірімді, адал және еңбекқор адамды бәрі құрметтейді.
    `),
    readingTest: [
        {
            "question": "Даниярдың бойы қандай?",
            "answers": [
                "Ұзын",
                "Орташа",
                "Аласа",
                "Өте ұзын"
            ]
        },
        {
            "question": "Даниярдың көзі қандай түсті?",
            "answers": [
                "Көк",
                "Жасыл",
                "Қоңыр",
                "Қара"
            ]
        },
        {
            "question": "Арман Даниярдан қандай?",
            "answers": [
                "Аласа",
                "Ұзынырақ",
                "Толығырақ",
                "Кішірек"
            ]
        },
        {
            "question": "Даниярдың мінезі қандай?",
            "answers": [
                "Ашуланшақ",
                "Ұялшақ",
                "Сабырлы және ашық",
                "Жалқау"
            ]
        },
        {
            "question": "Қымбат сөзін салыстырмалы шырайға қойыңыз.",
            "answers": [
                "Қымбаттырақ",
                "Қып-қымбат",
                "Қымбатт",
                "Қымбатты"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) Орташа
        2.	б) Қоңыр
        3.	ә) Ұзынырақ 
        4.	б) Сабырлы және ашық 
        5.	а) Қымбаттырақ
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-6_Келбет.-Мінез.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Менің атым – __________. Мен жаңа __________ орналастым. Аружан __________ бойлы. Оның шашы __________. Нұржан менен __________. Мен одан __________. Нұржан өте __________. Біз бір-бірімізге __________. Жақсы мінез – адамның ең үлкен __________.
    `),
    listeningAnswer: dedent(`
        Менің атым – Айгүл. Мен жаңа жұмысқа орналастым. Аружан орта бойлы. Оның шашы ұзын. Нұржан менен ұзынырақ. Мен одан көңілдірекпін. Нұржан өте жауапты және еңбекқор. Біз бір-бірімізге көмектесеміз. Жақсы мінез – адамның ең үлкен байлығы.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Сіздің бойыңыз қандай?
        2.	Шашыңыздың түсі қандай?
        3.	Көзіңіздің түсі қандай?
        4.	Мінезіңіз қандай?
        5.	Сіз өзіңізді қандай адам деп санайсыз?
    `),
    speakingAnswer: dedent(`
        1.	Менің бойым орташа.
        2.	Шашым қара.
        3.	Көзім қоңыр.
        4.	Менің мінезім сабырлы және мейірімді.
        5.	Мен өзімді жауапты әрі еңбекқор адам деп санаймын.
    `)
};
