import { Topic } from "..";
import dedent from 'dedent';

export const A1_7_TOPIC: Topic = {
    title: {
        kk: "АЗЫҚ-ТҮЛІК",
        ru: "ПРОДУКТЫ ПИТАНИЯ",
        en: "GROCERIES"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    көкөніс
                    жеміс
                    қияр
                    алма
                    өрік
                    сәбіз
                    шие
                    жүзім
                    пияз
                    азық түлік
                    ас болсын!
                    сусын
                    тұз
                    бұрыш
                    қант
                    май
                    сату
                    сатып алу
                    түрі
                    бар
                    ештеңе

                    ГРАММАТИКА
                    КӨПТІК ЖАЛҒАУ. САНАЛАТЫН/САНАЛМАЙТЫН ЗАТ ЕСІМДЕР

                    Көптік жалғау заттың біреу емес, бірнеше екенін білдіреді. 
                    Жекеше	Көпше
                    кітап	кітаптар
                    алма	алмалар
                    оқушы	оқушылар
                    дүкен	дүкендер
                    гүл	гүлдер

                    Көптік жалғаулары:

                    Жалғау	Мысал
                    -лар	балалар
                    -лер	үйлер
                    -дар	адамдар
                    -дер	гүлдер
                    -тар	кітаптар
                    -тер	мектептер
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақ тілінде	Русский
                    көкөніс	овощи
                    жеміс	фрукты
                    қияр	огурцы
                    алма	яблоко
                    өрік	абрикос
                    сәбіз	морковь
                    шие	вишня
                    жүзім	виноград
                    пияз	лук
                    азық түлік	продукты
                    ас болсын!	приятного аппетита!
                    сусын	напиток
                    тұз	соль
                    бұрыш	перец
                    қант	сахар
                    май	масло
                    сату	продавать
                    сатып алу	покупать
                    түрі	вид: форма
                    бар	есть
                    ештеңе	ничего

                    ГРАММАТИКА
                    КӨПТІК ЖАЛҒАУ. САНАЛАТЫН/САНАЛМАЙТЫН ЗАТ ЕСІМДЕР
                    МНОЖЕСТВЕННОЕ ЧИСЛО. ИСЧИСЛЯЕМЫЕ/НЕИСЧИСЛЯЕМЫЕ СУЩЕСТВИТЕЛЬНЫЕ

                    Множественное число обозначает, что предмет не один, а несколько.
                    Единственное	Множественное
                    Кітап (книга)	Кітаптар (книги)
                    Алма (яблоко)	Алмалар (яблоки)
                    Оқушы (ученик)	Оқушылар (ученики)
                    Дүкен (магазин)	Дүкендер (магазины)
                    Гүл (цветок)	Гүлдер (цветы)

                    Множественные окончания:
                    Окончание	Пример
                    -лар	балалар
                    -лер	үйлер
                    -дар	адамдар
                    -дер	гүлдер
                    -тар	кітаптар
                    -тер	мектептер
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақ тілінде	English
                    көкөніс	vegetables
                    жеміс	fruit
                    қияр	cucumber
                    алма	apple
                    өрік	apricot
                    сәбіз	carrot
                    шие	cherry
                    жүзім	grapes
                    пияз	onion
                    азық түлік	groceries
                    ас болсын!	Enjoy your meal!
                    сусын	drink
                    тұз	salt
                    бұрыш	pepper
                    қант	sugar
                    май	oil
                    сату	to sell
                    сатып алу	to buy
                    түрі	type
                    бар	there is / there are
                    ештеңе	nothing

                    ГРАММАТИКА. GRAMMAR. 
                    КӨПТІК ЖАЛҒАУ. САНАЛАТЫН/САНАЛМАЙТЫН ЗАТ ЕСІМДЕР
                    PLURAL. COUNTABLE/UNCOUNTABLE NOUNS

                    Тhe plural form indicates that there is more than one object.
                    Singular	
                    Plural
                    Кітап (book)	Кітаптар (books)
                    Алма (apple)	Алмалар (apples)
                    Оқушы (student)	Оқушылар (students)
                    Дүкен (shop)	Дүкендер (shops)
                    Гүл (flower)	Гүлдер (flowers)

                    Plural endings
                    Ending	Examples
                    -лар	балалар
                    -лер	үйлер
                    -дар	адамдар
                    -дер	гүлдер
                    -тар	кітаптар
                    -тер	мектептер
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                с_біз, п_яз, қ_зан_қ, алм_, қи_р, ж_зім, өр_к, д_мді, қышқ_л, ащ_, қ_шқ_л, аз_қ-түл_к.
            `),
    reading: dedent(`
                <b>Банан пайдалы жеміс</b>

                Банан дәруменге бай жеміс. Италияда әншілер бананмен тамағын емдейді. Үндістанда бұл жеміс қасиетті тағам. Оны қонақтардың алдына қояды.
	            Еуропада таңертеңгі және түскі асқа оқушыларға банан береді. Кубада бананды етпен бірге пісіреді. Ал Венесуэллада бананды қуырады және күрішпен бірге береді. Бананды ауыр жаттығулардан кейін жеу керек. Бананды күнде жеу керек. Ол денсаулыққа күш береді.
            `),
    readingTest: [
        {
            "question": "Банан неге бай жеміс?",
            "answers": [
                "микроэлементтерге",
                "дәруменге",
                "",
                ""
            ]
        },
        {
            "question": "Әншілер бананмен нені емдейді?",
            "answers": [
                "асқазанын",
                "бауырын",
                "тамағын",
                "шашын"
            ]
        },
        {
            "question": "… бұл жеміс қасиетті тағам.",
            "answers": [
                "Үндістанда",
                "Африкада",
                "Австралияда",
                "Амазонкада"
            ]
        },
        {
            "question": "Еуропада оқушыларға қай уақытта банан береді?",
            "answers": [
                "Түсте",
                "Таңертең және кешке",
                "ұйықтар алдында",
                "Таңертең және түсте"
            ]
        },
        {
            "question": "“Банан” сөзіне көптік жалғау дұрыс жалғанған қатарды табыңыз.",
            "answers": [
                "банантер",
                "бананлар",
                "банандар",
                "банандер"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-7_Азық-түлік.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                -	Сәлеметсіз бе?
                -	Сәлеметпін.
                -	Бұл қандай_________?
                -	Бұл__________ дүкені. Не сатып аласыз?
                -	Мен нан, _____________ аламын.
                -	Сізде __________ қандай түрлері бар?
                -	Бізде алма, _____________, жүзім бар.
                -	Маған бір килограмм________ және бір килограмм _________беріңіз.
                -	Тағы не аласыз?
                -	Басқа __________керек емес.
                -	Рақмет, сау болыңыз.
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Дүкен, ұн, шай, пияз, қияр, қызанақ, жүзім.
            `)
};
