import { Topic } from "..";
import dedent from 'dedent';

export const A1_7_TOPIC: Topic = {
    title: {
        kk: "АЗЫҚ-ТҮЛІК",
        ru: "ПРОДУКТЫ ПИТАНИЯ",
        en: "GROCERIES"
    },
    description: {
        kk: "src/assets/document/a1/ru/7-сабақ. А1. Азық-түлік (каз-рус).docx",
        ru: "src/assets/document/a1/ru/7-сабақ. А1. Азық-түлік (каз-рус).docx",
        en: "src/assets/document/a1/en/7-сабақ. А1. Азық-түлік (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        с_біз, п_яз, қ_зан_қ, алм_, қи_р, ж_зім, өр_к, д_мді, қышқ_л, ащ_, қ_шқ_л, аз_қ-түл_к.
    `),
    writingAnswer: dedent(`
        сәбіз, пияз, қызанақ, алма, қияр, жүзім, өрік, дәмді, қышқыл, ащы, қышқыл, азық-түлік.
    `),
    reading: dedent(`
        <b>Банан пайдалы жеміс</b>

        Банан дәруменге бай жеміс. Италияда әншілер бананмен тамағын емдейді. Үндістанда бұл жеміс қасиетті тағам. Оны қонақтардың алдына қояды.
        Еуропада таңертеңгі және түскі асқа оқушыларға банан береді. Кубада бананды етпен бірге пісіреді. Ал Венесуэллада бананды қуырады және күрішпен бірге береді. Бананды ауыр жаттығулардан кейін жеу керек. Бананды күнде жеу керек. Ол денсаулыққа күш береді.
    `),
    readingTest: [
        {
            "question": "Банан неге бай жеміс?",
            "answers": [
                "микроэлементтерге",
                "дәруменге",
                "",
                ""
            ]
        },
        {
            "question": "Әншілер бананмен нені емдейді?",
            "answers": [
                "асқазанын",
                "бауырын",
                "тамағын",
                "шашын"
            ]
        },
        {
            "question": "… бұл жеміс қасиетті тағам.",
            "answers": [
                "Үндістанда",
                "Африкада",
                "Австралияда",
                "Амазонкада"
            ]
        },
        {
            "question": "Еуропада оқушыларға қай уақытта банан береді?",
            "answers": [
                "Түсте",
                "Таңертең және кешке",
                "ұйықтар алдында",
                "Таңертең және түсте"
            ]
        },
        {
            "question": "“Банан” сөзіне көптік жалғау дұрыс жалғанған қатарды табыңыз.",
            "answers": [
                "банантер",
                "бананлар",
                "банандар",
                "банандер"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	Ә) дәруменге
        2.	Б) тамағын
        3.	А) Үндістанда
        4.	В) Таңертең және түсте
        5.	Б) банандар
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-7_Азық-түлік.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        -	Сәлеметсіз бе?
        -	Сәлеметпін.
        -	Бұл қандай_________?
        -	Бұл__________ дүкені. Не сатып аласыз?
        -	Мен нан, _____________ аламын.
        -	Сізде __________ қандай түрлері бар?
        -	Бізде алма, _____________, жүзім бар.
        -	Маған бір килограмм________ және бір килограмм _________беріңіз.
        -	Тағы не аласыз?
        -	Басқа __________керек емес.
        -	Рақмет, сау болыңыз.
    `),
    listeningAnswer: dedent(`
        -	Сәлеметсіз бе?
        -	Сәлеметпін.
        -	Бұл қандай дүкен?
        -	Бұл азық түлік дүкені. Не сатып аласыз?
        -	Мен нан, шай, сүт аламын.
        -	Сізде жемістің қандай түрлері бар?
        -	Бізде алма, шие, өрік, жүзім бар.
        -	Маған бір килограмм алма және бір килограмм өрік беріңіз.
        -	Тағы не аласыз?
        -	Басқа ештеңе керек емес.
        -	Рақмет, сау болыңыз
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Сәбіз, пияз, қызанақ сөздерінің жалпы атауы?
        2.	Алма жеміс пе? Көкөніс пе?
        3.	Бананды қандай жаттығулардан кейін жеу керек?
        4.	“Продукты” сөзінің қазақша аудармасы қандай?
        5.	“Азық түлік дүкенінде жиырма төрт терезе… бар. Көп нүктенің орнына көптік жалғауы жалғана ма?
    `),
    speakingAnswer: dedent(`
        1.	Көкөніс
        2.	Жеміс.
        3.	Бананды ауыр жаттығулардан кейін жеу керек.
        4.	Азық-түлік.
        5.	Жоқ жалғанбайды.
    `)
};
