import { Topic } from "..";
import dedent from 'dedent';

export const A1_8_TOPIC: Topic = {
    title: {
        kk: "МАМАНДЫҚ",
        ru: "ПРОФЕССИЯ",
        en: "PROFESSION"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    Маман
                    Мамандық
                    Тәрбиеші
                    Жүргізуші
                    Мұғалім
                    Сатушы
                    Дәрігер
                    Дәріхана
                    Емхана
                    Мектеп
                    Әріп
                    Сөз
                    Балабақша
                    Білу
                    Жақсы көру
                    Жұмыс жасау
                    Жұмыс
                    Кітап
                    Сабақ
                    Тақта
                    Тапсырма
                    Дәптер
                    Мекеме
                    Зейнеткер
                    Әртүрлі
                    Көлік
                    Дүкен
                    Алу
                    Беру
                    Кешігіп келу
                    Сыйлау
                    Айту

                    ГРАММАТИКА. GRAMMAR. 
                    ЕТІСТІК. TO VERB.

                    Етістік – заттың іс-әрекетін, қимылын білдіретін сөз табы. Сұрақтары: не істейді? не қылды? қайтті?
                    Мысалдар
                    Зат есім	Етістік
                    Мұғалім	сабақ береді
                    Дәрігер	емдейді
                    Сатушы	сатады
                    Жүргізуші	жүргізеді
                    Тәрбиеші	тәрбиелейді

                    Жіктелуі (осы шақ)
                    Жұмыс жасау
                    Жақ	Мысал
                    Мен	жұмыс жасаймын
                    Сен	жұмыс жасайсың
                    Сіз	жұмыс жасайсыз
                    Ол	жұмыс жасайды

                    Болымсыз етістік
                    -ма/-ме, -ба/-бе, -па/-пе
                    Болымды	Болымсыз
                    оқиды	оқымайды
                    жұмыс істейді	жұмыс істемейді
                    біледі	білмейді
                    барады	бармайды

                    Мысалдар
                    ●	Мен мектепте оқимын.
                    ●	Әкем дәрігер болып жұмыс істейді.
                    ●	Анам мұғалім.
                    ●	Мен кешікпеймін.
                    ●	Біз тапсырма орындаймыз.

                    Есте сақтаңыз!
                    Сұрақ	Жауап
                    Не істейді?	оқиды
                    Не істейді?	жұмыс істейді
                    Не істейді?	емдейді
                    Не істейді?	сатады
                    Не істейді?	жүргізеді
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақша	Русский
                    Маман	Специалист
                    Мамандық	Профессия
                    Тәрбиеші	Воспитатель
                    Жүргізуші	Водитель
                    Мұғалім	Учитель
                    Сатушы	Продавец
                    Дәрігер	Врач
                    Дәріхана	Аптека
                    Емхана	Поликлиника
                    Мектеп	Школа
                    Әріп	Буква
                    Сөз	Слово
                    Балабақша	Детский сад
                    Білу	Знать
                    Жақсы көру	Любить
                    Жұмыс жасау	Работать
                    Жұмыс	Работа
                    Кітап	Книга
                    Сабақ	Урок
                    Тақта	Доска
                    Тапсырма	Задание
                    Дәптер	Тетрадь
                    Мекеме	Учреждение
                    Зейнеткер	Пенсионер
                    Әртүрлі	Разный
                    Көлік	Транспорт
                    Дүкен	Магазин
                    Алу	Брать
                    Беру	Давать
                    Кешігіп келу	Прийти с опозданием
                    Сыйлау	Уважать
                    Айту	Сказать, говорить

                    ГРАММАТИКА
                    ЕТІСТІК
                    ГЛАГОЛ

                    Глагол – это слово, обозначающее действие, действие предмета. Вопросы: Что делает? что случилось? вернулся? Примеры:

                    Зат есім (Существительное)	Етістік 
                    (Глагол)
                    Мұғалім (учитель)	сабақ береді (преподает)
                    Дәрігер (врач)	емдейді (лечит)
                    Сатушы (продавец)	сатады (продает)
                    Жүргізуші (водитель)	жүргізеді (ведет)
                    Тәрбиеші (воспитатель)	тәрбиелейді (воспитывает)

                    Спряжение (настоящее время).
                    Работать
                    Жақ (лицо)	Мысал (пример)
                    Мен (Я)	жұмыс жасаймын (работаю)
                    Сен (Ты)	жұмыс жасайсың (работаешь)
                    Сіз (Вы)	жұмыс жасайсыз (работаете)
                    Ол (Он, она)	жұмыс жасайды (работает)

                    Отрицательная форма глагола
                    отрицательные аффиксы (суффиксы) глагола: -ма/-ме, -ба/-бе, -па/-пе
                    Болымды (утвердительная форма)	Болымсыз (отрицательная форма)
                    оқиды (читает)	оқымайды (не читает)
                    жұмыс істейді (работает)	жұмыс істемейді (не работает)
                    біледі (знает)	білмейді (не знает)
                    барады (идет)	бармайды (не идет)

                    Примеры:
                    •	Мен мектепте оқимын. — Я учусь в школе.
                    •	Әкем дәрігер болып жұмыс істейді. — Мой отец работает врачом.
                    •	Анам мұғалім. — Моя мама — учительница.
                    •	Мен кешікпеймін. — Я не опаздываю.
                    •	Біз тапсырма орындаймыз. — Мы выполняем задание.

                    Запомните!
                    Сұрақ (вопрос)	Жауап 
                    (ответ) 
                    не істейді? (что делает?)	оқиды (читает)
                    не істейді?	жұмыс істейді (работает)
                    не істейді?	емдейді (лечит)
                    не істейді?	сатады (продает)
                    не істейді?	жүргізеді (водит)
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	English
                    Маман	Specialist
                    Мамандық	Profession
                    Тәрбиеші	Kindergarten teacher
                    Жүргізуші	Driver
                    Мұғалім	Teacher
                    Сатушы	Seller
                    Дәрігер	Doctor
                    Дәріхана	Pharmacy
                    Емхана	Polyclinic
                    Мектеп	School
                    Әріп	Letter
                    Сөз	Word
                    Балабақша	Kindergarten
                    Білу	Know
                    Жақсы көру	Like
                    Жұмыс жасау	Work
                    Жұмыс	Work
                    Кітап	Book
                    Сабақ	Lesson
                    Тақта	Board
                    Тапсырма	Task
                    Дәптер	Notebook
                    Мекеме	Institution
                    Зейнеткер	Pensioner
                    Әртүрлі	Different
                    Көлік	Transport
                    Дүкен	Shop
                    Алу	Take
                    Беру	Give
                    Кешігіп келу	Come late
                    Сыйлау	Respect
                    Айту	Say, speak

                    ГРАММАТИКА. GRAMMAR. 
                    ЕТІСТІК. TO VERB

                    Verb is a word that denotes an action or an action performed by an object. Questions: What does he/she do? What happened? Did he/she return?
                    Examples: read, write, work, go, come, study, speak.
                    Зат есім (Noun)	Етістік (Verb)
                    Мұғалім (teacher)	сабақ береді (teaches)
                    Дәрігер (doctor)	емдейді (treats)
                    Сатушы (seller)	сатады (sells)
                    Жүргізуші (driver)	жүргізеді (drives)
                    Тәрбиеші (educator)	тәрбиелейді (educates)
                    Present Simple:
                    To work
                    Жақ 	Мысал (example)
                    Мен (I)	жұмыс жасаймын (work)
                    Сен (You)	жұмыс жасайсың (work)
                    Сіз (You)	жұмыс жасайсыз (work)
                    Ол (He, she, it)	жұмыс жасайды (works)

                    Negative form of the verb
                    Negative verb suffixes: -ма/-ме, -ба/-бе, -па/-пе
                    Болымды (Affirmative form)	Болымсыз (Negative form)
                    оқиды (reads)	оқымайды (doesn’t read)
                    жұмыс істейді (works)	жұмыс істемейді (doesn’t work)
                    біледі (knows)	білмейді (doesn’t know)
                    барады (goes)	бармайды (doesn’t go)
                    Examples:
                    •	Мен мектепте оқимын. — I study at school.
                    •	Әкем дәрігер болып жұмыс істейді. — My father works as a doctor.
                    •	Анам мұғалім. — My mother is a teacher.
                    •	Мен кешікпеймін. — I am not late. / I don’t arrive late.
                    •	Біз тапсырма орындаймыз. — We do the task. / We complete the assignment.
                    Remember!
                    Сұрақ (question)	Жауап (answer) 
                    не істейді? (What does he/she do?)	оқиды (reads)
                    не істейді?	жұмыс істейді (works)
                    не істейді?	емдейді (treats)
                    не істейді?	сатады (sells)
                    не істейді?	жүргізеді (drives)
                `)
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
                Мам_н, мам_ндық, дәр_гер, мұғ_лім, ж_ргі_зуші, дәпт_р, әр_п, тапс_рм_, мек_ме, з_йнетк_р, бал_бақш_, көл_к.
            `),
    reading: dedent(`
                Менің атым – Қасым. Мен қалада тұрамын. Менің отбасым үлкен. Олар: атам, әжем, әкем, анам, мен және қарындасым.
                Әкемнің аты – Ғалым. Ол – мұғалім. Анамның есімі – Айгүл. Оның мамандығы – дәрігер. Қарындасымның аты – Айжан. Ол – оқушы. Мен студентпін. Атам мен әжем – зейнеткерлер. Мен отбасымды жақсы көремін және сыйлаймын.
            `),
    readingTest: [
        {
            "question": "Қасым қайда тұрады?",
            "answers": [
                "ауылда",
                "қалада",
                "мектепте",
                "емханада"
            ]
        },
        {
            "question": "Әкесінің мамандығы қандай?",
            "answers": [
                "дәрігер",
                "мұғалім",
                "сатушы",
                "жүргізуші"
            ]
        },
        {
            "question": "Анасының мамандығы қандай?",
            "answers": [
                "мұғалім",
                "дәрігер",
                "тәрбиеші",
                "сатушы"
            ]
        },
        {
            "question": "Қарындасы кім?",
            "answers": [
                "студент",
                "дәрігер",
                "оқушы",
                "мұғалім"
            ]
        },
        {
            "question": "Болымсыз етістіктің жұрнақтары?",
            "answers": [
                "-ма, -ме",
                "-мын, -мін",
                "-ар, -ер, -р",
                "-ған, -ген"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/A1-8_Мамандық.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Ержан:
                – Сәлеметсіз бе! Танысайық. Менің___________ – Ержан. Мен _____________.
                Сымбат:
                – Ал мен ___________, аты-жөнім – Сымбат Сапарқызы. Сіз қай қалада тұрасыз?
                Ержан:
                – Мен Атырауда тұрамын.
                Сымбат:
                – Неше жастасыз?
                Ержан:
                – Мен _______ жастамын. Сіз ше?
                Сымбат:
                – Мен жиырма сегіздемін. Мен ____________ жұмыс істеймін. Ал сіз ше?
                Ержан:
                – Мұнай компаниясында.
                Сымбат:
                – Жақсы, танысқаныма қуаныштымын!
                Ержан:
                – Мен ____ қуаныштымын!
            `),
    speakingTitle: {
        kk: "Сөздерді аударып айтыңыз.",
        ru: "Переведите слова.",
        en: "Translate the words."
    },
    speaking: dedent(`
                Мұғалім, дәрігер, жүргізуші, сатушы, дәріхана, балабақша, мектеп.
            `)
};
