import { Topic } from "..";
import dedent from 'dedent';

export const A1_8_TOPIC: Topic = {
    title: {
        kk: "МАМАНДЫҚ",
        ru: "ПРОФЕССИЯ",
        en: "PROFESSION"
    },
    description: {
        kk: "src/assets/document/a1/ru/8-сабақ. А1. Мамандық (каз-рус).docx",
        ru: "src/assets/document/a1/ru/8-сабақ. А1. Мамандық (каз-рус).docx",
        en: "src/assets/document/a1/en/8-сабақ. А1. Мамандық (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Мам_н, мам_ндық, дәр_гер, мұғ_лім, ж_ргі_зуші, дәпт_р, әр_п, тапс_рм_, мек_ме, з_йнетк_р, бал_бақш_, көл_к.
    `),
    writingAnswer: dedent(`
        маман, мамандық, дәрігер, мұғалім, жүргізуші, дәптер, әріп, тапсырма, мекеме, зейнеткер, балабақша, көлік.
    `),
    reading: dedent(`
        Менің атым – Қасым. Мен қалада тұрамын. Менің отбасым үлкен. Олар: атам, әжем, әкем, анам, мен және қарындасым.
        Әкемнің аты – Ғалым. Ол – мұғалім. Анамның есімі – Айгүл. Оның мамандығы – дәрігер. Қарындасымның аты – Айжан. Ол – оқушы. Мен студентпін. Атам мен әжем – зейнеткерлер. Мен отбасымды жақсы көремін және сыйлаймын.
    `),
    readingTest: [
        {
            "question": "Қасым қайда тұрады?",
            "answers": [
                "ауылда",
                "қалада",
                "мектепте",
                "емханада"
            ]
        },
        {
            "question": "Әкесінің мамандығы қандай?",
            "answers": [
                "дәрігер",
                "мұғалім",
                "сатушы",
                "жүргізуші"
            ]
        },
        {
            "question": "Анасының мамандығы қандай?",
            "answers": [
                "мұғалім",
                "дәрігер",
                "тәрбиеші",
                "сатушы"
            ]
        },
        {
            "question": "Қарындасы кім?",
            "answers": [
                "студент",
                "дәрігер",
                "оқушы",
                "мұғалім"
            ]
        },
        {
            "question": "Болымсыз етістіктің жұрнақтары?",
            "answers": [
                "-ма, -ме",
                "-мын, -мін",
                "-ар, -ер, -р",
                "-ған, -ген"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) қалада
        2.	ә) мұғалім
        3.	ә) дәрігер
        4.	б) оқушы
        5.	а) -ма, -ме
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-8_Мамандық.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Ержан:
        – Сәлеметсіз бе! Танысайық. Менің___________ – Ержан. Мен _____________.
        Сымбат:
        – Ал мен ___________, аты-жөнім – Сымбат Сапарқызы. Сіз қай қалада тұрасыз?
        Ержан:
        – Мен Атырауда тұрамын.
        Сымбат:
        – Неше жастасыз?
        Ержан:
        – Мен _______ жастамын. Сіз ше?
        Сымбат:
        – Мен жиырма сегіздемін. Мен ____________ жұмыс істеймін. Ал сіз ше?
        Ержан:
        – Мұнай компаниясында.
        Сымбат:
        – Жақсы, танысқаныма қуаныштымын!
        Ержан:
        – Мен ____ қуаныштымын!
    `),
    listeningAnswer: dedent(`
        Ержан:
        – Сәлеметсіз бе! Танысайық. Менің аты-жөнім – Ержан. Мен мұнайшымын.
        Сымбат:
        – Ал мен дәрігермін, аты-жөнім – Сымбат Сапарқызы. Сіз қай қалада тұрасыз?
        Ержан:
        – Мен Атырауда тұрамын.
        Сымбат:
        – Неше жастасыз?
        Ержан:
        – Мен отыз жастамын. Сіз ше?
        Сымбат:
        – Мен жиырма сегіздемін. Мен ауруханада жұмыс істеймін. Ал сіз ше?
        Ержан:
        – Мұнай компаниясында.
        Сымбат:
        – Жақсы, танысқаныма қуаныштымын!
        Ержан:
        – Мен де қуаныштымын!
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Сенің мамандығың қандай?
        2.	«Мамандық» сөзі орыс тілінде қалай айтылады?
        3.	Мұғалім қайда жұмыс істейді?
        4.	«Жұмыс істеу» қандай сөз табына жатады?
        5.	Болымсыз етістікке мысал келтіріңіз.
    `),
    speakingAnswer: dedent(`
        1.	Менің мамандығым мұғалім.
        2.	«Мамандық» сөзінің орыс тіліндегі аудармасы профессия
        3.	Мұғалім мектепте жұмыс істейді.
        4.	«Жұмыс істеу» етістікке жатады.
        5.	Мысалы, жұмыс істемейді, оқымайды.
    `)
};
