import { Topic } from "..";
import dedent from 'dedent';

export const A1_9_TOPIC: Topic = {
    title: {
        kk: "МЕНІҢ ҮЙІМ. МЕКЕНЖАЙ",
        ru: "МОЙ ДОМ. АДРЕС",
        en: "MY HOME. ADDRESS"
    },
    description: {
        kk: "src/assets/document/a1/ru/9-сабақ. А1. Менің үйім. мекенжай (каз-рус).docx",
        ru: "src/assets/document/a1/ru/9-сабақ. А1. Менің үйім. мекенжай (каз-рус).docx",
        en: "src/assets/document/a1/en/9-сабақ. А1. Менің үйім. Мекенжай (каз-англ).docx"
    },
    writingTitle: {
        kk: "Түсіп қалған әріпті жазыңыз.",
        ru: "Вставьте пропущенную букву.",
        en: "Write the missing letter."
    },
    writing: dedent(`
        Ү_де, п_тер, мекен_айым, к_ше , б_лме, ү_ден, дүк_ннен, аялд_мадан, Ақт_беде, қ_нақ бөлме
    `),
    writingAnswer: dedent(`
        үйде, пәтер, мекенжайым, көше, бөлме, үйден, дүкеннен, аялдамын, ақтөбеде, қонақ бөлме.
    `),
    reading: dedent(`
        Мен Ақтөбе қаласында тұрамын. Менің мекенжайым – Абай көшесі, 15-үй, 12-пәтер. Біздің үйіміз қалада орналасқан. Үйіміздің жанында мектеп, дүкен және саябақ бар. Мен таңертең үйден жұмысқа барамын. Кешке жұмыстан үйге келемін. Демалыс күні саябақта серуендеймін. Кейде дүкеннен азық-түлік сатып аламын. Мен өз үйімді жақсы көремін
    `),
    readingTest: [
        {
            "question": "Кейіпкер қайда тұрады?",
            "answers": [
                "Ауылда",
                "Ақтөбе қаласында",
                "Астанада",
                "Шымкентте"
            ]
        },
        {
            "question": "Үйдің жанында не бар?",
            "answers": [
                "Әуежай",
                "Банк",
                "Аурухана",
                "Мектеп, дүкен және саябақ"
            ]
        },
        {
            "question": "Таңертең ол қайдан шығады?",
            "answers": [
                "Жұмыстан",
                "Үйден",
                "Дүкеннен",
                "Мектептен"
            ]
        },
        {
            "question": "Демалыс күні қайда серуендейді?",
            "answers": [
                "Саябақта",
                "Дүкенде",
                "Мектепте",
                "Үйде"
            ]
        },
        {
            "question": "Мәтінде жатыс септіктегі сөзді табыңыз.",
            "answers": [
                "Үйден",
                "Дүкеннен",
                "Қалада",
                "Үйге"
            ]
        }
    ],
    readingAnswer: dedent(`
        1. Ә) Ақтөбе қаласында 
        2. В) Мектеп, дүкен және саябақ 
        3. Ә) Үйден 
        4. A) Саябақта 
        5. Б) Қалада 
    `),
    listeningAudioPath: `src/assets/audio/a1/A1-9_Менің-үйім.-Мекенжай.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Менің атым – __________. Мен __________ қаласында тұрамын. Менің мекенжайым – __________ даңғылы. Пәтер __________ қабатта орналасқан. Үйіміз __________ әрі жарық. Мен күн сайын __________ шығамын. Мен __________ кешкі сағат алтыда қайтамын. Демалыс күндері __________ демаламын.
    `),
    listeningAnswer: dedent(`
        Менің атым – Әлібек. Мен Ақтөбе қаласында тұрамын. Менің мекенжайым – Әлия Молдағұлова даңғылы. Пәтер төртінші қабатта орналасқан. Үйіміз кең, әрі жарық. Мен күн сайын үйден шығамын. Мен жұмыстан кешкі сағат алтыда қайтамын. Демалыс күндері үйде демаламын.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the questions."
    },
    speaking: dedent(`
        1.	Әлібек қай қалада тұрады?
        2.	Оның мекенжайы қандай?
        3.	Пәтері нешінші қабатта?
        4.	Ол таңертең қайдан шығады?
        5.	Ол кешке қайдан қайтады?
    `),
    speakingAnswer: dedent(`
        1.	Әлібек Ақтөбе қаласында тұрады.
        2.	Оның мекенжайы – Әлия Молдағұлова даңғылы, 25-үй, 18-пәтер.
        3.	Пәтері төртінші қабатта орналасқан.
        4.	Ол таңертең үйден шығады.
        5.	Ол кешке жұмыстан қайтады.
    `)
};
