import { Topic } from "..";
import dedent from 'dedent';

export const C1_4_TOPIC: Topic = {
    title: {
        kk: "ҚАРЖЫЛЫҚ САУАТТЫЛЫҚ",
        ru: "ҚАРЖЫЛЫҚ САУАТТЫЛЫҚ",
        en: "ҚАРЖЫЛЫҚ САУАТТЫЛЫҚ"
    },
    description: {
        kk: "src/assets/document/c1/kk/4-сабақ. С1 Қаржылық сауаттылық (өзгертілген).docx",
        ru: "src/assets/document/c1/kk/4-сабақ. С1 Қаржылық сауаттылық (өзгертілген).docx",
        en: "src/assets/document/c1/kk/4-сабақ. С1 Қаржылық сауаттылық (өзгертілген).docx",
    },
    writingTitle: {
        kk: "Сөйлемдерді аяқтаңыз.",
        ru: "Сөйлемдерді аяқтаңыз.",
        en: "Сөйлемдерді аяқтаңыз."
    },
    writing: dedent(`
        1.	Егер адам табысын жоспарламаса, ________________________, сондықтан қаржылық қиындық туындайды.
        2.	Кейбір адамдар көп ақша табады, бірақ ________________________, өйткені олар шығынды бақыламайды.
        3.	Адам несие алмас бұрын, ________________________, әйтпесе қарыз көбейеді.
        4.	Егер жастар қаржылық сауаттылықты ерте үйренсе, ________________________, сондықтан болашақта тұрақты өмір сүре алады.
        5.	Кейде адамдар ақшаны үнемдейді, алайда ________________________, себебі қаржылық тәртіп жетіспейді.
        6.	Адам инвестиция жасағысы келсе, ________________________, өйткені тәуекел деңгейі әртүрлі болады.
        7.	Егер адам қаржылық мақсаттарын нақты белгілесе, ________________________, сондықтан өз қаражатын тиімді басқара алады.
    `),
    writingAnswer: dedent(`
        1.	Егер адам табысын жоспарламаса, ақшасы тез жұмсалады, сондықтан қаржылық қиындық туындайды.
        2.	Кейбір адамдар көп ақша табады, бірақ оны дұрыс басқара алмайды, өйткені олар шығынды бақыламайды.
        3.	Адам несие алмас бұрын, барлық тәуекелді есептеуі керек, әйтпесе қарыз көбейеді.
        4.	Егер жастар қаржылық сауаттылықты ерте үйренсе, ақшаны тиімді басқаруды меңгереді, сондықтан болашақта тұрақты өмір сүре алады.
        5.	Кейде адамдар ақшаны үнемдейді, алайда жоспарсыз шығын жасайды, себебі қаржылық тәртіп жетіспейді.
        6.	Адам инвестиция жасағысы келсе, қаржы нарығы туралы ақпаратты зерттеуі қажет, өйткені тәуекел деңгейі әртүрлі болады.
        7.	Егер адам қаржылық мақсаттарын нақты белгілесе, оған жету үшін жоспарлы түрде әрекет етеді, сондықтан өз қаражатын тиімді басқара алады.
    `),
    reading: dedent(`
        <b>Қаржылық сауаттылықтың маңызы</b>

        Қазіргі қоғамда қаржылық сауаттылық өте маңызды дағдыға айналды. Көп адам жоғары табыс тапқысы келеді, бірақ қаржыны дұрыс басқаруды бәрі бірдей біле бермейді. Егер адам табысын жоспарламаса, ақшасы тез жұмсалады, сондықтан қаржылық қиындықтар пайда болады.
        Кейбір жастар жалақы алған күні барлық ақшасын жұмсап қояды, алайда болашақтағы шығынды есептемегендіктен, айдың соңында қарыз іздеуге мәжбүр болады. Мамандардың пікірінше, адам табысының белгілі бір бөлігін үнемдеп отырса, қаржылық тұрақтылық қалыптасады.
        Қазіргі кезде банктік қызметтер мен онлайн төлем жүйелері кең таралған. Егер адам қаржылық қауіпсіздік ережелерін сақтамаса, алаяқтардың құрбаны болуы мүмкін, сондықтан жеке мәліметтерді қорғау өте маңызды.
        Көптеген елдерде қаржылық сауаттылық мектептен бастап оқытылады, өйткені жастар ақшаны дұрыс басқаруды ерте үйренсе, болашақта саналы шешім қабылдай алады. Мамандардың айтуынша, қаржылық сауатты адам тек ақша жинап қана қоймай, табысын көбейтудің тиімді жолдарын да іздейді.
    `),
    readingTest: [
        {
            "question": "Кейбір адамдар не себепті қаржылық қиындыққа тап болады?",
            "answers": [
                "спортпен көп айналысқандықтан",
                "табысын дұрыс жоспарламағандықтан",
                "жиі саяхаттағандықтан",
                "кітап көп оқығандықтан"
            ]
        },
        {
            "question": "Айдың соңында қаражаттың жетіспеуінің негізгі себебі қандай?",
            "answers": [
                "ақша жинау",
                "шығынды бақыламау",
                "достармен кездесу",
                "демалысқа шығу"
            ]
        },
        {
            "question": "Қаржылық жоспар адамға не үшін қажет?",
            "answers": [
                "уақытты бос өткізу үшін",
                "күтпеген шығындарға дайын болу үшін",
                "қарыз алу үшін",
                "тек табысты көбейту үшін"
            ]
        },
        {
            "question": "Қаржылық сауатты адам несие алар алдында нені есептейді?",
            "answers": [
                "демалыс уақытын",
                "тәуекел деңгейін",
                "достарының пікірін",
                "күн тәртібін"
            ]
        },
        {
            "question": "Қазіргі кезде қандай жүйе кең таралған?",
            "answers": [
                "кітапхана жүйесі",
                "онлайн банкинг жүйесі",
                "спорт жүйесі",
                "көлік жүйесі"
            ]
        },
        {
            "question": "Интернетте қандай қауіп көбейіп келеді?",
            "answers": [
                "техникалық ақаулар",
                "интернет алаяқтары",
                "ауа райының өзгеруі",
                "жол кептелісі"
            ]
        },
        {
            "question": "Қандай жағдайда адамның ақшасы жоғалуы мүмкін?",
            "answers": [
                "кітап оқыса",
                "күмәнді сілтемеге кірсе",
                "спортпен айналысса",
                "ерте ұйықтаса"
            ]
        },
        {
            "question": "Қаржылық сауаттылық неге әсер етеді?",
            "answers": [
                "өмір сапасына",
                "ауа райына",
                "спорттық жетістікке",
                "жол қозғалысына"
            ]
        },
        {
            "question": "Қаржыны дұрыс басқарған адам қандай болады?",
            "answers": [
                "жалқау",
                "болашағына сенімді",
                "ұқыпсыз",
                "сенімсіз"
            ]
        },
        {
            "question": "Мәтіннің негізгі идеясы қандай?",
            "answers": [
                "Қаржылық сауаттылық өмірде маңызды рөл атқарады.",
                "Ақша тек бай адамдарға керек.",
                "Несие алу әрқашан тиімді.",
                "Онлайн төлем қауіпті емес."
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) табысын дұрыс жоспарламағандықтан
        2.	ә) шығынды бақыламау
        3.	ә) күтпеген шығындарға дайын болу үшін
        4.	ә) тәуекел деңгейін
        5.	ә) онлайн банкинг жүйесі
        6.	ә) интернет алаяқтары
        7.	ә) күмәнді сілтемеге кірсе
        8.	а) өмір сапасына
        9.	ә) болашағына сенімді
        10.	а) Қаржылық сауаттылық өмірде маңызды рөл атқарады.
    `),
    listeningAudioPath: `src/assets/audio/c1/C1-4_Қаржылық-сауаттылық.mp3`,
    listeningTitle: {
        kk: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        ru: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        en: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
    },
    listening: dedent(`
        қаражат
        қиындық
        жинақтау
        қауіп
        тәуелсіздік
    `),
    listeningAnswer: dedent(`
        ақша
        мәселе
        үнемдеу
        тәуекел
        еркіндік
    `),
    speakingTitle: {
        kk: "Жағдаяттық тапсырма",
        ru: "Жағдаяттық тапсырма",
        en: "Жағдаяттық тапсырма"
    },
    speaking: dedent(`
        Сіз жастарға арналған қаржылық сауаттылық семинарына қатысып отырсыз. Көптеген студент ай сайынғы табысын дұрыс жоспарлай алмайтынын айтып, қаржылық қиындықтарға жиі кездесетінін түсіндіреді. Сіздің позицияңыз қандай?
        Талап:
        — аналитикалық пікір айту;
        — кемінде 2 дәлел келтіру;
        — қарсы пікірге жауап беру;
        — қорытынды жасау.
    `),
    speakingAnswer: dedent(`
        Менің ойымша, студенттер үшін қаржылық сауаттылық өте маңызды. Ай сайынғы табысты дұрыс жоспарлау қаржылық қиындықтарды азайтуға көмектеседі.

        Біріншіден, әр студент өз табысы мен шығынын жазып, ай сайынғы бюджет құруы керек. Бұл қажетсіз шығындарды азайтуға мүмкіндік береді. Екіншіден, табыстың бір бөлігін жинақтап, күтпеген жағдайларға ақша қалдыру маңызды.

        Кейбір адамдар студенттердің табысы аз болғандықтан, қаржыны жоспарлаудың қажеті жоқ деп ойлайды. Бірақ табыс аз болса да, оны дұрыс басқару қаржылық жауапкершілікті қалыптастырады.

        Қорытындылай келе, қаржылық сауаттылықты ерте жастан қалыптастыру керек. Ақшаны дұрыс жоспарлау студентке бүгінгі қиындықтарды азайтып, болашаққа сенімді қадам жасауға мүмкіндік береді.
    `)
};
