import { Topic } from "..";
import dedent from 'dedent';

export const C1_5_TOPIC: Topic = {
    title: {
        kk: "ҚАРЫМ-ҚАТЫНАС",
        ru: "ҚАРЫМ-ҚАТЫНАС",
        en: "ҚАРЫМ-ҚАТЫНАС"
    },
    description: {
        kk: "src/assets/document/c1/kk/5-сабақ. С1 Қарым қатынас (өзгертілген).docx",
        ru: "src/assets/document/c1/kk/5-сабақ. С1 Қарым қатынас (өзгертілген).docx",
        en: "src/assets/document/c1/kk/5-сабақ. С1 Қарым қатынас (өзгертілген).docx",
    },
    writingTitle: {
        kk: "Сөйлемдерді аяқтаңыз.",
        ru: "Сөйлемдерді аяқтаңыз.",
        en: "Сөйлемдерді аяқтаңыз."
    },
    writing: dedent(`
        1.	Қазіргі қоғамда коммуникацияның жаңа түрлері қалыптасты және ________________________________________________.
        2.	Адам өз ойын ашық жеткізе алады, бірақ ________________________________________________.
        3.	Тиімді қарым-қатынас өзара сенімді нығайтады әрі ________________________________________________.
        4.	Әлеуметтік желілер адамдардың байланысын жеңілдетті, алайда ________________________________________________.
        5.	Әңгімелесушілер бір-бірінің пікірін мұқият тыңдайды да ________________________________________________.
        6.	Адамның кәсіби білімі жоғары болғанымен, ________________________________________________.
        7.	Ашық диалог мәселені жан-жақты талдауға мүмкіндік береді және ________________________________________________.
    `),
    writingAnswer: dedent(`
        1.	Қазіргі қоғамда коммуникацияның жаңа түрлері қалыптасты және адамдар арасындағы ақпарат алмасу жылдам әрі қолжетімді бола түсті.
        2.	Адам өз ойын ашық жеткізе алады, бірақ өз пікірін білдірумен қатар, әңгімелесушінің ұстанымын да ескеруі қажет.
        3.	Тиімді қарым-қатынас өзара сенімді нығайтады әрі адамдар арасындағы әлеуметтік және кәсіби байланысты тұрақтандырады.
        4.	Әлеуметтік желілер адамдардың байланысын жеңілдетті, алайда виртуалды қарым-қатынас әрдайым шынайы түсіністікке жеткізе бермейді.
        5.	Әңгімелесушілер бір-бірінің пікірін мұқият тыңдайды да пікір қайшылығы туындаған жағдайда ортақ шешім іздейді.
        6.	Адамның кәсіби білімі жоғары болғанымен, оның коммуникациялық дағдылары жеткіліксіз болса, ұжыммен тиімді жұмыс істеуі қиын.
        7.	Ашық диалог мәселені жан-жақты талдауға мүмкіндік береді және тараптардың өзара тиімді шешім қабылдауына жағдай жасайды.
    `),
    reading: dedent(`
        <b>Қарым-қатынастың маңызы</b>

        Қазіргі қоғамда адамдар арасындағы қарым-қатынас ерекше маңызға ие. Адам бір ортада өмір сүреді және күн сайын түрлі адамдармен байланыс жасайды. Сондықтан дұрыс сөйлесу мәдениеті мен өзара сыйластық қоғамдағы тұрақтылыққа әсер етеді.
        Кейбір адамдар өз ойын ашық жеткізеді әрі өзгелердің пікірін құрметтейді. Мұндай адамдар ұжымда тез тіл табысады да айналасындағылардың сеніміне ие болады. Ал кей жағдайда адамдар бір-бірін тыңдамайды және түсінбеушілік пайда болады.
        Қазіргі технологияның дамуы адамдар арасындағы байланысты жеңілдетті. Адамдар әлеуметтік желі арқылы сөйлеседі әрі алыс жерде жүрген адамдармен тез байланыс орната алады. Дегенмен кейбір мамандар тікелей қарым-қатынастың азайып бара жатқанын айтады.
        Психологтардың пікірінше, адам қарым-қатынас кезінде тек сөйлеуді ғана емес, тыңдай білуді де үйренуі керек. Егер адамдар бір-біріне құрметпен қараса, қоғамдағы түсіністік пен сенім күшейеді.
    `),
    readingTest: [
        {
            "question": "Қазіргі қоғамда қандай мәселе маңызды болып отыр?",
            "answers": [
                "спорт",
                "қарым-қатынас мәдениеті",
                "ауа райы",
                "саяхат"
            ]
        },
        {
            "question": "Кейбір адамдар қандай қасиетімен ерекшеленеді?",
            "answers": [
                "өз ойын еркін жеткізеді",
                "үндeмейді",
                "тек жазады",
                "көп ұйықтайды"
            ]
        },
        {
            "question": "Түсінбеушілік неге пайда болады?",
            "answers": [
                "адамдар көп оқығандықтан",
                "адамдар бір-бірін тыңдамағандықтан",
                "технология дамығандықтан",
                "уақыт көп болғандықтан"
            ]
        },
        {
            "question": "Жақсы қарым-қатынас неге әсер етеді?",
            "answers": [
                "тек демалысқа",
                "жеке өмірге және кәсіби ортаға",
                "тек жұмысқа",
                "тек білімге"
            ]
        },
        {
            "question": "Адамдарға сенім не үшін артады?",
            "answers": [
                "олар бай болғандықтан",
                "олар сыпайы сөйлеп, өзгені құрметтегендіктен",
                "олар көп сөйлегендіктен",
                "олар тыныш болғандықтан"
            ]
        },
        {
            "question": "Технология неге көмектесті?",
            "answers": [
                "байланысты жеңілдетуге",
                "кітап оқуға",
                "демалуға",
                "спортқа"
            ]
        },
        {
            "question": "Әлеуметтік желі қандай мәселе туғызуы мүмкін?",
            "answers": [
                "тікелей сөйлесудің азаюы",
                "адамдардың көп оқуына",
                "спортпен айналысуға",
                "кітаптың көбеюіне"
            ]
        },
        {
            "question": "Кейбір жастар қандай қиындық көреді?",
            "answers": [
                "спортта жеңіледі",
                "шынайы қарым-қатынаста ойын жеткізе алмайды",
                "кітап оқымайды",
                "саяхатқа шықпайды"
            ]
        },
        {
            "question": "Психологтар адамдарға қандай кеңес береді?",
            "answers": [
                "көп ұйықтауды",
                "бір-біріне қолдау көрсетуді",
                "тек онлайн сөйлесуді",
                "үндемеуді"
            ]
        },
        {
            "question": "Мәтіннің негізгі идеясы қандай?",
            "answers": [
                "Қарым-қатынас мәдениеті қоғамда маңызды рөл атқарады.",
                "Әлеуметтік желі қажет емес.",
                "Адамдарға сөйлесу керек емес.",
                "Онлайн байланыс қана маңызды."
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) қарым-қатынас мәдениеті
        2.	а) өз ойын еркін жеткізеді
        3.	ә) адамдар бір-бірін тыңдамағандықтан
        4.	ә) жеке өмірге және кәсіби ортаға
        5.	ә) олар сыпайы сөйлеп, өзгені құрметтегендіктен 
        6.	а) байланысты жеңілдетуге 
        7.	а) тікелей сөйлесудің азаюы
        8.	ә) шынайы қарым-қатынаста ойын жеткізе алмайды
        9.	ә) бір-біріне қолдау көрсетуді 
        10.	а) Қарым-қатынас мәдениеті қоғамда маңызды рөл атқарады.
    `),
    listeningAudioPath: `src/assets/audio/c1/C1-5_Қарым-қатынас.mp3`,
    listeningTitle: {
        kk: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        ru: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        en: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
    },
    listening: dedent(`
        байланыс
        түсіністік
        құрмет
        көмек
        сенім
    `),
    listeningAnswer: dedent(`
        қарым-қатынас
        сыйластық
        сыйластық
        қолдау
        иланым
    `),
    speakingTitle: {
        kk: "Жағдаяттық тапсырма",
        ru: "Жағдаяттық тапсырма",
        en: "Жағдаяттық тапсырма"
    },
    speaking: dedent(`
        Сіз жастарға арналған психологиялық тренингке қатысып отырсыз. Кейбір жастар адамдармен еркін сөйлесе алмайтынын және жаңа ортада тез тіл табыса алмайтынын айтады. Сіз қалай әрекет етесіз?
        Талап:
        — аналитикалық пікір айту;
        — кемінде 2 дәлел келтіру;
        — қарсы пікірге жауап беру;
        — қорытынды жасау.
    `),
    speakingAnswer: dedent(`
        Менің ойымша, адамдармен еркін сөйлесу және жаңа ортаға бейімделу үшін өзіне сенімді болу маңызды. Біріншіден, жаңа адамдармен жиі сөйлесіп, қарапайым сұрақтардан бастау керек. Екіншіден, ортақ қызығушылық арқылы жаңа достар тауып, қарым-қатынас тәжірибесін арттыруға болады.

        Кейбір адамдар тұйық мінезді адамның өзгеруі қиын деп ойлайды. Бірақ қарым-қатынас дағдысын біртіндеп дамытуға болады. Ең бастысы – өзіңді өзгелермен салыстырмай, кіші қадамдардан бастау.

        Қорытындылай келе, жаңа ортада еркін болу үшін тәжірибе, сенімділік және ашықтық қажет. Өз-өзіне сенген адам адамдармен оңай тіл табыса алады.
    `)
};
