import { Topic } from "..";
import dedent from 'dedent';

export const C1_9_TOPIC: Topic = {
    title: {
        kk: "КӘСІП ЖӘНЕ КӘСІБИ ҚАЛЫПТАСУ",
        ru: "КӘСІП ЖӘНЕ КӘСІБИ ҚАЛЫПТАСУ",
        en: "КӘСІП ЖӘНЕ КӘСІБИ ҚАЛЫПТАСУ"
    },
    description: {
        kk: dedent(`
                    ТҰРАҚТЫ ТІРКЕСТЕР 
                    Тұрақты тіркес	Мағынасы
                    қолынан іс келу	шебер болу
                    еңбегі жана беру	табысты болу
                    тілін табу	дұрыс қарым-қатынас орнату
                    жолын табу	өмірде өз орнын табу
                    қанаттыға қақтырмау	қорғау, қамқор болу
                    тасы өрге домалау	ісі алға басу, жолы болу
                    бел шешпей еңбек ету	тынымсыз, үздіксіз еңбек ету
                    ат ізін салмау	ұзақ уақыт бармау, қатынаспау

                    ДӘЙЕК СӨЗДЕР
                    «Еңбек етсең ерінбей, тояды қарның тіленбей».
                    —Абай Құнанбайұлы
                    «Өзіңе сен, өзің алып шығар, еңбегің мен ақылың екі жақтап».
                    —Ахмет Байтұрсынұлы 
                    «Білімді болуға – оқу керек, бай болуға – кәсіп керек, күшті болуға – бірлік керек». 
                    —Ахмет Байтұрсынұлы
                    «Қарап отырма, бір нәрсеге жарап отыр; кәсіп болмай, нәсіп болмас».
                    — Төле би Әлібекұлы
                    «Адамның жақсы өмір сүруіне үш сапа негіз болады: адал еңбек, ақ жүрек, арлы ақыл».
                    — Шәкәрім Құдайбердіұлы
                    «Еңбек – қуаныш, жалқаулық – айырылмас азап».
                    — Абай Құнанбайұлы


                    ГРАММАТИКА
                    МАҚСАТ БАҒЫНЫҢҚЫЛЫ САБАҚТАС ҚҰРМАЛАС СӨЙЛЕМ

                    Мақсат бағыныңқылы сабақтас құрмалас сөйлем – бағыныңқы сөйлем басыңқы сөйлемдегі іс-әрекеттің қандай мақсатпен орындалғанын білдіретін сабақтас құрмаластың түрі.
                    Бағыныңқы сөйлем басыңқы сөйлемдегі әрекеттің мақсатын білдіреді.
                    Сұрақтары: Не үшін? Қандай мақсатпен? Не мақсатпен?
                `),
        ru: dedent(`
                    ТҰРАҚТЫ ТІРКЕСТЕР 
                    Тұрақты тіркес	Мағынасы
                    қолынан іс келу	шебер болу
                    еңбегі жана беру	табысты болу
                    тілін табу	дұрыс қарым-қатынас орнату
                    жолын табу	өмірде өз орнын табу
                    қанаттыға қақтырмау	қорғау, қамқор болу
                    тасы өрге домалау	ісі алға басу, жолы болу
                    бел шешпей еңбек ету	тынымсыз, үздіксіз еңбек ету
                    ат ізін салмау	ұзақ уақыт бармау, қатынаспау

                    ДӘЙЕК СӨЗДЕР
                    «Еңбек етсең ерінбей, тояды қарның тіленбей».
                    —Абай Құнанбайұлы
                    «Өзіңе сен, өзің алып шығар, еңбегің мен ақылың екі жақтап».
                    —Ахмет Байтұрсынұлы 
                    «Білімді болуға – оқу керек, бай болуға – кәсіп керек, күшті болуға – бірлік керек». 
                    —Ахмет Байтұрсынұлы
                    «Қарап отырма, бір нәрсеге жарап отыр; кәсіп болмай, нәсіп болмас».
                    — Төле би Әлібекұлы
                    «Адамның жақсы өмір сүруіне үш сапа негіз болады: адал еңбек, ақ жүрек, арлы ақыл».
                    — Шәкәрім Құдайбердіұлы
                    «Еңбек – қуаныш, жалқаулық – айырылмас азап».
                    — Абай Құнанбайұлы


                    ГРАММАТИКА
                    МАҚСАТ БАҒЫНЫҢҚЫЛЫ САБАҚТАС ҚҰРМАЛАС СӨЙЛЕМ

                    Мақсат бағыныңқылы сабақтас құрмалас сөйлем – бағыныңқы сөйлем басыңқы сөйлемдегі іс-әрекеттің қандай мақсатпен орындалғанын білдіретін сабақтас құрмаластың түрі.
                    Бағыныңқы сөйлем басыңқы сөйлемдегі әрекеттің мақсатын білдіреді.
                    Сұрақтары: Не үшін? Қандай мақсатпен? Не мақсатпен?
                `),
        en: dedent(`
                    ТҰРАҚТЫ ТІРКЕСТЕР 
                    Тұрақты тіркес	Мағынасы
                    қолынан іс келу	шебер болу
                    еңбегі жана беру	табысты болу
                    тілін табу	дұрыс қарым-қатынас орнату
                    жолын табу	өмірде өз орнын табу
                    қанаттыға қақтырмау	қорғау, қамқор болу
                    тасы өрге домалау	ісі алға басу, жолы болу
                    бел шешпей еңбек ету	тынымсыз, үздіксіз еңбек ету
                    ат ізін салмау	ұзақ уақыт бармау, қатынаспау

                    ДӘЙЕК СӨЗДЕР
                    «Еңбек етсең ерінбей, тояды қарның тіленбей».
                    —Абай Құнанбайұлы
                    «Өзіңе сен, өзің алып шығар, еңбегің мен ақылың екі жақтап».
                    —Ахмет Байтұрсынұлы 
                    «Білімді болуға – оқу керек, бай болуға – кәсіп керек, күшті болуға – бірлік керек». 
                    —Ахмет Байтұрсынұлы
                    «Қарап отырма, бір нәрсеге жарап отыр; кәсіп болмай, нәсіп болмас».
                    — Төле би Әлібекұлы
                    «Адамның жақсы өмір сүруіне үш сапа негіз болады: адал еңбек, ақ жүрек, арлы ақыл».
                    — Шәкәрім Құдайбердіұлы
                    «Еңбек – қуаныш, жалқаулық – айырылмас азап».
                    — Абай Құнанбайұлы


                    ГРАММАТИКА
                    МАҚСАТ БАҒЫНЫҢҚЫЛЫ САБАҚТАС ҚҰРМАЛАС СӨЙЛЕМ

                    Мақсат бағыныңқылы сабақтас құрмалас сөйлем – бағыныңқы сөйлем басыңқы сөйлемдегі іс-әрекеттің қандай мақсатпен орындалғанын білдіретін сабақтас құрмаластың түрі.
                    Бағыныңқы сөйлем басыңқы сөйлемдегі әрекеттің мақсатын білдіреді.
                    Сұрақтары: Не үшін? Қандай мақсатпен? Не мақсатпен?
                `),
    },
    writingTitle: {
        kk: "Сөйлемдерді аяқтаңыз.",
        ru: "Сөйлемдерді аяқтаңыз.",
        en: "Сөйлемдерді аяқтаңыз."
    },
    writing: dedent(`
                1.	Жас маман еңбек жолын бастағанда, ______________________________.
                2.	Қызметкер жаңа қызметке тағайындалған кезде, ______________________________.
                3.	Маман кәсіби тәжірибе жинақтаған сайын, ______________________________.
                4.	Кәсіпкер жаңа жобаны іске қосқаннан кейін, ______________________________.
                5.	Жас маман еңбек нарығындағы бәсекеге қабілеттілігін арттыру үшін, __________________________.
                6.	Кәсіпкер тұтынушылардың сұранысын анықтау мақсатында, __________________________.
                7.	Компания білікті кадрларды жұмысқа тарту үшін, __________________________.
            `),
    reading: dedent(`
                <b>Кәсіп – тұлғаның қоғамдағы орны</b>

                Қазақ халқы ежелден еңбек пен кәсіпті ерекше қадірлеген. Халық даналығында «Кәсіп, кәсіп түбі – нәсіп» деген мақалдың сақталуы да еңбекқорлықтың қоғамдағы маңызын көрсетеді. Белгілі бір кәсіпті меңгерген адам өз қабілетін дамытып қана қоймай, қоғамдағы орнын айқындайды. Сондықтан кәсіп адамның әлеуметтік жауапкершілігін, өмірлік ұстанымын және азаматтық ұстанымын қалыптастыратын маңызды құндылықтардың бірі болып саналады.
                Ұлы ойшыл Абай Құнанбайұлы жастарды ғылым мен білімге, адал еңбекке және үздіксіз ізденіске шақырды. Оның қарасөздері мен өлеңдерінде адам өз еңбегі арқылы ғана биік жетістікке жете алатыны ерекше айтылады. Абайдың пікірінше, еңбек – адамның рухани және материалдық дамуының негізгі кепілі.
                Қазақ әдебиетінің көрнекті өкілі Мұхтар Әуезов өз шығармаларында қазақ халқының тұрмыс-тіршілігін, еңбек адамдарын және ұлттық құндылықтарды кеңінен суреттеді. Мұхтар Әуезов халық өмірін көркем әрі шынайы бейнелегендіктен, қазақ әдебиеті әлемдік деңгейде танылды. Оның шығармалары ұлттық мәдениеттің ғана емес, жалпы адамзаттық құндылықтардың көрінісі ретінде жоғары бағаланады.
                Қазіргі таңда жастардың кәсіби мүмкіндігі бұрынғыдан әлдеқайда кеңейді, өйткені мамандық түрлері көбейіп, цифрлық технологиялардың дамуы жаңа кәсіптердің пайда болуына ықпал етті. Бұл жағдай жастардың қызығушылығы мен қабілетіне сәйкес мамандық таңдауына мүмкіндік береді.
                Егер қоғамда білімді әрі білікті мамандар көбейсе, ел экономикасының дамуы жеделдеп, инновациялық жобалардың саны артады. Сондықтан кәсіп таңдау – тек жеке адамның емес, тұтас қоғамның болашағына әсер ететін маңызды өмірлік шешім.
            `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі мақсаты қандай?",
            "answers": [
                "Қазақ әдебиетінің тарихын баяндау",
                "Қазақ жазушыларының тұлға қалыптастырудағы рөлін көрсету",
                "Қазақстандағы мектептердің тарихын таныстыру",
                "Жастардың мамандық таңдауын талдау"
            ]
        },
        {
            "question": "Қазақ әдебиетінің көрнекті өкілдері қандай құндылықтарды дәріптеді?",
            "answers": [
                "Тек ұлттық салт-дәстүрді",
                "Білімді, тәрбиені және ұлттық сананы",
                "Тек ғылымды",
                "Саяси көзқарасты"
            ]
        },
        {
            "question": "Ыбырай Алтынсариннің ағартушылық қызметінің басты нәтижесі қандай болды?",
            "answers": [
                "Қазақ тілінде газет шығарды.",
                "Алғашқы зайырлы мектептердің ашылуына негіз қалады.",
                "Университет ашты.",
                "Шетелде білім алды."
            ]
        },
        {
            "question": "Абай Құнанбайұлы адамның қоғамдағы орнын немен байланыстырады?",
            "answers": [
                "Байлығымен",
                "Шыққан тегімен",
                "Білімімен, еңбегімен және адамгершілік қасиеттерімен",
                "Жас ерекшелігімен"
            ]
        },
        {
            "question": "Мұхтар Әуезов шығармаларында негізінен не бейнеленеді?",
            "answers": [
                "Қалалық өмір",
                "Ұлттық болмыс, халықтың тұрмыс-тіршілігі және еңбек адамы",
                "Ғылыми жаңалықтар",
                "Тек тарихи оқиғалар"
            ]
        },
        {
            "question": "Автордың пікірінше, қазіргі кезде жастардың мамандық таңдауына не әсер етеді?",
            "answers": [
                "Тек отбасының таңдауы",
                "Жаһандану жағдайындағы кәсіби талаптардың өзгеруі",
                "Мемлекеттік саясат",
                "Тек жоғары білім"
            ]
        },
        {
            "question": "Егер адам кәсіби білімін үздіксіз жетілдірсе, қандай нәтижеге қол жеткізеді?",
            "answers": [
                "Тек жеке табысқа жетеді.",
                "Жеке жетістікке жетіп, қоғамның дамуына үлес қосады.",
                "Жұмысын жиі ауыстырады.",
                "Басқа мамандыққа ауысады."
            ]
        },
        {
            "question": "Мәтінде «рухани құрал» деп не айтылған?",
            "answers": [
                "Ғылыми зерттеулер",
                "Қазақ жазушыларының шығармалары",
                "Тарихи құжаттар",
                "Оқу бағдарламалары"
            ]
        },
        {
            "question": "Мәтіндегі негізгі себеп-салдарлық байланысты көрсететін сөйлем қайсы?",
            "answers": [
                "Қазақ әдебиетінің көрнекті өкілдері халықтың дүниетанымын қалыптастырды.",
                "Ыбырай Алтынсарин ағартушылық қызметті жүйелі түрде жүргізгендіктен, алғашқы зайырлы мектептердің ашылуына негіз қалады.",
                "Абай ғылымның маңызын атап өтті.",
                "Мұхтар Әуезов ұлттық мәдениетті суреттеді."
            ]
        },
        {
            "question": "Мәтіннің қорытынды идеясы қандай?",
            "answers": [
                "Әдеби шығармаларды оқу жеткілікті.",
                "Жоғары білім ғана табысқа жеткізеді.",
                "Жастар тек өз қабілетіне сенуі керек.",
                "Қоғамның дамуына үлес қосу үшін адам өз қабілетіне сай мамандық таңдап, кәсіби білімін үздіксіз жетілдіруі қажет."
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/c1/C1-9_Кәсіп-және-кәсіби-қалыптасу.mp3`,
    listeningTitle: {
        kk: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        ru: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
        en: "Мәтіннен сөздердің синонимін тауып жазыңыз.",
    },
    listening: dedent(`
                еңбек
                кәсіп
                танымал
                құндылық
                білімді
            `),
    speakingTitle: {
        kk: "Жағдаяттық тапсырма",
        ru: "Жағдаяттық тапсырма",
        en: "Жағдаяттық тапсырма"
    },
    speaking: dedent(`
                Сіз мектепте немесе колледжде ұйымдастырылған «Мамандық таңдау – болашаққа қадам» атты кездесуге қатысып отырсыз. Көптеген жастар болашақ мамандығын таңдауда қиналатынын, кейде ата-анасының немесе достарының пікіріне сүйенетінін айтты.
                Сіздің позицияңыз қандай?
                Талап:
                — аналитикалық пікір айту;
                — кемінде 2 дәлел келтіру;
                — қарсы пікірге жауап беру;
                — қорытынды жасау.
            `)
};
