import { Topic } from "..";
import dedent from 'dedent';

export const A2_1_TOPIC: Topic = {
    title: {
        kk: "САЯХАТ",
        ru: "ПУТЕШЕСТВИЕ",
        en: "TRAVEL"
    },
    description: {
        kk: "src/assets/document/a1/ru/1-сабақ А2. Саяхат (каз-рус).docx",
        ru: "src/assets/document/a1/ru/1-сабақ А2. Саяхат (каз-рус).docx",
        en: "src/assets/document/a1/en/1-сабақ А2. Саяхат (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Жазғы демалыста мен отбасыммен Бурабайға ________ (саяхат) бардым.
        2.	Біз таңертең ерте ________ (жол) шықтық.
        3.	Бурабайға келген соң, ________ (қонақүй) орналастық.
        4.	Келесі күні ________ (көл) жағасында серуендедік.
        5.	Кейін ________ (мұражай) барып, қаланың тарихымен таныстық.
        6.	Кешке ұлттық тағамдардан ________ (дәм тату).
        7.	Бұл саяхат менің ________ (ес) жақсы сақталды.
    `),
    writingAnswer: dedent(`
        1.	Жазғы демалыста мен отбасыммен Бурабайға саяхатқа бардым.
        2.	Біз таңертең ерте жолға шықтық.
        3.	Бурабайға келген соң, қонақүйге орналастық.
        4.	Келесі күні көлдің жағасында серуендедік.
        5.	Кейін мұражайға барып, қаланың тарихымен таныстық.
        6.	Кешке ұлттық тағамдардан дәм таттық.
        7.	Бұл саяхат менің есімде жақсы сақталды.
    `),
    reading: dedent(`
        <b>Ұмытылмас саяхат</b>

        Көп адам саяхатқа демалу үшін барады. Бірақ кейде саяхат адамға жаңа ой береді немесе өмірге деген көзқарасын өзгертеді. Өткен жазда Айбек достарымен бірге Шарын шатқалына барды. Олар бұл жер туралы көп естіген, бірақ өз көздерімен көрмеген еді.Сапар таңертең ерте басталды. Жол ұзақ болғанымен, достар жол бойы ән айтып, табиғат туралы әңгімелесті. Шарын шатқалына жеткенде, олар биік жартастар мен әдемі көріністерге таңғалды. Айбек көптеген суретке түсіп, ерекше сәттерді есте сақтағысы келді.Түстен кейін олар демалып отырған кезде, Айбек жерге тасталған пластик бөтелкелер мен қағаздарды байқады. Бұл көрініс оған ұнамады. Достарының кейбірі: «Бұл біздің қоқыс емес, жинаудың қажеті жоқ», – деді. Бірақ Айбек табиғатты таза ұстау әр адамның міндеті екенін айтты. Ол қоқыстарды жинай бастады. Біраз уақыттан кейін достары да оған көмектесті.
        Үйге қайтқан соң, Айбек әлеуметтік желіде табиғатты қорғау туралы жазба жариялады. Оның жазбасын көп адам оқып, пікір қалдырды. Кейбір адамдар демалыс кезінде табиғатты таза ұстауға уәде берді.
        Осы сапардан кейін Айбек бір нәрсені түсінді: саяхат тек жаңа жерлерді көру емес, сонымен бірге өзіңнің іс-әрекетің арқылы қоршаған ортаға пайда әкелу екенін білді.
    `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі идеясы қандай?",
            "answers": [
                "Саяхат кезінде көп суретке түсу маңызды.",
                "Саяхат адамға жаңа әсер беріп, табиғатты қорғаудың маңызын түсіндіреді.",
                "Шарын шатқалы – Қазақстандағы ең үлкен туристік орын.",
                "Саяхатқа тек достармен барған дұрыс."
            ]
        },
        {
            "question": "Неліктен Айбек қоқысты жинай бастады?",
            "answers": [
                "Достары одан өтінді.",
                "Басқа туристер оған көмектескендіктен.",
                "Жолсерік тапсырма берді.",
                "Ол табиғатты таза ұстау әр адамның міндеті деп санады."
            ]
        },
        {
            "question": "«Бұл біздің қоқыс емес, жинаудың қажеті жоқ» деген сөйлем достарының қандай көзқарасын білдіреді?",
            "answers": [
                "Олар табиғатты қорғауға жауапкершілікпен қарады.",
                "Олар табиғатқа зиян келтіргісі келді.",
                "Олар қоқысты басқа адамдар жинауы керек деп ойлады.",
                "Олар саяхатты жалғастырғысы келді."
            ]
        },
        {
            "question": "Айбектің достары неге кейін оған көмектесті деп ойлайсыз?",
            "answers": [
                "Олар Айбектің әрекетінің дұрыс екенін түсінді.",
                "Олар шаршады.",
                "Олар үйге ертерек қайтқысы келді.",
                "Олар суретке түскісі келді."
            ]
        },
        {
            "question": "Мәтінге сәйкес келмейтін ақпаратты табыңыз.",
            "answers": [
                "Айбек табиғатты қорғауды маңызды деп санады.",
                "Достары кейін оған көмектесті.",
                "Айбек қоқысты көрмей кетті.",
                "Сапар Айбекке үлкен әсер қалдырды."
            ]
        },
        {
            "question": "Үстеу дегеніміз не?",
            "answers": [
                "Заттың атын білдіретін сөз табы.",
                "Қимылдың, іс-әрекеттің белгісін білдіретін сөз табы.",
                "Заттың санын білдіретін сөз табы.",
                "Заттың сынын білдіретін сөз табы."
            ]
        },
        {
            "question": "Мезгіл үстеуін табыңыз.",
            "answers": [
                "жоғары",
                "бүгін",
                "алға",
                "ішке"
            ]
        }
    ],
    readingAnswer: dedent(`
        1. Ә) Саяхат адамға жаңа әсер беріп, табиғатты қорғаудың маңызын түсіндіреді.
        2. В) Ол табиғатты таза ұстау әр адамның міндеті деп санады.
        3. Б) Олар қоқысты басқа адамдар жинауы керек деп ойлады.
        4. А) Олар Айбектің әрекетінің дұрыс екенін түсінді.
        5. Б) Айбек қоқысты көрмей кетті.
        6. Ә) Қимылдың, іс-әрекеттің белгісін білдіретін сөз табы.
        7. Ә) бүгін
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-1_Саяхат.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Париж – __________________ астанасы.
        2.	Қаланың ең танымал көрікті орны – __________________.
        3.	Көптеген адамдар __________________ барып, өнер туындыларын көреді.
        4.	Париж арқылы __________________ ағып өтеді.
        5.	Қалада __________________ жақсы дамыған.
        6.	__________________ қаланың көрікті жерлерін аралайды.
        7.	Парижге __________________ барған өте қолайлы.
    `),
    listeningAnswer: dedent(`
        1.	Париж – Францияның астанасы.
        2.	Қаланың ең танымал көрікті орны – Эйфель мұнарасы.
        3.	Көптеген адамдар Лувр мұражайына барып, өнер туындыларын көреді.
        4.	Париж арқылы Сена өзені ағып өтеді.
        5.	Қалада метро жақсы дамыған.
        6.	Туристер қаланың көрікті жерлерін аралайды.
        7.	Парижге көктемде барған өте қолайлы.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Үстеу қандай сұрақтарға жауап береді?
        2.	Мезгіл үстеуі қандай сұрақтарға жауап береді?
        3.	Мекен үстеуі қандай сұрақтарға жауап береді?
        4.	Үстеу мағынасына қарай неше топқа бөлінеді?
        5.	Айбек өткен жазда қайда барды?
        6.	Ол кімдермен бірге саяхатқа шықты?
        7.	Париж қай елдің астанасы?
        8.	Париж несімен әйгілі?
        9.	Жыл сайын Парижге кімдер келеді?
        10.	Қаланың ең танымал көрікті орны қалай аталады?
    `),
    speakingAnswer: dedent(`
        1. Үстеу қалай, қашан, қайда деген сұрақтарға жауап береді.
        2. Мезгіл үстеуі қашан деген сұраққа жауап береді.
        3. Мекен үстеуі қайда деген сұраққа жауап береді.
        4. Үстеу мағынасына қарай жеті топқа бөлінеді.
        5. Айбек өткен жазда Парижге барды.
        6. Ол достарымен бірге саяхатқа шықты.
        7. Париж Францияның астанасы.
        8. Париж Эйфель мұнарасымен әйгілі.
        9. Жыл сайын Парижге көптеген туристер келеді.
        10. Қаланың ең танымал көрікті орны Эйфель мұнарасы деп аталады.
    `)
};
