import { Topic } from "..";
import dedent from 'dedent';

export const A2_1_TOPIC: Topic = {
    title: {
        kk: "САЯХАТ",
        ru: "ПУТЕШЕСТВИЕ",
        en: "TRAVEL"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    сапар
                    қонақүй
                    төлқұжат
                    ұшақ
                    әуежай
                    жолсерік
                    ұшу
                    міну
                    түсу
                    көрікті жер
                    мұражай
                    ұлтық тағамдар
                    биік жартастар
                    мұнара
                    тарихи ғимарат
                    аралау
                    сұрау

                    ГРАММАТИКА
                    ҮСТЕУ

                    Үстеу – қимылдың немесе іс-әрекеттің қалай, қашан, қайда, қаншалықты болғанын білдіретін сөз табы. Үстеу көбіне етістікпен бірге қолданылады және қимылдың белгісін көрсетеді.
                    Сұрақтары:
                    •	Қалай? – жақсы, тез, баяу
                    •	Қашан? – бүгін, ертең, қазір
                    •	Қайда? – жоғары, төмен, алға
                    •	Қаншалықты? – өте, тым, аздап
                    Үстеу сөздер мағынасына қарай таптастырғанда мынадай 8 топқа бөлінеді.
                    •	Мезгіл үстеулер
                    •	Мекен үстеулер
                    •	Мөлшер үстеулері
                    •	Сын (я бейне) үстеулері
                    •	Күшейту (я ұлғайту) үстеулері
                    •	Мақсат үстеулері
                    •	Себеп-салдар үстеулері
                    •	Топтау (я бөлу) үстеулері
                    Мезгіл үстеуі – қимылдың немесе іс-әрекеттің қашан?, қашаннан бері? деген сұрақтарына жауап береді. Ол істің уақытын білдіреді.
                    Сұрақтары: Қашан? Қашаннан бері?
                    Мысалдар: Мен бүгін жұмысқа бардым. Біз ертең саяхатқа шығамыз. Ол қазір кітап оқып отыр. Мен кеше кештен бері сені күтіп жүрмін. Олар таңертең келді.
                    Жиі қолданылатын мезгіл үстеулері: Бүгін, кеше, ертең, қазір, таңертең, кешке, түнде, жуырда, бұрын, кейін, әрқашан, кейде, жиі.
                    Мекен үстеуі – қимылдың немесе іс-әрекеттің қайда?, қайдан?, қай жаққа? деген сұрақтарына жауап береді. Ол қимылдың болған орнын немесе бағытын білдіреді.
                    Сұрақтары: Қайда? Қайдан? Қай жаққа?
                    Мысалдар: Ол мектепке қарай жүрді. Балалар алға жүгірді. Құс жоғары ұшты.
                    Біз үйден шықтық. Олар ішке кірді.
                    Жиі қолданылатын мекен үстеулері: Алға, артқа, жоғары, төмен, әрі, бері, ішке, сыртқа, алыс, жақын, әрі қарай, бері қарай.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    сапар	поездка
                    қонақүй	гостиница
                    төлқұжат	паспорт
                    ұшақ	самолет
                    әуежай	аэропорт
                    жолсерік	гид / экскурсовод
                    ұшу	летать
                    міну	садиться / сесть
                    түсу	выходить / сойти
                    көрікті жер	достопримечательность
                    мұражай	музей
                    ұлтық тағамдар	национальные блюда
                    биік жартастар	высокие скалы
                    мұнара	башня
                    тарихи ғимарат	историческое здание
                    аралау	посещать / осматривать
                    сұрау	спрашивать

                    ГРАММАТИКА. 
                    НАРЕЧИЕ. НАРЕЧИЯ ВРЕМЕНИ И МЕСТА.

                    Наречие — это часть речи, которая обозначает, как, когда, где и насколько совершается действие. Наречие чаще всего употребляется с глаголом и характеризует действие.
                    Вопросы:
                    •	Как? — хорошо, быстро, медленно.
                    •	Когда? — сегодня, завтра, сейчас.
                    •	Где? — наверху, внизу, впереди.
                    •	Насколько? — очень, слишком, немного.
                    По значению наречия делятся на 8 групп:
                    •	Наречия времени.
                    •	Наречия места.
                    •	Наречия меры и степени.
                    •	Наречия образа действия.
                    •	Усилительные наречия.
                    •	Наречия цели.
                    •	Наречия причины и следствия.
                    •	Распределительные наречия.
                    •	Наречия времени
                    Наречия времени отвечают на вопросы когда?, с каких пор? и обозначают время совершения действия.
                    Вопросы: Когда? С каких пор?
                    Примеры:Я сегодня пошёл на работу. Мы завтра отправимся в путешествие.
                    Он сейчас читает книгу. Я жду тебя со вчерашнего вечера.
                    Они пришли утром. 
                    Часто употребляемые наречия времени: сегодня, вчера, завтра, сейчас, утром, вечером, ночью, недавно, раньше, позже, всегда, иногда, часто.
                    Наречия места отвечают на вопросы где?, откуда?, куда? и обозначают место или направление действия.
                    Вопросы: Где? Откуда? Куда?
                    Примеры:Он пошёл вперёд к школе. Дети побежали вперёд. Птица полетела вверх.
                    Мы вышли из дома. Они вошли внутрь.
                    Часто употребляемые наречия места:
                    вперёд, назад, вверх, вниз, вдаль, сюда, внутрь, наружу, далеко, близко, дальше, ближе.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақша	english
                    сапар	trip
                    қонақүй	hotel
                    төлқұжат	passport
                    ұшақ	airplane (plane)
                    әуежай	airport
                    жолсерік	guide
                    ұшу	to fly
                    міну	to get on / to board
                    түсу	to get off
                    көрікті жер	tourist attraction / place of interest
                    мұражай	museum
                    ұлтық тағамдар	national dishes / traditional food
                    биік жартастар	high cliffs / tall rocks
                    мұнара	tower
                    тарихи ғимарат	historic building
                    аралау	explore / visit
                    сұрау	ask

                    Adverbs. An adverb is a part of speech that tells us how, when, where, or to what degree an action happens. Adverbs usually describe verbs and give more information about an action.
                    Questions:
                    •	How? – well, quickly, slowly.
                    •	When? – today, tomorrow, now.
                    •	Where? – up, down, forward.
                    •	To what degree? – very, too, a little.
                    According to their meaning, adverbs are divided into 8 groups:
                    •	Adverbs of Time
                    •	Adverbs of Place
                    •	Adverbs of Degree
                    •	Adverbs of Manner
                    •	Intensifying Adverbs
                    •	Adverbs of Purpose
                    •	Adverbs of Cause and Result
                    •	Distributive Adverbs
                    Adverbs of Time. Adverbs of Time answer the questions When? and Since when? They tell us when an action happens.
                    Questions: When? Since when?
                    Examples: I went to work today. We will travel tomorrow. He is reading a book now.
                    I have been waiting for you since yesterday evening. They arrived in the morning.
                    Common adverbs of time: today, yesterday, tomorrow, now, in the morning, in the evening, at night, recently, before, later, always, sometimes, often.
                    Adverbs of Place. Adverbs of Place answer the questions Where?, From where?, and To where? They tell us the place or direction of an action.
                    Questions: Where? From where? To where?
                    Examples: He walked towards the school. The children ran forward. The bird flew up.
                    We came out of the house. They went inside.
                    Common adverbs of place: forward, back, up, down, here, there, inside, outside, far, near, further, closer.
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                Жазғы демалыста мен отбасыммен Бурабайға саяхатқа барды. Біз таңертең ерте жолға шығып, пойызпен бардық. Жол ұзақ болғанымен, өте қызықты өті. Терезеден әдемі табиғатты тамашалап, жол бойында көп әңгімелестік.
                Бурабайға келген сон, қонақүйден орналастық. Келесі күні көл жағасында серуендеп, қайықпен қыдырдық. Кейін мұражайға барып, қаланың тарихымен таныстык. Кешке жергілікті дәмханада ұлтық тағамдардан дәм татты.
                Бұл саяхат менін есімде жақсы сақталды. Мен табиғаттың сұлулығына таңғалдым және көп қызықды ақпарат білді. Болашақта Қазақстанның басқада көрікті жерлеріне барып, жаңа қалаларды аралағым келед.
            `),
    reading: dedent(`
                <b>Ұмытылмас саяхат</b>

                Көп адам саяхатқа демалу үшін барады. Бірақ кейде саяхат адамға жаңа ой береді немесе өмірге деген көзқарасын өзгертеді. Өткен жазда Айбек достарымен бірге Шарын шатқалына барды. Олар бұл жер туралы көп естіген, бірақ өз көздерімен көрмеген еді.Сапар таңертең ерте басталды. Жол ұзақ болғанымен, достар жол бойы ән айтып, табиғат туралы әңгімелесті. Шарын шатқалына жеткенде, олар биік жартастар мен әдемі көріністерге таңғалды. Айбек көптеген суретке түсіп, ерекше сәттерді есте сақтағысы келді.Түстен кейін олар демалып отырған кезде, Айбек жерге тасталған пластик бөтелкелер мен қағаздарды байқады. Бұл көрініс оған ұнамады. Достарының кейбірі: «Бұл біздің қоқыс емес, жинаудың қажеті жоқ», – деді. Бірақ Айбек табиғатты таза ұстау әр адамның міндеті екенін айтты. Ол қоқыстарды жинай бастады. Біраз уақыттан кейін достары да оған көмектесті.
                Үйге қайтқан соң, Айбек әлеуметтік желіде табиғатты қорғау туралы жазба жариялады. Оның жазбасын көп адам оқып, пікір қалдырды. Кейбір адамдар демалыс кезінде табиғатты таза ұстауға уәде берді.
                Осы сапардан кейін Айбек бір нәрсені түсінді: саяхат тек жаңа жерлерді көру емес, сонымен бірге өзіңнің іс-әрекетің арқылы қоршаған ортаға пайда әкелу екенін білді.
            `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі идеясы қандай?",
            "answers": [
                "Саяхат кезінде көп суретке түсу маңызды.",
                "Саяхат адамға жаңа әсер беріп, табиғатты қорғаудың маңызын түсіндіреді.",
                "Шарын шатқалы – Қазақстандағы ең үлкен туристік орын.",
                "Саяхатқа тек достармен барған дұрыс."
            ]
        },
        {
            "question": "Неліктен Айбек қоқысты жинай бастады?",
            "answers": [
                "Достары одан өтінді.",
                "Басқа туристер оған көмектескендіктен.",
                "Жолсерік тапсырма берді.",
                "Ол табиғатты таза ұстау әр адамның міндеті деп санады."
            ]
        },
        {
            "question": "«Бұл біздің қоқыс емес, жинаудың қажеті жоқ» деген сөйлем достарының қандай көзқарасын білдіреді?",
            "answers": [
                "Олар табиғатты қорғауға жауапкершілікпен қарады.",
                "Олар табиғатқа зиян келтіргісі келді.",
                "Олар қоқысты басқа адамдар жинауы керек деп ойлады.",
                "Олар саяхатты жалғастырғысы келді."
            ]
        },
        {
            "question": "Айбектің достары неге кейін оған көмектесті деп ойлайсыз?",
            "answers": [
                "Олар Айбектің әрекетінің дұрыс екенін түсінді.",
                "Олар шаршады.",
                "Олар үйге ертерек қайтқысы келді.",
                "Олар суретке түскісі келді."
            ]
        },
        {
            "question": "Мәтінге сәйкес келмейтін ақпаратты табыңыз.",
            "answers": [
                "Айбек табиғатты қорғауды маңызды деп санады.",
                "Достары кейін оған көмектесті.",
                "Айбек қоқысты көрмей кетті.",
                "Сапар Айбекке үлкен әсер қалдырды."
            ]
        },
        {
            "question": "Үстеу дегеніміз не?",
            "answers": [
                "Заттың атын білдіретін сөз табы.",
                "Қимылдың, іс-әрекеттің белгісін білдіретін сөз табы.",
                "Заттың санын білдіретін сөз табы.",
                "Заттың сынын білдіретін сөз табы."
            ]
        },
        {
            "question": "Мезгіл үстеуін табыңыз.",
            "answers": [
                "жоғары",
                "бүгін",
                "алға",
                "ішке"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-1_Саяхат.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                1.	Париж – __________________ астанасы.
                2.	Қаланың ең танымал көрікті орны – __________________.
                3.	Көптеген адамдар __________________ барып, өнер туындыларын көреді.
                4.	Париж арқылы __________________ ағып өтеді.
                5.	Қалада __________________ жақсы дамыған.
                6.	__________________ қаланың көрікті жерлерін аралайды.
                7.	Парижге __________________ барған өте қолайлы.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Үстеу қандай сұрақтарға жауап береді?
                2.	Мезгіл үстеуі қандай сұрақтарға жауап береді?
                3.	Мекен үстеуі қандай сұрақтарға жауап береді?
                4.	Үстеу мағынасына қарай неше топқа бөлінеді?
                5.	Айбек өткен жазда қайда барды?
                6.	Ол кімдермен бірге саяхатқа шықты?
                7.	Париж қай елдің астанасы?
                8.	Париж несімен әйгілі?
                9.	Жыл сайын Парижге кімдер келеді?
                10.	Қаланың ең танымал көрікті орны қалай аталады?
            `)
};
