import { Topic } from "..";
import dedent from 'dedent';

export const A2_2_TOPIC: Topic = {
    title: {
        kk: "ДЕНСАУЛЫҚ",
        ru: "ЗДОРОВЬЕ",
        en: "HEALTH"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    сергек
                    күнделікті
                    қиындықсыз
                    күтім жасау
                    сақтау
                    ағза
                    жайсыз сезіну
                    пайдалы
                    жеткілікті
                    кеңес
                    науқас
                    жедел жәрдем
                    тамақ ауруы
                    дене қызуы
                    ота жасау

                    ГРАММАТИКА
                    ҮСТЕУ. МЕЗГІЛ МЕН МЕКЕН ҮСТЕУЛЕРІ.

                    Үстеу – қимылдың немесе іс-әрекеттің қалай, қашан, қайда, қаншалықты болғанын білдіретін сөз табы. Үстеу көбіне етістікпен бірге қолданылады және қимылдың белгісін көрсетеді.
                    Сұрақтары:
                    •	Қалай? – жақсы, тез, баяу
                    •	Қашан? – бүгін, ертең, қазір
                    •	Қайда? – жоғары, төмен, алға
                    •	Қаншалықты? – өте, тым, аздап
                    Үстеу сөздер мағынасына қарай таптастырғанда мынадай 8 топқа бөлінеді.
                    •	Мезгіл үстеулер
                    •	Мекен үстеулер
                    •	Мөлшер үстеулері
                    •	Сын (я бейне) үстеулері
                    •	Күшейту (я ұлғайту) үстеулері
                    •	Мақсат үстеулері
                    •	Себеп-салдар үстеулері
                    •	Топтау (я бөлу) үстеулері
                    Мөлшер үстеуі – қимылдың немесе іс-әрекеттің мөлшерін, көлемін, дәрежесін білдіреді. Ол қанша?, қаншалықты?, қанша рет? деген сұрақтарға жауап береді.
                    Сұрақтары: Қанша? Қаншалықты? Қанша рет?
                    Мысалдар: Мен өте жақсы дайындалдым. Ол аз сөйлейді. Біз көп жұмыс істедік.
                    Балалар біршама шаршады. Ол екі рет келді.
                    Жиі қолданылатын мөлшер үстеулері:
                    өте, тым, аса, ең, көп, аз, біршама, біраз, едәуір, мүлде, екі рет, үш рет.
                    Сын-бейне үстеуі – қимылдың немесе іс-әрекеттің қалай орындалғанын, амалын, бейнесін білдіреді. Ол қалай?, қайтіп?, қалайша? деген сұрақтарға жауап береді.
                    Сұрақтары: Қалай? Қайтіп? Қалайша?
                    Мысалдар: Ол жақсы сөйлейді. Балалар тез жүгірді. Әжем жайлап жүрді. Мұғалім анық түсіндірді. Олар бірге келді.
                    Жиі қолданылатын сын-бейне үстеулері: жақсы, жаман, тез, баяу, ақырын, жайлап, анық, дұрыс, бірге, жеке.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    сергек	бодрый
                    күнделікті	ежедневный
                    қиындықсыз	без трудностей
                    күтім жасау	заботиться
                    сақтау	сохранять
                    ағза	организм
                    жайсыз сезіну	чувствовать себя плохо
                    пайдалы	полезный
                    жеткілікті	достаточный
                    кеңес	совет, рекомендация
                    науқас	пациент, больной
                    жедел жәрдем	скорая помощь
                    тамақ ауруы	боль в горле
                    дене қызуы	температура тела
                    ота жасау	делать операцию, проводить операцию

                    ГРАММАТИКА.
                    ҮСТЕУ. МЕЗГІЛ МЕН МЕКЕН ҮСТЕУЛЕРІ.
                    НАРЕЧИЕ. НАРЕЧИЕ МЕРЫ И СТЕПЕНИ. НАРЕЧИЕ ОБРАЗА ДЕЙСТВИЯ. 

                    Наречие — это часть речи, которая обозначает, как, когда, где и насколько совершается действие. Наречие чаще всего употребляется с глаголом и характеризует действие.
                    Вопросы:
                    •	Как? — хорошо, быстро, медленно.
                    •	Когда? — сегодня, завтра, сейчас.
                    •	Где? — наверху, внизу, впереди.
                    •	Насколько? — очень, слишком, немного.
                    По значению наречия делятся на 8 групп:
                    •	Наречия времени.
                    •	Наречия места.
                    •	Наречия меры и степени.
                    •	Наречия образа действия.
                    •	Усилительные наречия.
                    •	Наречия цели.
                    •	Наречия причины и следствия.
                    •	Распределительные наречия.
                    •	Наречия времени
                    Наречие меры и степени – обозначает меру, степень или количество действия. Отвечает на вопросы: сколько?, насколько?, сколько раз?
                    Вопросы: Сколько? Насколько? Сколько раз?
                    Примеры:Я очень хорошо подготовился. Он мало говорит. Мы много работали.
                    Дети немного устали. Он приходил два раза.
                    Часто употребляемые наречия меры и степени: очень, слишком, весьма, наиболее, много, мало, немного, достаточно, значительно, совсем, два раза, три раза.
                    Наречие образа действия – обозначает, как совершается действие, каким способом или образом оно выполняется. Отвечает на вопросы: как?, каким образом?
                    Вопросы: Как? Каким образом?
                    Примеры: Он хорошо говорит. Дети быстро бегали. Бабушка медленно ходила.
                    Учитель понятно объяснил. Они пришли вместе.
                    Часто употребляемые наречия образа действия: хорошо, плохо, быстро, медленно, тихо, неторопливо, понятно, правильно, вместе.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақша	english
                    сергек	energetic
                    күнделікті	daily
                    қиындықсыз	easily / without difficulty
                    күтім жасау	take care of
                    сақтау	protect / maintain
                    ағза	body
                    жайсыз сезіну	feel unwell
                    пайдалы	healthy / useful
                    жеткілікті	enough / sufficient
                    кеңес	advice
                    науқас	patient
                    жедел жәрдем	ambulance
                    тамақ ауруы	sore throat
                    дене қызуы	body temperature
                    ота жасау	perform an operation / perform surgery

                    Adverbs. An adverb is a part of speech that tells us how, when, where, or to what degree an action happens. Adverbs usually describe verbs and give more information about an action.
                    Questions:
                    •	How? – well, quickly, slowly.
                    •	When? – today, tomorrow, now.
                    •	Where? – up, down, forward.
                    •	To what degree? – very, too, a little.
                    According to their meaning, adverbs are divided into 8 groups:
                    •	Adverbs of Time
                    •	Adverbs of Place
                    •	Adverbs of Degree
                    •	Adverbs of Manner
                    •	Intensifying Adverbs
                    •	Adverbs of Purpose
                    •	Adverbs of Cause and Result
                    •	Distributive Adverbs
                    Adverbs of Degree. An adverb of degree shows the degree, amount, or intensity of an action, adjective, or another adverb. It answers the questions: How much? To what extent? How many times?
                    Questions: How much? To what extent? How many times?
                    Examples: I prepared very well. He talks little. We worked a lot. The children were quite tired. He came twice.
                    Common adverbs of degree: very, too, quite, rather, extremely, so, much, little, enough, almost, nearly.
                    Adverbs of Manner. An adverb of manner describes how an action is performed. It answers the question: How?
                    Questions: How?
                    Examples: He speaks well. The children ran quickly. My grandmother walks slowly.
                    The teacher explained the lesson clearly. They arrived together.
                    Common adverbs of manner:
                    well, badly, quickly, slowly, quietly, carefully, clearly, correctly, together, separately.
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                Денсаулық – адамның ең үлкен байлығы. Денсаулығы жақсы адам өзін сергек сезінеді, жақсы жұмыс істейді және күнделікті істерін қиындықсыз орындайды. Сондықтан әр адам өз денсаулығына күтім жасауы керек.
                Денсаулықты сақтау үшін дұрыс тамақтану маңызды. Көкөніс, жеміс-жидек және пайдалы тағамдарды көбірек жеген дұрыс. Сонымен қатар, күніне жеткілікті мөлшерде су ішіп, спортпен айналысу қажет. Таза ауада серуендеу де ағзаға пайдалы.
                Адам күніне 7–8 сағат ұйықтауы керек. Егер адам өзін жайсыз сезінсе, дәрігерге қаралып, оның кеңесін орындағаны дұрыс. Салауатты өмір салтын ұстанған адам сирек ауырады және өзін әрдайым жақсы сезінеді.
            `),
    reading: dedent(`
                Менің атым – Данияр. Мен отыз жастамын. Мен банкте жұмыс істеймін. Бұрын мен денсаулығыма көп көңіл бөлмейтінмін. Таңертең кеш тұратынмын, таңғы ас ішпейтінмін. Жұмыста көп отыратынмын. Кешке тез дайындалатын тағам жеп, кеш ұйықтайтынмын. Сондықтан мен жиі шаршайтынмын және кейде ауыратынмын.
                Бір күні мен дәрігерге бардым. Дәрігер маған дұрыс тамақтануға, көбірек су ішуге және күн сайын қозғалыс жасауға кеңес берді. Мен оның кеңесін орындауға шешім қабылдадым.
                Қазір мен таңертең ерте тұрамын. Күн сайын жеңіл жаттығу жасаймын. Таңғы асқа ботқа, жұмыртқа және жеміс жеймін. Жұмысқа жаяу барамын. Түскі асқа пайдалы тағам жеймін. Күніне екі литрге жуық су ішемін. Кешке таза ауада серуендеймін және ерте ұйықтаймын.
                Қазір мен өзімді жақсы сезінемін. Мен сирек ауырамын, көңіл күйім жақсы және жұмысымды қуана істеймін. Менің ойымша, денсаулық – адамның ең үлкен байлығы. Сондықтан әр адам өз денсаулығына күн сайын көңіл бөлуі керек.
            `),
    readingTest: [
        {
            "question": "Данияр қайда жұмыс істейді?",
            "answers": [
                "Мектепте",
                "Ауруханада",
                "Банкте",
                "Кеңседе"
            ]
        },
        {
            "question": "Дәрігер Даниярға қандай кеңес берді?",
            "answers": [
                "Дұрыс тамақтануға және көбірек су ішуге.",
                "Көп жұмыс істеуге.",
                "Ерте ұйықтауға.",
                "Көбірек серуендеуге"
            ]
        },
        {
            "question": "Данияр күніне шамамен қанша су ішеді?",
            "answers": [
                "Бір литрге жуық",
                "Екі литрге жуық",
                "Үш литрге жуық",
                "Төрт литрге жуық"
            ]
        },
        {
            "question": "Данияр жұмыста не істейтін?",
            "answers": [
                "Көп жүретін.",
                "Көп жұмыс жасайтын.",
                "Көп отыратын.",
                "Көп ұйықтайтын"
            ]
        },
        {
            "question": "Қазір Данияр таңғы асқа не жейді?",
            "answers": [
                "Ботқа, жұмыртқа және жеміс жейді.",
                "Тек шай ішеді.",
                "Тек тәтті тағам жейді.",
                "Ботқа және газдалған сусын"
            ]
        },
        {
            "question": "Мөлшер үстеуін табыңыз.",
            "answers": [
                "жақсы",
                "өте",
                "тез",
                "жаман"
            ]
        },
        {
            "question": "Қай сөйлемде сын-бейне үстеуі қолданылған?",
            "answers": [
                "Ол екі рет келді.",
                "Біз аз жұмыс істедік.",
                "Мұғалім анық түсіндірді.",
                "Ол сабаққа келмеді."
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-2_Денсаулық.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                1.	Егер адамның тамағы ауырса, ол алдымен __________ барады.
                2.	Емханада науқас __________ өтеді және дәрігерге қаралады.
                3.	Дәрігер науқасқа __________ береді.
                4.	Көп жағдайда науқас емханадан кейін __________ қайтады.
                5.	Егер адамның жағдайы ауыр болса, оны __________ жатқызады.
                6.	Кейбір науқастар __________ ауруханаға жеткізіледі.
                7.	Қажет болған жағдайда науқасқа __________ жасалады.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Мөлшер үстеуі қандай сұрақтарға жауап береді?
                2.	Сын-бейне үстеуі қандай сұрақтарға жауап береді?
                3.	Денсаулықты сақтау үшін не істеу керек?
                4.	Адам күніне неше сағат ұйықтауы керек?
                5.	Дәрігер өзін жайсыз сезінген адамға қандай кеңес береді?
                6.	Емханаға адамдар қандай жағдайда барады?
                7.	Ауруханаға адамдар қандай жағдайда жатқызылады?
            `)
};
