import { Topic } from "..";
import dedent from 'dedent';

export const A2_2_TOPIC: Topic = {
    title: {
        kk: "ДЕНСАУЛЫҚ",
        ru: "ЗДОРОВЬЕ",
        en: "HEALTH"
    },
    description: {
        kk: "src/assets/document/a2/ru/2-сабақ А2. Денсаулық (каз-рус).docx",
        ru: "src/assets/document/a2/ru/2-сабақ А2. Денсаулық (каз-рус).docx",
        en: "src/assets/document/a2/en/2-сабақ А2. Денсаулық (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Денсаулықты сақтау үшін күн сайын ________ айналысу қажет. 
        2.	Таңертең мен таза ________ жарты сағат серуендеймін. 
        3.	Егер өзіңізді жайсыз сезінсеңіз, міндетті түрде ________ қаралыңыз. 
        4.	Дұрыс тамақтанатын адам көкөніс пен ________ күн сайын тұтынады. 
        5.	Дәрігер маған күніне екі литр ________ ішуге кеңес берді. 
        6.	Ұзақ уақыт компьютердің алдында отырғаннан кейін ________ жасаған пайдалы. 
        7.	Салауатты өмір салтын ұстанатын адамдар ________ сирек шалдығады.
    `),
    writingAnswer: dedent(`
        1.	Денсаулықты сақтау үшін күн сайын спортпен айналысу қажет.
        2.	Таңертең мен таза ауада жарты сағат серуендеймін.
        3.	Егер өзіңізді жайсыз сезінсеңіз, міндетті түрде дәрігерге қаралыңыз.
        4.	Дұрыс тамақтанатын адам көкөніс пен жеміс-жидекті күн сайын тұтынады.
        5.	Дәрігер маған күніне екі литр су ішуге кеңес берді.
        6.	Ұзақ уақыт компьютердің алдында отырғаннан кейін жаттығу жасаған пайдалы.
        7.	Салауатты өмір салтын ұстанатын адамдар ауруға сирек шалдығады.
    `),
    reading: dedent(`
        Менің атым – Данияр. Мен отыз жастамын. Мен банкте жұмыс істеймін. Бұрын мен денсаулығыма көп көңіл бөлмейтінмін. Таңертең кеш тұратынмын, таңғы ас ішпейтінмін. Жұмыста көп отыратынмын. Кешке тез дайындалатын тағам жеп, кеш ұйықтайтынмын. Сондықтан мен жиі шаршайтынмын және кейде ауыратынмын.
        Бір күні мен дәрігерге бардым. Дәрігер маған дұрыс тамақтануға, көбірек су ішуге және күн сайын қозғалыс жасауға кеңес берді. Мен оның кеңесін орындауға шешім қабылдадым.
        Қазір мен таңертең ерте тұрамын. Күн сайын жеңіл жаттығу жасаймын. Таңғы асқа ботқа, жұмыртқа және жеміс жеймін. Жұмысқа жаяу барамын. Түскі асқа пайдалы тағам жеймін. Күніне екі литрге жуық су ішемін. Кешке таза ауада серуендеймін және ерте ұйықтаймын.
        Қазір мен өзімді жақсы сезінемін. Мен сирек ауырамын, көңіл күйім жақсы және жұмысымды қуана істеймін. Менің ойымша, денсаулық – адамның ең үлкен байлығы. Сондықтан әр адам өз денсаулығына күн сайын көңіл бөлуі керек.
    `),
    readingTest: [
        {
            "question": "Данияр қайда жұмыс істейді?",
            "answers": [
                "Мектепте",
                "Ауруханада",
                "Банкте",
                "Кеңседе"
            ]
        },
        {
            "question": "Дәрігер Даниярға қандай кеңес берді?",
            "answers": [
                "Дұрыс тамақтануға және көбірек су ішуге.",
                "Көп жұмыс істеуге.",
                "Ерте ұйықтауға.",
                "Көбірек серуендеуге"
            ]
        },
        {
            "question": "Данияр күніне шамамен қанша су ішеді?",
            "answers": [
                "Бір литрге жуық",
                "Екі литрге жуық",
                "Үш литрге жуық",
                "Төрт литрге жуық"
            ]
        },
        {
            "question": "Данияр жұмыста не істейтін?",
            "answers": [
                "Көп жүретін.",
                "Көп жұмыс жасайтын.",
                "Көп отыратын.",
                "Көп ұйықтайтын"
            ]
        },
        {
            "question": "Қазір Данияр таңғы асқа не жейді?",
            "answers": [
                "Ботқа, жұмыртқа және жеміс жейді.",
                "Тек шай ішеді.",
                "Тек тәтті тағам жейді.",
                "Ботқа және газдалған сусын"
            ]
        },
        {
            "question": "Мөлшер үстеуін табыңыз.",
            "answers": [
                "жақсы",
                "өте",
                "тез",
                "жаман"
            ]
        },
        {
            "question": "Қай сөйлемде сын-бейне үстеуі қолданылған?",
            "answers": [
                "Ол екі рет келді.",
                "Біз аз жұмыс істедік.",
                "Мұғалім анық түсіндірді.",
                "Ол сабаққа келмеді."
            ]
        }
    ],
    readingAnswer: dedent(`
        1. б) Банкте
        2. а) Дұрыс тамақтануға және көбірек су ішуге
        3. ә) Екі литрге жуық
        4. б) Көп отыратын.
        5. а) Ботқа, жұмыртқа және жеміс жейді.
        6. ә) өте		
        7. б) Мұғалім анық түсіндірді.
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-2_Денсаулық.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Егер адамның тамағы ауырса, ол алдымен __________ барады.
        2.	Емханада науқас __________ өтеді және дәрігерге қаралады.
        3.	Дәрігер науқасқа __________ береді.
        4.	Көп жағдайда науқас емханадан кейін __________ қайтады.
        5.	Егер адамның жағдайы ауыр болса, оны __________ жатқызады.
        6.	Кейбір науқастар __________ ауруханаға жеткізіледі.
        7.	Қажет болған жағдайда науқасқа __________ жасалады.
    `),
    listeningAnswer: dedent(`
        1.	Егер адамның тамағы ауырса, ол алдымен емханаға барады.
        2.	Емханада науқас тексеруден өтеді және дәрігерге қаралады.
        3.	Дәрігер науқасқа кеңес береді.
        4.	Көп жағдайда науқас емханадан кейін үйіне қайтады.
        5.	Егер адамның жағдайы ауыр болса, оны ауруханаға жатқызады.
        6.	Кейбір науқастар жедел жәрдеммен ауруханаға жеткізіледі.
        7.	Қажет болған жағдайда науқасқа ота жасалады.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Мөлшер үстеуі қандай сұрақтарға жауап береді?
        2.	Сын-бейне үстеуі қандай сұрақтарға жауап береді?
        3.	Денсаулықты сақтау үшін не істеу керек?
        4.	Адам күніне неше сағат ұйықтауы керек?
        5.	Дәрігер өзін жайсыз сезінген адамға қандай кеңес береді?
        6.	Емханаға адамдар қандай жағдайда барады?
        7.	Ауруханаға адамдар қандай жағдайда жатқызылады?
    `),
    speakingAnswer: dedent(`
        1.	Мөлшер үстеуі қанша? қаншалықты? қанша рет? сұрақтарына жауап береді.
        2.	Сын-бейне үстеуі Қалай? Қайтіп? Қалайша? Сұрақтарына жауап береді.
        3.	Денсаулықты сақтау үшін әр адам өз денсаулығына күн сайын көңіл бөлуі керек.
        4.	Адам күніне 7-8 сағат ұйықтауы керек.
        5.	Дәрігер дұрыс тамақтануға, көбірек су ішуге және күн сайын қозғалыс жасауға кеңес береді.
        6.	Егер адамның тамағы ауырса, дене қызуы көтерілсе немесе қан қысымын тексеру керек болса, ол алдымен емханаға барады.
        7.	Егер адамның жағдайы ауыр болса немесе оған ота жасау қажет болса, оны ауруханаға жатқызады.
    `)
};
