import { Topic } from "..";
import dedent from 'dedent';

export const A2_4_TOPIC: Topic = {
    title: {
        kk: "БІЗДІҢ ҰЖЫМ",
        ru: "НАШ КОЛЛЕКТИВ",
        en: "OUR TEAM"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    ұжым
                    қателік
                    жиналыс
                    шаралар
                    қызметкер
                    қарым-қатынас
                    ұйымшыл
                    нәтиже
                    бірлік
                    міндет
                    жауапкершілік
                    басшы 
                    құжат
                    қарым-қатынас
                    техникалық ақау
                    түсінбеушілік
                    бөлім
                    көмек

                    ГРАММАТИКА. 
                    СЕПТЕУЛІК ШЫЛАУЛАР: БІРГЕ, ҚАТАР, ҚОСА

                    Септеулік шылаулар – сөздерді байланыстыратын көмекші сөздер. Олар өзінен бұрын тұрған сөзбен бірге қолданылып, қосымша мағына береді.
                    1. Бірге
                    Бірге – бір адаммен немесе бір затпен қатар, бірге әрекет жасауды білдіреді.
                    Сұрағы: Кіммен? Немен?
                    Мысалдар:Мен досыммен бірге киноға бардым. Біз мұғаліммен бірге тапсырма орындадық. Ол отбасымен бірге саяхатқа шықты.
                    2. Қатар
                    Қатар – бір мезгілде немесе қатар орналасуды білдіреді.
                    Мысалдар: Мен досыммен қатар отырдым. Олар үймен қатар ағаш отырғызды.
                    Біз сабақпен қатар спортпен айналысамыз.
                    3. Қоса
                    Қоса – бір нәрсеге тағы бір нәрсені бірге қосуды білдіреді.
                    Мысалдар: Мен шайға қантты қоса алдым. Хатпен қоса сурет жібердім.
                    Құжатпен қоса өтінішті тапсырдым.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    ұжым	коллектив
                    қателік	ошибка
                    жиналыс	собрание
                    шаралар	мероприятия
                    қызметкер	сотрудник
                    қарым-қатынас	общение, взаимоотношения
                    ұйымшыл	организованный, сплочённый
                    нәтиже	результат
                    бірлік	единство
                    міндет	обязанность, задача
                    жауапкершілік	ответственность
                    басшы 	руководитель
                    құжат	документ
                    қарым-қатынас	общение, взаимоотношения
                    техникалық ақау	техническая неисправность
                    түсінбеушілік	недопонимание
                    бөлім	отдел
                    көмек	помощь

                    ГРАММАТИКА.
                    ПОСЛЕЛОГИ

                    Послелоги — это служебные слова, которые связывают слова в предложении. Они употребляются после слова и придают ему дополнительное значение.
                    1. Бірге (вместе с)
                    Бірге обозначает совместное действие с человеком или предметом.
                    Вопросы: С кем? С чем?
                    Примеры: Я пошёл в кино вместе с другом. Мы вместе с учителем выполнили задание. Он отправился в путешествие вместе с семьёй.
                    2. Қатар (наряду с, одновременно с)
                    Қатар обозначает одновременное действие или нахождение рядом.
                    Примеры: Я сидел рядом с другом. Они посадили деревья рядом с домом. Мы наряду с учёбой занимаемся спортом.
                    3. Қоса (вместе с, дополнительно)
                    Қоса обозначает добавление одного предмета или документа к другому.
                    Примеры: Я добавил сахар в чай. Я отправил письмо вместе с фотографией.
                    Я сдал заявление вместе с документами.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақша	english
                    ұжым	team/collective
                    қателік	mistake / error
                    жиналыс	meeting
                    шаралар	events/activities
                    қызметкер	employee
                    қарым-қатынас	communication / relationship
                    ұйымшыл	organized/united
                    нәтиже	result
                    бірлік	unity
                    міндет	duty/task/responsibility
                    жауапкершілік	responsibility
                    басшы 	manager/leader
                    құжат	document
                    қарым-қатынас	communication / relationship
                    техникалық ақау	technical problem/technical fault
                    түсінбеушілік	misunderstanding
                    бөлім	department
                    көмек	help / assistance

                    ГРАММАТИКА. GRAMMAR. 
                    СЕПТЕУЛІК ШЫЛАУЛАР: БІРГЕ, ҚАТАР, ҚОСА. 
                    POSTPOSITIONS: TOGETHER WITH, ALONG WITH, IN ADDITION TO.

                    Postpositions are function words that connect words in a sentence. They are placed after a word and give it additional meaning.
                    1. Бірге (with, together with)
                    Бірге means doing something together with a person or thing.
                    Questions: With whom? With what?
                    Examples:I went to the cinema with my friend.
                    We completed the task together with the teacher.
                    He went on a trip with his family.
                    2. Қатар (along with, at the same time as, next to)
                    Қатар means doing something at the same time as something else or being next to someone or something.
                    Examples: I sat next to my friend.
                    They planted trees next to the house.
                    We do sports along with our studies.
                    3. Қоса (together with, in addition to)
                    Қоса means adding one thing to another or including something extra.
                    Examples:I added sugar to my tea.
                    I sent a photo together with the letter.
                    I submitted the application together with the documents.
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                <b>Біздің ұжым</b>

                Біздің ужым өте тату және уйымшыл. Біз бір-бірімізге әрдайым көмектесеміз және бір-бірімізді құрметтейміз. Ұжымда әр адамның өз міндеті бар. Барлығы өз жұмысын жауапкершілікпен орындайды.
                Біз күн сайын бірге жұмыс істейміз. Жұмыс барысында жаңа идеялармен бөлісеміз, пікір алмасамыз және қиын мәселелерді бірге шешеміз. Әріптестеріміз мейірімді, сыпайы және еңбекқор.
                Мереке күндері немесе маңызды ісшараларда ужым болып түрлі шараларға қатысамыз. Бұл біздің қарым-қатынасымызды нығайтады және бірлігімізді арттырады.
                Жақсы ұжымда жұмыс істеу – үлкен куаныш. Бірлігі жарасқан ужым арқашан жақсы нәтижеге жетеді.
            `),
    reading: dedent(`
                <b>Менің ұжымым</b>

                Менің атым – Данияр. Мен ірі компанияда инженер болып жұмыс істеймін. Біздің ұжымда жиырмаға жуық қызметкер бар. Ұжымымыз өте ұйымшыл, жауапты және еңбекқор. Біз әрқашан бір-бірімізді қолдап, ортақ мақсатқа жету үшін бірге еңбек етеміз. Жұмыс күніміз таңертеңгі жиналыстан басталады. Сол жерде алдағы жұмыстарды талқылап, әр қызметкердің міндеттерін бөлісеміз. Кейде күрделі жобалармен жұмыс істейміз. Ондай кезде әріптестеріміз өз тәжірибесімен бөлісіп, қиын мәселелерді бірлесіп шешеді. Егер біреу қателік жіберсе, оны сынамаймыз, керісінше дұрыс шешім табуға көмектесеміз. Біздің ұжымда өзара сыйластық пен сенім жоғары бағаланады. Әр қызметкердің пікірі маңызды. Жаңа идея ұсынылса, оны бірге талқылап, ең тиімді шешімді таңдаймыз. Бұл жұмыс сапасын жақсартып, жақсы нәтижеге жетуге мүмкіндік береді. Мереке күндері немесе кәсіби мерекелерде ұжым болып түрлі іс-шаралар ұйымдастырамыз. Кейде спорттық жарыстарға қатысамыз, кейде табиғатқа демалуға шығамыз. Осындай кездесулер бізді жақындастырып, достық қарым-қатынасымызды нығайтады. Мен өз ұжымымды мақтан тұтамын. Себебі жақсы ұжымда жұмыс істеу адамға күш береді, жаңа жетістіктерге жетуге ынталандырады және өз мамандығын сүйе түсуге көмектеседі.
            `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі мақсаты қандай?",
            "answers": [
                "Инженер мамандығының ерекшелігін түсіндіру.",
                "Ұжымдағы ынтымақтастық пен өзара қолдаудың маңызын көрсету.",
                "Компанияның жұмыс кестесін таныстыру.",
                "Спорттық іс-шаралар туралы ақпарат беру."
            ]
        },
        {
            "question": "Қай сөйлем мәтіннің мазмұнына сәйкес келеді?",
            "answers": [
                "Қызметкерлер барлық шешімді басшының өзі қабылдайды.",
                "Ұжым мүшелері қиын мәселелерді өз бетінше шешеді.",
                "Қызметкерлер жаңа идеяларды бірге талқылап, тиімді шешім қабылдайды.",
                "Қызметкерлер арасында пікір алмасу болмайды."
            ]
        },
        {
            "question": "«Егер біреу қателік жіберсе, оны сынамаймыз...» деген сөйлемнен қандай қорытынды жасауға болады?",
            "answers": [
                "Ұжымда өзара қолдау мен түсіністік бар.",
                "Ұжымда тәртіп жоқ.",
                "Қателікке ешкім назар аудармайды.",
                "Қызметкерлер өз жұмысын дұрыс орындамайды."
            ]
        },
        {
            "question": "Ұжым болып ұйымдастырылатын іс-шаралардың негізгі мақсаты қандай?",
            "answers": [
                "Жұмыс уақытын қысқарту.",
                "Қызметкерлердің демалысын көбейту.",
                "Ұжым мүшелерінің достығы мен бірлігін нығайту.",
                "Компанияның табысын арттыру."
            ]
        },
        {
            "question": "Мәтіндегі «Әр қызметкердің пікірі маңызды» деген ой нені білдіреді?",
            "answers": [
                "Барлық шешімді тек басшы қабылдайды.",
                "Ұжымда пікірталасқа рұқсат етілмейді.",
                "Қызметкерлер өз ойын айтпайды.",
                "Қызметкерлердің ұсыныстары мен ойлары ескеріледі."
            ]
        },
        {
            "question": "«Бірге» септеулік шылауының негізгі мағынасы қандай?",
            "answers": [
                "Қатар орналасуды білдіреді.",
                "Бірге әрекет жасауды білдіреді.",
                "Бағытты білдіреді.",
                "Себепті білдіреді."
            ]
        },
        {
            "question": "«Біз сабақпен қатар спортпен айналысамыз» сөйлеміндегі «қатар» сөзі қандай мағына береді?",
            "answers": [
                "Бірге қосып жіберуді білдіреді.",
                "Бір мезгілде екі іс-әрекетті орындауды білдіреді.",
                "Бағытты білдіреді.",
                "Себепті білдіреді."
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-4_Біздің-ұжым.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                1.	Соңғы кезде Айжан мен Нұрланның арасында _____ пайда болды.
                2.	Бір күні Нұрлан маңызды _____ уақытында жібермей қалды.
                3.	Нұрлан құжатты кеш жібергені үшін _____ сұрады.
                4.	Ол компьютерінде _____ болғанын түсіндірді.
                5.	Олар маңызды тапсырмалар туралы бір-біріне уақытында _____отыруға келісті.
                6.	Осы жағдайдан кейін қызметкерлер бір-біріне көбірек _____білдіре бастады.
                7.	Әңгімеден кейін олар бірге жұмыс істеуді _____.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Септеулік шылаулар дегеніміз не?
                2.	Септеулік шылаулар қандай қызмет атқарады?
                3.	Жауапкершілік дегеніміз не?
                4.	Жұмыста қателік болған жағдайда не істеу керек?
                5.	Қарым-қатынас не үшін қажет?
                6.	Ұжымдық іс-шаралар қызметкерлерге қалай әсер етеді?
                7.	Ұжымдағы әр адамның міндеті қандай болуы керек?
            `)
};
