import { Topic } from "..";
import dedent from 'dedent';

export const A2_5_TOPIC: Topic = {
    title: {
        kk: "ӨМІРБАЯН",
        ru: "БИОГРАФИЯ",
        en: "BIOGRAPHY"
    },
    description: {
        kk: "src/assets/document/a1/ru/5-сабақ А2. Өмірбаян (каз-рус).docx",
        ru: "src/assets/document/a1/ru/5-сабақ А2. Өмірбаян (каз-рус).docx",
        en: "src/assets/document/a1/en/5-сабақ А2. Өмірбаян (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Мен 2000 жылы 18 сәуірде Қызылорда қаласында дүниеге ____.
        2.	Балалық шағым сол қалада ____.
        3.	Отбасымда алты адам ____.
        4.	Бала кезімнен кітап оқуды және спортпен айналысуды ____.
        5.	2018 жылы университеттің экономика факультетіне оқуға ____.
        6.	Студент кезімде бірнеше ғылыми жобаға ____.
        7.	Қоғамдық іс-шараларға қатысып, жаңа адамдармен ____.

        Қажетті сөздер: ұнатамын, келдім, таныстым, қатыстым, тұрады, түстім, өтті.
    `),
    writingAnswer: dedent(`
        1.	Мен 2000 жылы 18 сәуірде Қызылорда қаласында дүниеге келдім.
        2.	Балалық шағым сол қалада өтті.
        3.	Отбасымда алты адам тұрады.
        4.	Бала кезімнен кітап оқуды және спортпен айналысуды ұнатамын.
        5.	2018 жылы университеттің экономика факультетіне оқуға түстім.
        6.	Студент кезімде бірнеше ғылыми жобаға қатыстым.
        7.	Қоғамдық іс-шараларға қатысып, жаңа адамдармен таныстым.
    `),
    reading: dedent(`
        <b>Өмірімдегі маңызды өзгеріс</b>

        Бес жыл бұрын менің өмірімде үлкен өзгеріс болды. Ол кезде мен ауылдағы мектептің 11-сыныбында оқитынмын. Мектепті аяқтағаннан кейін қай мамандықты таңдайтынымды ұзақ ойладым. Ата-анам менің өзіме ұнайтын мамандықты таңдағанымды қалады. Сондықтан мен бірнеше университет туралы ақпарат жинап, олардың білім беру бағдарламаларымен таныстым.
        Ақырында, өзім қалаған университетке құжат тапсырдым. Қабылдау емтихандарын сәтті тапсырып, студент атандым. Алғашқы күндері жаңа қалаға және жаңа ортаға үйрену оңай болған жоқ. Бірақ уақыт өте келе жаңа достар таптым, оқытушылармен жақсы қарым-қатынас орнаттым және университет өміріне тез бейімделдім.
        Студент кезімде тек сабаққа қатысып қана қоймай, түрлі жобаларға, еріктілер қозғалысына және мәдени іс-шараларға қатыстым. Осы тәжірбилердің арқасында көп нәрсе үйрендім, жауапкершілігім артты және өзіме деген сенімім күшейді.
        Қазір мен өз мамандығым бойынша жұмыс істеймін. Кейде қиындықтар кездескенімен, таңдаған мамандығыма өкінбеймін. Болашақта білімімді жалғастырып, кәсіби деңгейімді көтергім келеді. Менің ойымша, әр адам өз мақсатына жету үшін үнемі ізденіп, жаңа білім алуға дайын болуы керек.
    `),
    readingTest: [
        {
            "question": "Автор университетті таңдауда қандай әрекеттерді бірінші кезекте орындады?",
            "answers": [
                "Құжаттарын бірден тапсырды.",
                "Достарының пікіріне ғана сенді.",
                "Бірнеше университет туралы ақпарат жинап, олардың білім беру бағдарламаларымен танысты.",
                "Ата-анасының таңдаған университетіне оқуға түсті."
            ]
        },
        {
            "question": "Мәтінге сәйкес, автордың университет өміріне тез бейімделуіне НЕГІЗГІ себеп не болды?",
            "answers": [
                "Университет үйіне жақын орналасқан.",
                "Жаңа достар тауып, оқытушылармен жақсы қарым-қатынас орнатқаны.",
                "Барлық сабақтар онлайн өткен.",
                "Бұрын осы қалада тұрған."
            ]
        },
        {
            "question": "Автор студент кезінде алған тәжірибенің нәтижесі ретінде қай өзгерістерді атап өтеді?",
            "answers": [
                "Жоғары жалақыға ие болды.",
                "Басқа университетке ауысты.",
                "Шетелге оқуға кетті.",
                "Жауапкершілігі артып, өзіне деген сенімі күшейді."
            ]
        },
        {
            "question": "Мәтіннің мазмұнына сәйкес, автор өз мамандығына қалай қарайды?",
            "answers": [
                "Мамандығын қате таңдадым деп есептейді.",
                "Болашақта мамандық бойынша жұмыс жасамайды.",
                "Басқа мамандыққа ауысқысы келеді.",
                "Қиындықтарға қарамастан, таңдаған мамандығына өкінбейді."
            ]
        },
        {
            "question": "Автордың негізгі ойын қай нұсқа дұрыс жеткізеді?",
            "answers": [
                "Мақсатқа жету үшін адам үнемі ізденіп, жаңа білім алуға дайын болуы керек.",
                "Жетістікке жету үшін тек диплом жеткілікті.",
                "Қиындық кездесе де сол жолдан таймау керек.",
                "Университетте тек жақсы баға алу маңызды."
            ]
        },
        {
            "question": "Қай сөйлемде бұрынғы өткен шақ қолданылған?",
            "answers": [
                "Мен кеше дүкенге бардым.",
                "Біз ертең киноға барамыз.",
                "Ол бұл кітапты бұрын оқыған.",
                "Мен күнде спортпен айналысамын."
            ]
        },
        {
            "question": "Қай сөйлемде ауыспалы өткен шақ қолданылған?",
            "answers": [
                "Олар кеше кеш келді.",
                "Мен бала кезімде атама жиі көмектесетінмін.",
                "Біз концертке бардық.",
                "Ол жаңа ғана үйге кірді."
            ]
        }
    ],
    readingAnswer: dedent(`
        1. Б) Бірнеше университет туралы ақпарат жинап, олардың білім беру бағдарламаларымен танысты. 
        2. Ә) Жаңа достар тауып, оқытушылармен жақсы қарым-қатынас орнатқаны. 
        3. В) Жауапкершілігі артып, өзіне деген сенімі күшейді.
        4. В) Қиындықтарға қарамастан, таңдаған мамандығына өкінбейді. 
        5. A) Мақсатқа жету үшін адам үнемі ізденіп, жаңа білім алуға дайын болуы керек.
        6. Б) Ол бұл кітапты бұрын оқыған. 
        7. Ә) Мен бала кезімде атама жиі көмектесетінмін. 
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-5_Өмірбаян.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Азамат ________ жылы шағын ауылда дүниеге келген.
        2.	Бала кезінен ол математикаға және ________ әуес болған.
        3.	Отбасылық жағдайға байланысты жоғары оқу орнына түсу ________.
        4.	Күндіз Азамат ________, ал түнде бағдарламалау тілдерін өз бетінше үйренген.
        5.	Еңбек жолын Азамат қатардағы ________ болып бастаған.
        6.	Бар болғаны ________ жылдың ішінде Азамат халықаралық компаниялардың жобаларын басқарған.
        7.	Қазіргі уақытта Азамат өз ________ ашып, жас талапкерлерге қолдау көрсетіп жүр.
        8.	Ол жас талапкерлерге ________ білім беру жобаларын қолдайды.
    `),
    listeningAnswer: dedent(`
        1.	Азамат 1998 жылы шағын ауылда дүниеге келген.
        2.	Бала кезінен ол математикаға және техникаға әуес болған.
        3.	Отбасылық жағдайға байланысты жоғары оқу орнына түсу оңайға түспейді.
        4.	Күндіз Азамат жұмыс істеп, ал түнде бағдарламалау тілдерін өз бетінше үйренген.
        5.	Еңбек жолын Азамат қатардағы қызметкер болып бастаған.
        6.	Бар болғаны бес жылдың ішінде Азамат халықаралық компаниялардың жобаларын басқарған.
        7.	Қазіргі уақытта Азамат өз стартабын ашып, жас талапкерлерге қолдау көрсетіп жүр.
        8.	Ол жас талапкерлерге тегін білім беру жобаларын қолдайды.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Өткен шақ дегеніміз не?
        2.	Қазақ тілінде өткен шақтың неше түрі бар?
        3.	Жедел өткен шақ, бұрынғы өткен шақ және ауыспалы өткен шақтың бір-бірінен қандай айырмашылығы бар?
        4.	Мәтінге сүйене отырып, студенттік кезеңдегі ғылыми жобаларға, семинарларға және қоғамдық іс-шараларға қатысу Даниярдың қазіргі кәсіби өміріне қалай әсер етті?
        5.	Даниярдың өткен өмір жолы, қазіргі қызметі және болашаққа қойған мақсаттары арасындағы байланысты талдап, оның қандай тұлғалық қасиеттерін байқауға болады?
        6.	Мәтінге сүйене отырып, автордың университетке түскеннен кейінгі өмірінде қандай өзгерістер болды және олар оның жеке әрі кәсіби дамуына қалай әсер етті?
        7.	Автордың «әр адам өз мақсатына жету үшін үнемі ізденіп, жаңа білім алуға дайын болуы керек» деген пікірін мәтіндегі нақты мысалдар арқылы түсіндіріңіз.
    `),
    speakingAnswer: dedent(`
        1.	Өткен шақ – сөйлеп тұрған уақыттан бұрын болған іс-әрекетті білдіретін етістіктің шағы.
        2.	Қазақ тілінде өткен шақтың негізгі үш түрі бар:
        •	Жедел өткен шақ
        •	Бұрынғы өткен шақ
        •	Ауыспалы өткен шақ
        3.	Жедел өткен шақ жақында немесе нақты уақытта аяқталған іс-әрекетті білдіреді. Бұрынғы өткен шақ әлдеқашан болған немесе бұрын орындалған іс-әрекетті білдіреді. Ауыспалы өткен шақ бұрын жиі қайталанған немесе әдетке айналған іс-әрекетті білдіреді.
        4.	Студент кезінде тек сабаққа қатысып қана қоймай, түрлі жобаларға, еріктілер қозғалысына және мәдени іс-шараларға қатысуының арқасында көп нәрсе үйренді, жауапкершілігі артты және өзіне деген сенімі күшейді.
        5.	Данияр мектептен кейін мамандық таңдауға жауапкершілікпен қарап, университеттер туралы ақпарат жинап, өзіне ұнайтын мамандықты таңдады. Университетте жаңа ортаға бейімделіп, түрлі жобалар мен еріктілер қозғалысына қатысып, тәжірибе жинақтады. Қазір таңдаған мамандығы бойынша жұмыс істеп, болашақта білімін жалғастырып, кәсіби деңгейін көтеруді жоспарлап отыр. Осыдан оның жауапкершілігі, мақсатшылдығы, ізденімпаздығы, еңбекқорлығы және өзіне деген сенімі жоғары екенін байқауға болады.
        6.	Университетке түскеннен кейін Данияр жаңа қала мен жаңа ортаға бейімделді, жаңа достар тауып, оқытушылармен жақсы қарым-қатынас орнатты. Сонымен қатар түрлі жобаларға, еріктілер қозғалысына және мәдени іс-шараларға қатысты. Бұл тәжірибелер оның жауапкершілігін арттырып, өзіне деген сенімін күшейтті, жаңа білім мен тәжірибе жинауына және кәсіби тұрғыдан дамуына ықпал етті.
        7.	Автор бұл пікірін өз өмірімен дәлелдейді. Ол мектепті аяқтаған соң бірнеше университет туралы ақпарат жинап, білім беру бағдарламаларымен танысып, өзіне ұнайтын мамандықты таңдады. Университетте сабақпен қатар түрлі жобаларға, еріктілер қозғалысына және мәдени іс-шараларға қатысып, жаңа тәжірибе жинады. Қазір де білімін жалғастырып, кәсіби деңгейін көтеруді мақсат етеді. Бұл оның үнемі іздену мен білім алудың адамды дамытып, мақсатына жетуге көмектесетінін көрсетеді.
    `)
};
