import { Topic } from "..";
import dedent from 'dedent';

export const A2_6_TOPIC: Topic = {
    title: {
        kk: "КИНОТЕАТР",
        ru: "КИНОТЕАТР",
        en: "CINEMA"
    },
    description: {
        kk: "src/assets/document/a1/ru/6-сабақ. А2. Кинотеатр (каз-рус).docx",
        ru: "src/assets/document/a1/ru/6-сабақ. А2. Кинотеатр (каз-рус).docx",
        en: "src/assets/document/a1/en/6-сабақ. А2. Кинотеатр (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Кеше мен досыммен кинотеатрға _____________ (бару).
        2.	Біз жаңа фильмді _____________ (көру).
        3.	Қазір көрермендер фильмді _____________ (көру отыр).
        4.	Мен кинотеатрда попкорн _____________ (жеу отыру).
        5.	Ертең біз тағы да кинотеатрға _____________ (бару).
        6.	Досым жаңа фильм туралы _____________ (айту).
        7.	Келесі аптада қызықты фильмді _____________ (көру).
    `),
    writingAnswer: dedent(`
        1.	Кеше мен досыммен кинотеатрға бардым.
        2.	Біз жаңа фильмді көреміз.
        3.	Қазір көрермендер фильмді көріп отыр.
        4.	Дәл қазір мен кинотеатрда попкорн жеп отырмын.
        5.	Ертең біз тағы да кинотеатрға барамыз.
        6.	Досым жаңа фильм туралы айтады.
        7.	Келесі аптада қызықты фильмді көреміз.
    `),
    reading: dedent(`
        Демалыс күні Айбек достарымен кинотеатрға барды. Олар алдын ала интернет арқылы билет сатып алды. Кинотеатрға келгенде, кассадан билеттерін тексертіп, үшінші қатардағы орындарына отырды. Фильм кешкі сағат жетіде басталды. Бұл қызықты тарихи фильм болды. Фильмнің басты кейіпкерлері батыл әрі ақылды адамдар еді. Актерлер өз рөлдерін өте жақсы орындады. Әдемі музка мен әсерлі көріністер көрермендерге ерекше көңіл күй сыйлады. Фильм екі сағатқа созылды. Сеанс аяқталғаннан кейін Айбек пен оның достары кино туралы өз пікірлерін айтты. Оларға фильм өте ұнады. Келесі аптада олар жаңа комедияны көруді жоспарлап отыр.
    `),
    readingTest: [
        {
            "question": "Айбек кіммен кинотеатрға барды?",
            "answers": [
                "Отбасымен",
                "Достарымен",
                "Жалғыз",
                "Ағасымен"
            ]
        },
        {
            "question": "Олар билетті қалай сатып алды?",
            "answers": [
                "Кинодан кейін",
                "Интернет арқылы",
                "Телефонмен",
                "Дүкеннен"
            ]
        },
        {
            "question": "Фильм қай уақытта басталды?",
            "answers": [
                "Сағат бес",
                "Сағат алты",
                "Сағат жеті",
                "Сағат сегіз"
            ]
        },
        {
            "question": "Олар қандай фильм көрді?",
            "answers": [
                "Комедия",
                "Қорқынышты фильм",
                "Тарихи фильм",
                "Мультфильм"
            ]
        },
        {
            "question": "Фильм қанша уақытқа созылды?",
            "answers": [
                "Бір сағат",
                "Екі сағат",
                "Үш сағат",
                "Төрт сағат"
            ]
        },
        {
            "question": "Қай сөйлем өткен шақта тұр?",
            "answers": [
                "Мен кино көріп отырмын.",
                "Біз кеше киноға бардық.",
                "Ертең киноға барамыз.",
                "Мен фильм көремін."
            ]
        },
        {
            "question": "Келесі аптада олар не көреді?",
            "answers": [
                "Драма",
                "Комедия",
                "Мультфильм",
                "Деректі фильм"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	Ә) Достарымен
        2.	Ә) Интернет арқылы
        3.	Б) Сағат жеті
        4.	Б) Тарихи фильм
        5.	Ә) Екі сағат
        6.	Ә) Біз кеше киноға бардық.
        7.	Ә) Комедия
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-6_Кинотеатр.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Кеше біз __________________ бардық.
        2.	Фильм кешкі сағат __________________ басталды.
        3.	Біз кассадан __________________ алдық.
        4.	Попкорн мен __________________ сатып алдық.
        5.	Фильм өте __________________ болды.
        6.	Көрермендер фильмді __________________ тамашалады.
        7.	Келесі демалыста біз __________________ көргіміз келеді.
    `),
    listeningAnswer: dedent(`
        1.	Кеше біз кинотетарға бардық.
        2.	Фильм кешкі сағат жетіде басталды.
        3.	Біз кассадан билеттерімізді алдық.
        4.	Попкорн мен сусын сатып алдық.
        5.	Фильм өте қызықты, әрі әсерлі болды.
        6.	Көрермендер фильмді қызығушылықпен тамашалады.
        7.	Келесі демалыста біз комедия көргіміз келеді.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Айбек достарымен қайда барды?
        2.	Олар билеттерді қалай сатып алды?
        3.	Фильм сағат нешеде басталды?
        4.	Фильм қандай болды?
        5.	Олар келесі демалыста қандай фильм көргісі келеді?
        6.	Өткен шақта бір сөйлем құрастырып, айтыңыз.
        7.	Келер шаққа бір сөйлем құрастырып, айтыңыз.
    `),
    speakingAnswer: dedent(`
        1.	Айбек достарымен кинотеатрға барды.
        2.	Олар билеттерді алдын ала интернет арқылы сатып алды.
        3.	Фильм кешкі сағат жетіде басталды.
        4.	Фильм қызықты әрі әсерлі тарихи фильм болды.
        5.	Олар келесі демалыста комедия фильмін көргісі келеді.
        6.	Біз кеше кинотеатрға бардық.
        7.	Келесі апта қорқынышты фильм көруге барамыз.
    `)
};
