import { Topic } from "..";
import dedent from 'dedent';

export const A2_7_TOPIC: Topic = {
    title: {
        kk: "САҒАТ ТІЛІ",
        ru: "СТРЕЛКИ ЧАСОВ",
        en: "CLOCK HANDS"
    },
    description: {
        kk: "src/assets/document/a1/ru/7-сабақ.А2.Сағат тілі (каз-рус).docx",
        ru: "src/assets/document/a1/ru/7-сабақ.А2.Сағат тілі (каз-рус).docx",
        en: "src/assets/document/a1/en/7-сабақ.А2.Сағат тілі(каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Сағат (үш) ______  жиырма минут қалды.
        2.	Жиналыс сағат (он бір) ______ басталады.
        3.	Кино сағат (жеті) ______ шамасында аяқталады.
        4.	Мен жұмысқа сағат (тоғыз) ______ келемін.
        5.	Автобус сағат (бес) ______ шамасында келеді.
        6.	Сабақ сағат (екі) ______ басталады.
        7.	Біз үйге сағат (алты) ______ жақын қайтамыз.
    `),
    writingAnswer: dedent(`
        1.	Сағат үшке жиырма минут қалды.
        2.	Жиналыс сағат он бірде басталады.
        3.	Кино сағат жетілер шамасында аяқталады.
        4.	Мен жұмысқа сағат тоғызда келемін.
        5.	Автобус сағат бестер шамасында келеді.
        6.	Сабақ сағат екіде басталады.
        7.	Біз үйге сағат алтыға жақын қайтамыз.
    `),
    reading: dedent(`
        <b>Шаянтәрізділер</b>

        Шаянтәрізділер буынаяқтылардың үлкен бір тобын құрайды. Олар көбінесе теңіз шаяндары, омарлар, су шаяндары, аяшаяндар, крил және ұлулар секілді әйгілі жануарлар түрін қамтиды. Олардың 50 000-ға жуық түрі әртүрлі көлемдерімен ерекшеленеді. Денесінің ұзындығы 0,1 мм-ге жететін ең ұсақ түрінен бастап, құлашы 4 м-ге, ал дене салмағы 20 келі тартатын жапон шаяны секілді түрлері бар. Басқа буынаяқтылар секілді шаянтәрізділердің де сыртқы қаңқалары болады.
        Шаянтәрізділердің ұсақ түрлері негізгі зоопланктан массасын құрайтын болғандықтан, олар судағы организмдердің қоректік тізбегінде буын болып табылады. Шаянтәрізділер майшабақтардың қорегі, суды өлекселерден  тазартады. Көпшілік түрлері (омар, лангуста, креветкалар, т.б.) дүниежүзінің көптеген елдерінде жоғарғы сапалы тағам ретінде пайдаланылады.
    `),
    readingTest: [
        {
            "question": "Шаянтәрізділер қандай жануарлар тобына жатады?",
            "answers": [
                "Сүтқоректілерге",
                "Буынаяқтыларға",
                "Құстарға",
                "Балықтарға"
            ]
        },
        {
            "question": "Шаянтәрізділердің қаншаға жуық түрі бар?",
            "answers": [
                "5 000-ға жуық",
                "10 000-ға жуық",
                "50 000-ға жуық",
                "100 000-ға жуық"
            ]
        },
        {
            "question": "Жапон шаянының дене салмағы қанша келіге дейін жетеді?",
            "answers": [
                "5 келі",
                "10 келі",
                "15 келі",
                "20 келі"
            ]
        },
        {
            "question": "Шаянтәрізділер судағы организмдердің қандай байланысына қатысады?",
            "answers": [
                "Қоректік тізбегіне",
                "Ауа алмасуына",
                "Жердің жылуына",
                "Су температурасын өзгертуге"
            ]
        },
        {
            "question": "Шаянтәрізділердің кейбір түрлері қалай пайдаланылады?",
            "answers": [
                "Дәрі ретінде",
                "Жоғары сапалы тағам ретінде",
                "Киім жасау үшін",
                "Құрылыс материалы ретінде"
            ]
        },
        {
            "question": "Мәтіндегі «50 000-ға жуық» тіркесіндегі болжалдық сан есімнің жасалу жолын анықтаңыз.",
            "answers": [
                "Сан есім + көптік жалғау",
                "Сан есім + жуық сөзі",
                "Сан есім + -дай/-дей жұрнағы",
                "Сан есім + -дап/-деп жұрнағы"
            ]
        },
        {
            "question": "Мәтіндегі «20 келі» тіркесін болжалдық сан есімге айналдырғанда қай нұсқа дұрыс болады?",
            "answers": [
                "20 келілер",
                "20 келідей",
                "20 келіде",
                "20 келіге"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) Буынаяқтыларға
        2.	б) 50 000-ға жуық
        3.	в) 20 келі
        4.	а) Қоректік тізбегіне
        5.	ә) Жоғары сапалы тағам ретінде
        6.	ә) Сан есім + жуық сөзі
        7.	ә) 20 келідей
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-7_Сағат-тілі.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        Мен Қарағанды облысы бойынша ____________________ жұмыс істеймін. Мекемеде _________________ лауазымын атқарамын. Бізде жұмыс уақыты күн сайын ______________ кешкі _____________ созылады. Түскі үзіліс _________ дейін болады. Біз түсте ____________ демаламыз. Біз __________ жұмыс істейміз. Сенбі, _________ ресми түрде _____________ күндері болып есептеледі.
    `),
    listeningAnswer: dedent(`
        Мен Қарағанды облысы бойынша Статистика департаментінде жұмыс істеймін. Мекемеде бөлім бастығы лауазымын атқарамын. Бізде жұмыс уақыты күн сайын тоғыздан бастап кешкі алтыға дейін созылады. Түскі үзіліс екіге дейін болады. Біз түсте бір сағат демаламыз. Біз бес күн жұмыс істейміз. Сенбі, жексенбі ресми түрде демалыс күндері болып есептеледі.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Статистика департаментінде жұмыс уақыты нешеден нешеге дейін?
        2.	Қызметкерлер түсте қанша уақыт демалады?
        3.	Мекемеде сенбі мен жексенбі қандай күндер болып есептеледі?
        4.	Шаянтәрізділер қандай жануарлар тобына жатады?
        5.	Шаянтәрізділердің ұсақ түрлері не үшін маңызды?
        6.	Болжалдық сан есім заттар мен құбылыстардың санын қалай көрсетеді?
        7.	Болжалдық сан есім қандай сұрақтарға жауап береді?
    `),
    speakingAnswer: dedent(`
        1.	Жұмыс уақыты таңғы тоғыздан кешкі алтыға дейін.
        2.	Қызметкерлер түсте бір сағат демалады.
        3.	Сенбі мен жексенбі демалыс күндері болып есептеледі.
        4.	Шаянтәрізділер буынаяқтылардың бір тобына жатады.
        5.	Шаянтәрізділердің ұсақ түрлері судағы организмдердің қоректік тізбегінде маңызды.
        6.	Заттар мен құбылыстардың санын дәл көрсетпей, шамамен көрсетеді. 
        7.	Қанша? Неше? Қай шамалы? Қаншадай? Нешеге жуық? сұрақтарына жауап береді. 
    `)
};
