import { Topic } from "..";
import dedent from 'dedent';

export const A2_7_TOPIC: Topic = {
    title: {
        kk: "САҒАТ ТІЛІ",
        ru: "СТРЕЛКИ ЧАСОВ",
        en: "CLOCK HANDS"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    жарым
                    кеткенде
                    сағат
                    алдымен
                    арнайы
                    аяқталу
                    әрине
                    байланыс
                    бастау
                    тура
                    уақыт
                    жұмыстан тыс уақыт
                    таңертеңгі
                    түскі
                    күндізгі
                    кешкі
                    түнгі
                    ғасыр
                    тәулік
                    күн сайын

                    ГРАММАТИКА.
                    БОЛЖАЛДЫҚ САН ЕСІМ.

                    Болжалдық сан есімдер заттар мен құбылыстардың санын дәл көрсетпей, шамамен болжап көрсетеді де қанша? неше? Қай шамалы? Қаншадай? Нешеге жуық? Сұрақтарына жауап береді. 
                    Жасалу жолдары: 
                    1.	Сан есім + шамалы/жуық/таман/шақты/тарта/таяу. Мысалы: Мен сағат алтыға таман келемін.
                    2.	Сан есім + -таған/-теген, -даған/-деген. 
                    3.	Сан есім + -дап/-деп, -тап/-теп. Мысалы: ғаламторда апта сайын мыңдап қазақ тілді сайттар жасалады.
                    4.	Сан есім + -дай/-дей, -тай/-тей. Мысалы: Университетте төрт мыңдай студент оқиды.
                    5.	Сан есім + көптік жалғау. Мысалы: Алматтың жасы отыздарға келіп қалды.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    жарым	половина
                    кеткенде	когда уйдет
                    сағат	часы, час
                    алдымен	в начале, сначала
                    арнайы	специальный
                    аяқталу	заканчиваться
                    әрине	конечно, безусловно
                    байланыс	связь
                    бастау	начать, начинать
                    тура	ровно
                    уақыт	время
                    жұмыстан тыс уақыт	вне рабочее время
                    таңертеңгі	утрений/ая/ое
                    түскі	обеденный/ая/ое
                    күндізгі	дневной/ая/ое
                    кешкі	вечерний/ая/ое
                    түнгі	ночной/ая/ое
                    ғасыр	век
                    тәулік	сутки
                    күн сайын	ежедневно

                    ГРАММАТИКА. 
                    БОЛЖАЛДЫҚ САН ЕСІМ. ПРИБЛИЗИТЕЛЬНЫЕ ЧИСЛИТЕЛЬНЫЕ.

                    ПРИБЛИЗИТЕЛЬНЫЕ ЧИСЛИТЕЛЬНЫЕ обозначают количество предметов или явлений не точно, а приблизительно и отвечают на вопросы: сколько? примерно сколько? около скольких? приблизительно сколько?
                    Способы образования:
                    1. Числительное + шамалы / жуық / таман / шақты / тарта / таяу
                    Например:
                    Мен сағат алтыға таман келемін. — Я приду примерно в шесть часов.
                    2. Числительное + -таған/-теген, -даған/-деген
                    3. Числительное + -дап/-деп, -тап/-теп
                    Например:
                    Ғаламторда апта сайын мыңдап қазақ тілді сайттар жасалады. — Каждую неделю в интернете создаются тысячи казахскоязычных сайтов.
                    4. Числительное + -дай/-дей, -тай/-тей
                    Например:
                    Университетте төрт мыңдай студент оқиды. — В университете учится около четырёх тысяч студентов.
                    5. Числительное + окончание множественного числа
                    Например:
                    Алматтың жасы отыздарға келіп қалды. — Алмату уже около тридцати лет.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    жарым	half
                    кеткенде	when he/she leaves
                    сағат	hour, clock
                    алдымен	first, at first
                    арнайы	special
                    аяқталу	to end, ending
                    әрине	of course, certainly
                    байланыс	connection
                    бастау	to start, to begin
                    тура	exactly
                    уақыт	time
                    жұмыстан тыс уақыт	outside working hours
                    таңертеңгі	morning
                    түскі	lunchtime, noon
                    күндізгі	daytime
                    кешкі	evening
                    түнгі	night
                    ғасыр	century
                    тәулік	24 hours, day
                    күн сайын	every day

                    ГРАММАТИКА. GRAMMAR. 
                    БОЛЖАЛДЫҚ САН ЕСІМ. APPROXIMATE NUMERALS.

                    Predictive numerals do not accurately reflect the number of objects and phenomena, but approximate how many? how many? Which insignificant? How much? About how many? He answers his questions. 
                    Ways of creation: 
                    1.numeral + slight/approximate/Taman/tense/tart/near. For example: I arrive around six o'clock.
                    2.the numeral is + -Tagan/-tegen, -Dagan/ -. 
                    3.numeral + -DAP/-DAP, -tap/-TEP. For example: thousands of Kazakh-language sites are created on the internet every week.
                    4.numeral + -Dai/-Dei, -Tai/-Tei. For example: about four thousand students study at the University.
                    5.numeral + plural. For example: Almaty is already in its thirties.
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                Мен күн сайын сағат жетілердей шамасында оянамын. Таңғы асымды сағат сегізге шамасында ішемін. Сағат тоғыздарда жұмысқа барамын. Жолға отыздай минуттар кетеді. Жұмысым сағат тоғызда басталады. Түскі асымды сағат он екі ішемін. Түскі үзіліс бірлер сағаттай болады. Сағат алтыға шақты жұмыстан шығамын. Үйге жеті шамаласында келемін. Сағат сегіз қарай кешкі ас ішемін. Сағат он бірдей шамасында ұйықтаймын.
            `),
    reading: dedent(`
                <b>Шаянтәрізділер</b>

                Шаянтәрізділер буынаяқтылардың үлкен бір тобын құрайды. Олар көбінесе теңіз шаяндары, омарлар, су шаяндары, аяшаяндар, крил және ұлулар секілді әйгілі жануарлар түрін қамтиды. Олардың 50 000-ға жуық түрі әртүрлі көлемдерімен ерекшеленеді. Денесінің ұзындығы 0,1 мм-ге жететін ең ұсақ түрінен бастап, құлашы 4 м-ге, ал дене салмағы 20 келі тартатын жапон шаяны секілді түрлері бар. Басқа буынаяқтылар секілді шаянтәрізділердің де сыртқы қаңқалары болады.
                Шаянтәрізділердің ұсақ түрлері негізгі зоопланктан массасын құрайтын болғандықтан, олар судағы организмдердің қоректік тізбегінде буын болып табылады. Шаянтәрізділер майшабақтардың қорегі, суды өлекселерден  тазартады. Көпшілік түрлері (омар, лангуста, креветкалар, т.б.) дүниежүзінің көптеген елдерінде жоғарғы сапалы тағам ретінде пайдаланылады.
            `),
    readingTest: [
        {
            "question": "Шаянтәрізділер қандай жануарлар тобына жатады?",
            "answers": [
                "Сүтқоректілерге",
                "Буынаяқтыларға",
                "Құстарға",
                "Балықтарға"
            ]
        },
        {
            "question": "Шаянтәрізділердің қаншаға жуық түрі бар?",
            "answers": [
                "5 000-ға жуық",
                "10 000-ға жуық",
                "50 000-ға жуық",
                "100 000-ға жуық"
            ]
        },
        {
            "question": "Жапон шаянының дене салмағы қанша келіге дейін жетеді?",
            "answers": [
                "5 келі",
                "10 келі",
                "15 келі",
                "20 келі"
            ]
        },
        {
            "question": "Шаянтәрізділер судағы организмдердің қандай байланысына қатысады?",
            "answers": [
                "Қоректік тізбегіне",
                "Ауа алмасуына",
                "Жердің жылуына",
                "Су температурасын өзгертуге"
            ]
        },
        {
            "question": "Шаянтәрізділердің кейбір түрлері қалай пайдаланылады?",
            "answers": [
                "Дәрі ретінде",
                "Жоғары сапалы тағам ретінде",
                "Киім жасау үшін",
                "Құрылыс материалы ретінде"
            ]
        },
        {
            "question": "Мәтіндегі «50 000-ға жуық» тіркесіндегі болжалдық сан есімнің жасалу жолын анықтаңыз.",
            "answers": [
                "Сан есім + көптік жалғау",
                "Сан есім + жуық сөзі",
                "Сан есім + -дай/-дей жұрнағы",
                "Сан есім + -дап/-деп жұрнағы"
            ]
        },
        {
            "question": "Мәтіндегі «20 келі» тіркесін болжалдық сан есімге айналдырғанда қай нұсқа дұрыс болады?",
            "answers": [
                "20 келілер",
                "20 келідей",
                "20 келіде",
                "20 келіге"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-7_Сағат-тілі.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                Мен Қарағанды облысы бойынша ____________________ жұмыс істеймін. Мекемеде _________________ лауазымын атқарамын. Бізде жұмыс уақыты күн сайын ______________ кешкі _____________ созылады. Түскі үзіліс _________ дейін болады. Біз түсте ____________ демаламыз. Біз __________ жұмыс істейміз. Сенбі, _________ ресми түрде _____________ күндері болып есептеледі.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Статистика департаментінде жұмыс уақыты нешеден нешеге дейін?
                2.	Қызметкерлер түсте қанша уақыт демалады?
                3.	Мекемеде сенбі мен жексенбі қандай күндер болып есептеледі?
                4.	Шаянтәрізділер қандай жануарлар тобына жатады?
                5.	Шаянтәрізділердің ұсақ түрлері не үшін маңызды?
                6.	Болжалдық сан есім заттар мен құбылыстардың санын қалай көрсетеді?
                7.	Болжалдық сан есім қандай сұрақтарға жауап береді?
            `)
};
