import { Topic } from "..";
import dedent from 'dedent';

export const A2_8_TOPIC: Topic = {
    title: {
        kk: "МЕРЕКЕ",
        ru: "ПРАЗДНИК",
        en: "HOLIDAY"
    },
    description: {
        kk: "src/assets/document/a2/ru/8-сабақ. A2. Мереке (каз-рус).docx",
        ru: "src/assets/document/a2/ru/8-сабақ. A2. Мереке (каз-рус).docx",
        en: "src/assets/document/a2/en/8-сабақ. A2. Мереке (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Мерекеге ______ келді? (кім / не)
        2.	Сен туған күнге ______ дайындадың? (не / кім)
        3.	Мереке ______ өтеді? (қайда / кім)
        4.	Наурыз мерекесі ______ болады? (қашан / кім)
        5.	Мерекеге ______ адам қатысты? (неше / қандай)
        6.	Сен ______ мерекені ұнатасың? (қандай / кім)
        7.	Досың мерекеге ______ келді? (неге / неше)
    `),
    writingAnswer: dedent(`
        1.	Мерекеге кім келді? 
        2.	Сен туған күнге не дайындадың? 
        3.	Мереке қайда өтеді? 
        4.	Наурыз мерекесі қашан болады? 
        5.	Мерекеге неше адам қатысты? 
        6.	Сен қандай мерекені ұнатасың? 
        7.	Досың мерекеге неге келді? 
    `),
    reading: dedent(`
        <b>Наурыз мерекесі</b>

        Наурыз – қазақ халқының ұлттық мерекесі. Наурыз мерекесі 22 наурызда тойланады. Бұл күні адамдар бір-бірін құттықтайды. Отбасылар дастарқан дайындайды. Дастарқанда ұлттық тағамдар болады. Көп жерде наурызкөже дайындалады.
        Мереке кезінде адамдар ән айтады, би билейді және ұлттық ойындар ойнайды. Кейбір адамдар ұлттық киім киеді. Балалар мерекелік ойындарға қатысады. Адамдар бір-біріне жақсы тілектер айтады. Наурыз – адамдарға қуаныш пен жақсы көңіл күй сыйлайтын мереке.
    `),
    readingTest: [
        {
            "question": "Наурыз қандай мереке?",
            "answers": [
                "Халықаралық мереке",
                "Ұлттық мереке",
                "Спорттық мереке",
                "Отбасылық мереке"
            ]
        },
        {
            "question": "Наурыз мерекесі қашан тойланады?",
            "answers": [
                "1 қаңтарда",
                "8 наурызда",
                "22 наурызда",
                "1 мамырда"
            ]
        },
        {
            "question": "Наурыз мерекесінде қандай тағам дайындалады?",
            "answers": [
                "Бауырсақ",
                "Палау",
                "Қуырдақ",
                "Наурызкөже"
            ]
        },
        {
            "question": "Мереке кезінде адамдар не істейді?",
            "answers": [
                "Ән айтады, би билейді және ұлттық ойындар ойнайды.",
                "Жұмысқа барады және сабақ оқиды.",
                "Спортпен айналысады және кітап оқиды.",
                "Үйде ұйықтайды және демалады."
            ]
        },
        {
            "question": "Наурыз адамдарға не сыйлайды?",
            "answers": [
                "Жаңа киім",
                "Сыйлық",
                "Қуаныш пен жақсы көңіл күй",
                "Ұлттық тағам"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	ә) Ұлттық мереке
        2.	б) 22 наурызда
        3.	в) Наурызкөже
        4.	а) Ән айтады, би билейді және ұлттық ойындар ойнайды.
        5.	б) Қуаныш пен жақсы көңіл күй
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-8_Мереке.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Айгүлдің туған күні __________ күні болады.
        2.	Ол туған күнін __________ өткізеді.
        3.	Туған күніне оның __________ мен туыстары келеді.
        4.	Айгүл анасына __________ дайындауға көмектеседі.
        5.	Достары Айгүлге __________ береді.
        6.	Олар бірге тамақ ішіп, __________ айтады.
        7.	Айгүлдің туған күні __________ өтеді.
    `),
    listeningAnswer: dedent(`
        1.	Айгүлдің туған күні сенбі күні болады.
        2.	Ол туған күнін үйінде өткізеді.
        3.	Туған күніне оның достары мен туыстары келеді.
        4.	Айгүл анасына дастарқан дайындауға көмектеседі.
        5.	Достары Айгүлге сыйлық береді.
        6.	Олар бірге тамақ ішіп, ән айтады.
        7.	Айгүлдің туған күні көңілді өтеді.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Айгүлдің туған күні қай күні болады?
        2.	Айгүл туған күнін қайда өткізеді?
        3.	Наурыз мерекесі қашан тойланады?
        4.	Наурыз мерекесінде қандай тағам дайындалады?
        5.	Айгүлдің туған күніне кімдер келеді?
        6.	Сұрау есімдігі дегеніміз не? 
        7.	Сұрау есімдіктеріне қандай сөздер жатады?
    `),
    speakingAnswer: dedent(`
        1.	Айгүлдің туған күні сенбі күні болады.
        2.	Айгүл туған күнін үйінде өткізеді.
        3.	Наурыз мерекесі 22 наурызда тойланады.
        4.	Наурыз мерекесінде наурызкөже дайындалады.
        5.	Айгүлдің туған күніне достары мен туыстары келеді.
        6.	Сұрау есімдігі заттың, адамның, мекеннің, уақыттың, санның, сапаның белгісін сұрау үшін қолданылатын сөздер. 
        7.	Кім? Не? Қай? Қандай? Қашан? Қайда? Неге? Қанша? Неше? сөздері жатады.  
    `)
};
