import { Topic } from "..";
import dedent from 'dedent';

export const A2_8_TOPIC: Topic = {
    title: {
        kk: "МЕРЕКЕ",
        ru: "ПРАЗДНИК",
        en: "HOLIDAY"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    мереке
                    мейрам
                    туған күн
                    Наурыз
                    мерекелік кеш
                    сыйлық
                    қонақ
                    шақыру
                    құттықтау
                    дастарқан
                    ұлттық тағам
                    ән айту
                    би билеу
                    ойын
                    безендіру
                    өткізу
                    қатысу
                    көңілді
                    мерекелік
                    дәстүр

                    ГРАММАТИКА.
                    СҰРАУ ЕСІМДІГІ.

                    Сұрау есімдігі – заттың, адамның, мекеннің, уақыттың, санның, сапаның белгісін сұрау үшін қолданылатын сөздер. Мына сұрау есімдіктері жиі қолданылады: кім? не? қай? қандай? қашан? қайда? неге? қанша? неше? 
                    Негізгі сұрау есімдіктері:
                    Сұрау есімдігі	Мысал
                    Кім?	Мерекеге кім келді?
                    Не?	Сен мерекеге не дайындадың?
                    Қай?	Қай мереке саған ұнайды?
                    Қандай?	Бұл қандай мереке?
                    Қашан?	Мереке қашан болады?
                    Қайда?	Мереке қайда өтеді?
                    Неге?	Сен мерекеге неге келдің?
                    Неше?	Мерекеге неше адам келді?
                    Қанша?	Үстелде қанша тағам бар?
                    Есте сақтаңыз!
                    Кім? → адам туралы сұраймыз. Мерекеге кім келді? – Досым келді.
                    Не? → зат немесе іс туралы сұраймыз. Сен не сатып алдың? – Сыйлық сатып алдым.
                    Қашан? → уақыт туралы сұраймыз. Наурыз қашан болады? – 22 наурызда болады.
                    Қайда? → орын туралы сұраймыз. Мереке қайда өтеді? – Мәдениет үйінде өтеді.
                    Қандай? → заттың сапасын сұраймыз. Қандай сыйлық алдың? – Әдемі сыйлық алдым.
                    Неше? / Қанша? → санын сұраймыз. Мерекеге неше адам келді? – Жиырма адам келді.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    мереке	праздник
                    мейрам	прздник
                    туған күн	день рождения
                    Наурыз	наураз 
                    мерекелік кеш	праздничный вечер
                    сыйлық	подарок
                    қонақ	гости
                    шақыру	приглашение
                    құттықтау	поздравлять 
                    дастарқан	дастархан
                    ұлттық тағам	национальное блюдо 
                    ән айту	петь 
                    би билеу	танцевать 
                    ойын	игра
                    безендіру	украшать 
                    өткізу	проводить 
                    қатысу	участвовать 
                    көңілді	веселый 
                    мерекелік	праздничный 
                    дәстүр	традиция

                    ГРАММАТИКА. 
                    СҰРАУ ЕСІМДІГІ. 
                    ВОПРОСИТЕЛЬНЫЕ МЕСТОИМЕНИЯ.

                    Вопросительные местоимения — это слова, которые используются для того, чтобы спросить о предмете, человеке, месте, времени, количестве или качестве.
                    Часто используются следующие вопросительные местоимения: кім? не? қай? қандай? қашан? қайда? неге? қанша? неше?
                    Основные вопросительные местоимения:
                    Вопросительные местоимения	Пример 
                    Кто?	Кто пришёл на праздник?
                    Что?	Что ты приготовил (а) на праздник?
                    Какой? Который?	Что ты приготовил(а) к празднику?
                    Какой? Какого рода?	Какой праздник тебе нравится?
                    Когда?	Когда будет праздник?
                    Қуда?	Где проходит праздник?
                    Почему?	Почему ты пришёл(а) на праздник?
                    Сколько?	Сколько человек пришло на праздник?
                    Сколько?	Сколько блюд на столе?
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	English
                    мереке	holiday
                    мейрам	celebration
                    туған күн	birthday
                    Наурыз	Nauryz
                    мерекелік кеш	festive evening
                    сыйлық	gift
                    қонақ	guest
                    шақыру	invitation
                    құттықтау	congratulate
                    дастарқан	table
                    ұлттық тағам	national dish
                    ән айту	sing
                    би билеу	dance
                    ойын	game
                    безендіру	decorate
                    өткізу	hold / celebrate
                    қатысу	participate
                    көңілді	cheerful
                    мерекелік festive
                    дәстүр tradition

                    ГРАММАТИКА. GRAMMAR
                    СҰРАУ ЕСІМДІГІ. INTERROGATIVE PRONOUNS

                    Interrogative pronouns are words used to ask about a thing, person, place, time, number, or quality.
                    The following interrogative pronouns are commonly used: кім? не? қай? қандай? қашан? қайда? неге? қанша? неше?
                    Main interrogative pronouns:

                    Interrogative pronoun	English	Example
                    Кім?	Who ? 	Who came to the celebration?
                    Не?	What ? 	What did you prepare for the celebration?
                    Қай?	Which?	Which celebration do you like?
                    Қандай?	What kind of? What ?	What kind of celebration is this?
                    Қашан?	When ?	When will the celebration take place?
                    Қайда?	Where? 	Where will the celebration take place?
                    Неге?	Why? 	Why did you come to the celebration?
                    Неше?	How many? 	How many people came to the celebration?
                    Қанша?	How many? 	How many dishes are on the table?
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                1.	Мерекеге не келді?
                2.	Наурыз кім болады?
                3.	Мереке қашан өтеді?
                4.	Сен мерекеге қашан сыйлық алдың?
                5.	Мерекеге қайда адам келді?
                6.	Бұл қайда мереке?
                7.	Сен мерекеге қайда келдің?
            `),
    reading: dedent(`
                <b>Наурыз мерекесі</b>

                Наурыз – қазақ халқының ұлттық мерекесі. Наурыз мерекесі 22 наурызда тойланады. Бұл күні адамдар бір-бірін құттықтайды. Отбасылар дастарқан дайындайды. Дастарқанда ұлттық тағамдар болады. Көп жерде наурызкөже дайындалады.
                Мереке кезінде адамдар ән айтады, би билейді және ұлттық ойындар ойнайды. Кейбір адамдар ұлттық киім киеді. Балалар мерекелік ойындарға қатысады. Адамдар бір-біріне жақсы тілектер айтады. Наурыз – адамдарға қуаныш пен жақсы көңіл күй сыйлайтын мереке.
            `),
    readingTest: [
        {
            "question": "Наурыз қандай мереке?",
            "answers": [
                "Халықаралық мереке",
                "Ұлттық мереке",
                "Спорттық мереке",
                "Отбасылық мереке"
            ]
        },
        {
            "question": "Наурыз мерекесі қашан тойланады?",
            "answers": [
                "1 қаңтарда",
                "8 наурызда",
                "22 наурызда",
                "1 мамырда"
            ]
        },
        {
            "question": "Наурыз мерекесінде қандай тағам дайындалады?",
            "answers": [
                "Бауырсақ",
                "Палау",
                "Қуырдақ",
                "Наурызкөже"
            ]
        },
        {
            "question": "Мереке кезінде адамдар не істейді?",
            "answers": [
                "Ән айтады, би билейді және ұлттық ойындар ойнайды.",
                "Жұмысқа барады және сабақ оқиды.",
                "Спортпен айналысады және кітап оқиды.",
                "Үйде ұйықтайды және демалады."
            ]
        },
        {
            "question": "Наурыз адамдарға не сыйлайды?",
            "answers": [
                "Жаңа киім",
                "Сыйлық",
                "Қуаныш пен жақсы көңіл күй",
                "Ұлттық тағам"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-8_Мереке.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                1.	Айгүлдің туған күні __________ күні болады.
                2.	Ол туған күнін __________ өткізеді.
                3.	Туған күніне оның __________ мен туыстары келеді.
                4.	Айгүл анасына __________ дайындауға көмектеседі.
                5.	Достары Айгүлге __________ береді.
                6.	Олар бірге тамақ ішіп, __________ айтады.
                7.	Айгүлдің туған күні __________ өтеді.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Айгүлдің туған күні қай күні болады?
                2.	Айгүл туған күнін қайда өткізеді?
                3.	Наурыз мерекесі қашан тойланады?
                4.	Наурыз мерекесінде қандай тағам дайындалады?
                5.	Айгүлдің туған күніне кімдер келеді?
                6.	Сұрау есімдігі дегеніміз не? 
                7.	Сұрау есімдіктеріне қандай сөздер жатады?
            `)
};
