import { Topic } from "..";
import dedent from 'dedent';

export const A2_9_TOPIC: Topic = {
    title: {
        kk: "КӨЛІК",
        ru: "ТРАНСПОРТ",
        en: "TRANSPORT"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    көлік
                    автобус
                    пойыз
                    ұшақ
                    метро
                    такси
                    велосипед
                    көлік жүргізушісі
                    жолаушы
                    аялдама
                    жол
                    бағдаршам
                    билет
                    жүру
                    міну
                    түсу
                    жету
                    кешігу
                    жылдам
                    қауіпсіз

                    ГРАММАТИКА.
                    КӨМЕКТЕС СЕПТІК.

                    Көмектес септік қимылдың кіммен бірге немесе қандай құралмен орындалғанын білдіреді. 
                    Сұрақтары: Кіммен? Немен?
                    Жалғаулары: -мен; -бен; -пен
                    Жалғаулардың қолданылуы:
                    -мен – дауысты дыбысқа немесе й, р, л, у дыбыстарына аяқталған сөздерден кейін жалғанады.
                        Мысалы: әкемен; анамен; Айгүлмен
                    -бен – м, н, ң дыбыстарынан кейін жалғанады	Мысалы: досыммен; адаммен
                    -пен – қатаң дауыссыздарға аяқталған сөздерден кейін жалғанады	Мысалы: автобуспен; пойызбен; велосипедпен; көлікпен

                    Мысалдар:
                    Мен автобуспен жұмысқа барамын.
                    Ол пойызбен Алматыға кетті.
                    Біз ұшақпен Астанаға ұштық.
                    Айгүл досымен саябаққа барды.
                    Мен велосипедпен дүкенге бардым.
                    Әкем көлікпен жұмысына келеді.
                    Біз таксимен үйге қайттық.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақша	русский
                    көлік	транспорт
                    автобус	автобус
                    пойыз	поезд
                    ұшақ	самолёт
                    метро	метро
                    такси	такси
                    велосипед	велосипед
                    көлік жүргізушісі	водитель
                    жолаушы	пассажир
                    аялдама	остановка
                    жол	дорога
                    бағдаршам	светофор
                    билет	билет
                    жүру	ехать
                    міну	садиться в транспорт
                    түсу	выходить из транспорта
                    жету	добраться
                    кешігу	опаздывать
                    жылдам	быстро
                    қауіпсіз	безопасный

                    ГРАММАТИКА.
                    КӨМЕКТЕС СЕПТІК.
                    ТВОРИТЕЛЬНЫЙ ПАДЕЖ.

                    ТВОРИТЕЛЬНЫЙ ПАДЕЖ
                    Творительный падеж обозначает, с кем вместе или с помощью какого инструмента/средства выполняется действие.
                    Вопросы: С кем? С чем?
                    Окончания: -мен; -бен; -пен
                    Использование окончаний:
                    -мен — присоединяется после слов, оканчивающихся на гласный звук, а также на й, р, л, у.
                    Например: әкемен — с отцом; анамен — с мамой; Айгүлмен — с Айгуль.
                    -бен — присоединяется после слов, оканчивающихся на м, н, ң.
                    Например: досыммен — с моим другом; адаммен — с человеком.
                    -пен — присоединяется после слов, оканчивающихся на глухой согласный.
                    Например: автобуспен — на автобусе; пойызбен — на поезде; велосипедпен — на велосипеде; көлікпен — на машине.
                    Примеры:
                    •	Мен автобуспен жұмысқа барамын. — Я еду на работу на автобусе.
                    •	Ол пойызбен Алматыға кетті. — Он уехал в Алматы на поезде.
                    •	Біз ұшақпен Астанаға ұштық. — Мы полетели в Астану на самолёте.
                    •	Айгүл досымен саябаққа барды. — Айгуль пошла в парк с другом.
                    •	Мен велосипедпен дүкенге бардым. — Я поехал в магазин на велосипеде.
                    •	Әкем көлікпен жұмысына келеді. — Папа приезжает на работу на машине.
                    •	Біз таксимен үйге қайттық. — Мы вернулись домой на такси.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	English
                    көлік	transport
                    автобус	bus
                    пойыз	train
                    ұшақ	airplane
                    метро	metro
                    такси	taxi
                    велосипед	bicycle
                    көлік жүргізушісі	driver
                    жолаушы	passenger
                    аялдама	bus stop
                    жол	road
                    бағдаршам	traffic light
                    билет	ticket
                    жүру	to go
                    міну	to get on
                    түсу	to get off
                    жету	to arrive
                    кешігу	to be late
                    жылдам	fast
                    қауіпсіз	safe

                    ГРАММАТИКА. GRAMMAR. 
                    КӨМЕКТЕС СЕПТІК. INSTRUMENTAL CASE.

                    The Instrumental Case indicates with whom or with what tool/instrument an action is performed.
                    Questions:
                    With whom? With what?
                    Endings:
                    -мен; -бен; -пен
                    Use of the endings:
                    --мен – is added to words ending in a vowel or the sounds й, р, л, у.
                        Example: әкемен; анамен; Айгүлмен
                    - бен – is added after words ending in the sounds м, н, ң.	Example: досыммен; адаммен
                    - -пен – is added after words ending in voiceless consonants.	Example: автобуспен; пойызбен; велосипедпен; көлікпен
                    Examples:
                    •	I go to work by bus. 
                    •	He went to Almaty by train. 
                    •	We flew to Astana by plane. 
                    •	Aigul went to the park with her friend. 
                    •	I went to the store by bicycle. 
                    •	My father comes to work by car. 
                    •	We returned home by taxi.
                `)
    },
    writingTitle: {
        kk: "Сөйлемде жіберілген қатені табыңыз.",
        ru: "Найдите ошибку в предложении.",
        en: "Find the mistake in the sentence."
    },
    writing: dedent(`
                1.	Мен таңертең автобусқа жұмысқа келдім.
                2.	Әкем көлікте жұмыстан үйге қайтты.
                3.	Біз метроға қала орталығына бардық.
                4.	Ағам таксиге жұмысқа барды.
                5.	Жолаушылар пойызға вокзалға келді.
                6.	Мен досым автобусды мектепке бардым.
                7.	Біз ұшаққа Астанаға ұштық.
            `),
    reading: dedent(`
                <b>Қаладағы көлік</b>

                Қазіргі кезде көлік адамдардың күнделікті өмірінде маңызды орын алады. Адамдар жұмысқа, оқуға, дүкенге немесе басқа жерге бару үшін әртүрлі көлік түрлерін пайдаланады. Қалада автобус, такси, жеңіл көлік және метро сияқты қоғамдық және жеке көліктер жиі кездеседі.
                Мен күн сайын жұмысқа автобуспен барамын. Таңертең автобуста адам көп болады, сондықтан кейде бос орын табу қиын. Бірақ автобуспен жүру ыңғайлы әрі арзан. Автобус аялдамаға келгенде, жолаушылар кезекпен мінеді. Кейбір жолаушылар жол ақысын көлік картасымен төлейді.
                Өткен аптада мен жұмысқа таксимен бардым. Себебі таңертең қатты жаңбыр жауып, автобус күтуге уақытым болмады. Такси автобусқа қарағанда қымбат, бірақ қажетті жерге тез жеткізеді. Жүргізушімен қаладағы жол туралы сөйлестім.
                Демалыс күндері отбасыммен қала сыртындағы ауылға көлікпен барамыз. Жолға шығар алдында көліктің жағдайын тексереміз. Жолда қауіпсіздік ережелерін сақтау өте маңызды. Жүргізуші жылдамдықты асырмауы және жол белгілеріне назар аударуы керек.
                Менің ойымша, әр көліктің өз артықшылығы бар. Автобус – арзан, такси – жылдам, ал жеке көлік – ыңғайлы. Сондықтан адамдар өз жағдайына қарай көлік түрін таңдайды.
            `),
    readingTest: [
        {
            "question": "Кейіпкер жұмысқа немен барады?",
            "answers": [
                "Машинамен",
                "Автобуспен",
                "Велосипедпен",
                "Пойызбен"
            ]
        },
        {
            "question": "Кейіпкер кейде немен қайтады?",
            "answers": [
                "Ұшақпен",
                "Таксимен",
                "Автобуспен",
                "Жаяу"
            ]
        },
        {
            "question": "Демалыс күні отбасы немен саяхатқа шығады?",
            "answers": [
                "Велосипедпен",
                "Автобуспен",
                "Пойызбен",
                "Көлікпен"
            ]
        },
        {
            "question": "Ағасы университетке немен барады?",
            "answers": [
                "Машинамен",
                "Таксимен",
                "Велосипедпен",
                "Автобуспен"
            ]
        },
        {
            "question": "Әкесі жұмысқа немен барады?",
            "answers": [
                "Машинамен",
                "Автобуспен",
                "Жаяу",
                "Велосипедпен"
            ]
        },
        {
            "question": "Кейіпкер Астанаға немен барды?",
            "answers": [
                "Ұшақпен",
                "Пойызбен",
                "Автобуспен",
                "Таксимен"
            ]
        },
        {
            "question": "Мәтіндегі көмектес септіктегі сөзді табыңыз.",
            "answers": [
                "Жұмысқа",
                "Демалыс күні",
                "Астанаға",
                "Автобуспен"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/a2/A2-9_Көлік.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
                1.	Айдана күн сайын жұмысқа __________________ барады.
                2.	Ол аялдамаға таңғы сағат __________________ келеді.
                3.	Өткен демалыста олар Алматыға __________________ барды.
                4.	Қонақүйге олар __________________ жетті.
                5.	Қаланың көрікті жерлерін аралау үшін __________________ мінді.
                6.	Айдананың ойынша қоғамдық көлік __________________ әрі __________________.
                7.	Жолаушылар терезеден __________________ тамашалады.
            `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
                1.	Көмектес септік қандай сұрақтарға жауап береді?
                2.	Көмектес септіктің жалғаулары қандай?
                3.	Автобуспен жүрудің қандай пайдасы бар?
                4.	Қоғамдық көлікте қандай ережелерді сақтау керек?
                5.	Қандай көлік түрін жиі пайдаланасың?
                6.	Велосипедпен жүрудің қандай пайдасы бар?
                7.	Қазақстанда қандай қоғамдық көлік түрлері бар?
            `)
};
