import { Topic } from "..";
import dedent from 'dedent';

export const A2_9_TOPIC: Topic = {
    title: {
        kk: "КӨЛІК",
        ru: "ТРАНСПОРТ",
        en: "TRANSPORT"
    },
    description: {
        kk: "src/assets/document/a2/ru/9-сабақ. А2. Көлік (каз-рус).docx",
        ru: "src/assets/document/a2/ru/9-сабақ. А2. Көлік (каз-рус).docx",
        en: "src/assets/document/a2/en/9-сабақ. А2. Көлік (каз-англ).docx"
    },
    writingTitle: {
        kk: "Тиісті сөзбен жалғауды табыңыз.",
        ru: "Подберите подходящее слово и правильное окончание.",
        en: "Find the appropriate word and ending."
    },
    writing: dedent(`
        1.	Мен күнде __________ (автобус) жұмысқа барамын.
        2.	Әкем __________ (көлік) қалаға кетті.
        3.	Біз __________ (ұшақ) Астанаға ұштық.
        4.	Айжан __________ (досы) киноға барды.
        5.	Олар __________ (такси) әуежайға жетті.
        6.	Оқушылар __________ (велосипед) мектепке келді.
        7.	Мен __________ (пойыз) ауылға бардым.
    `),
    writingAnswer: dedent(`
        1.	Мен күнде автобуспен жұмысқа барамын.
        2.	Әкем көлікпен қалаға кетті.
        3.	Біз ұшақпен Астанаға ұштық.
        4.	Айжан досымен киноға барды.
        5.	Олар таксимен әуежайға жетті.
        6.	Оқушылар велосипедпен мектепке келді.
        7.	Мен пойызбен ауылға бардым.
    `),
    reading: dedent(`
        <b>Қаладағы көлік</b>

        Қазіргі кезде көлік адамдардың күнделікті өмірінде маңызды орын алады. Адамдар жұмысқа, оқуға, дүкенге немесе басқа жерге бару үшін әртүрлі көлік түрлерін пайдаланады. Қалада автобус, такси, жеңіл көлік және метро сияқты қоғамдық және жеке көліктер жиі кездеседі.
        Мен күн сайын жұмысқа автобуспен барамын. Таңертең автобуста адам көп болады, сондықтан кейде бос орын табу қиын. Бірақ автобуспен жүру ыңғайлы әрі арзан. Автобус аялдамаға келгенде, жолаушылар кезекпен мінеді. Кейбір жолаушылар жол ақысын көлік картасымен төлейді.
        Өткен аптада мен жұмысқа таксимен бардым. Себебі таңертең қатты жаңбыр жауып, автобус күтуге уақытым болмады. Такси автобусқа қарағанда қымбат, бірақ қажетті жерге тез жеткізеді. Жүргізушімен қаладағы жол туралы сөйлестім.
        Демалыс күндері отбасыммен қала сыртындағы ауылға көлікпен барамыз. Жолға шығар алдында көліктің жағдайын тексереміз. Жолда қауіпсіздік ережелерін сақтау өте маңызды. Жүргізуші жылдамдықты асырмауы және жол белгілеріне назар аударуы керек.
        Менің ойымша, әр көліктің өз артықшылығы бар. Автобус – арзан, такси – жылдам, ал жеке көлік – ыңғайлы. Сондықтан адамдар өз жағдайына қарай көлік түрін таңдайды.
    `),
    readingTest: [
        {
            "question": "Кейіпкер жұмысқа немен барады?",
            "answers": [
                "Машинамен",
                "Автобуспен",
                "Велосипедпен",
                "Пойызбен"
            ]
        },
        {
            "question": "Кейіпкер кейде немен қайтады?",
            "answers": [
                "Ұшақпен",
                "Таксимен",
                "Автобуспен",
                "Жаяу"
            ]
        },
        {
            "question": "Демалыс күні отбасы немен саяхатқа шығады?",
            "answers": [
                "Велосипедпен",
                "Автобуспен",
                "Пойызбен",
                "Көлікпен"
            ]
        },
        {
            "question": "Ағасы университетке немен барады?",
            "answers": [
                "Машинамен",
                "Таксимен",
                "Велосипедпен",
                "Автобуспен"
            ]
        },
        {
            "question": "Әкесі жұмысқа немен барады?",
            "answers": [
                "Машинамен",
                "Автобуспен",
                "Жаяу",
                "Велосипедпен"
            ]
        },
        {
            "question": "Кейіпкер Астанаға немен барды?",
            "answers": [
                "Ұшақпен",
                "Пойызбен",
                "Автобуспен",
                "Таксимен"
            ]
        },
        {
            "question": "Мәтіндегі көмектес септіктегі сөзді табыңыз.",
            "answers": [
                "Жұмысқа",
                "Демалыс күні",
                "Астанаға",
                "Автобуспен"
            ]
        }
    ],
    readingAnswer: dedent(`
        1.	Ә) Автобуспен 
        2.	Ә) Таксимен 
        3.	В) Көлікпен
        4.	Б) Велосипедпен
        5.	A) Машинамен 
        6.	Ә) Пойызбен 
        7.	В) Автобуспен
    `),
    listeningAudioPath: `src/assets/audio/a2/A2-9_Көлік.mp3`,
    listeningTitle: {
        kk: "Сөйлемді толықтырыңыз.",
        ru: "Дополните предложение.",
        en: "Complete the sentence."
    },
    listening: dedent(`
        1.	Айдана күн сайын жұмысқа __________________ барады.
        2.	Ол аялдамаға таңғы сағат __________________ келеді.
        3.	Өткен демалыста олар Алматыға __________________ барды.
        4.	Қонақүйге олар __________________ жетті.
        5.	Қаланың көрікті жерлерін аралау үшін __________________ мінді.
        6.	Айдананың ойынша қоғамдық көлік __________________ әрі __________________.
        7.	Жолаушылар терезеден __________________ тамашалады.
    `),
    listeningAnswer: dedent(`
        1.	Айдана күн сайын жұмысқа автобуспен барады.
        2.	Ол аялдамаға таңғы сағат сегізде келеді.
        3.	Өткен демалыста олар Алматыға пойызбен барды.
        4.	Қонақүйге олар таксимен жетті.
        5.	Қаланың көрікті жерлерін аралау үшін метроға мінді.
        6.	Айдананың ойынша қоғамдық көлік ыңғайлы әрі қауіпсіз.
        7.	Жолаушылар терезеден табиғатты тамашалады.
    `),
    speakingTitle: {
        kk: "Сұраққа жауап беріңіз.",
        ru: "Ответьте на вопросы.",
        en: "Answer the question."
    },
    speaking: dedent(`
        1.	Көмектес септік қандай сұрақтарға жауап береді?
        2.	Көмектес септіктің жалғаулары қандай?
        3.	Автобуспен жүрудің қандай пайдасы бар?
        4.	Қоғамдық көлікте қандай ережелерді сақтау керек?
        5.	Қандай көлік түрін жиі пайдаланасың?
        6.	Велосипедпен жүрудің қандай пайдасы бар?
        7.	Қазақстанда қандай қоғамдық көлік түрлері бар?
    `),
    speakingAnswer: dedent(`
        1.	Көмектес септік кіммен? немен? деген сұрақтарға жауап береді.
        2.	Көмектес септіктің жалғаулары: -мен, -бен, -пен.
        3.	Автобуспен жүру арзан және ыңғайлы. Сонымен қатар, жолдағы көлік санын азайтады.
        4.	Қоғамдық көлікте кезек сақтау, үлкен адамдарға орын беру, қатты сөйлемеу және тазалық сақтау керек.
        5.	Мен автобусты жиі пайдаланамын.
        6.	Велосипедпен жүру денсаулыққа пайдалы және қоршаған ортаны ластамайды.
        7.	Қазақстанда автобус, троллейбус, трамвай, метро және такси сияқты көлік түрлері бар.
    `)
};
