export const TEST = [
    {
        question: "Выберите правильный вариант слов во множественном числе.",
        answers: [
            "мұғалімдер, кітаптар, дәптерлер",
            "мұғалімдар, кітаптер, дәптерлер",
            "мұғалімлер, кітаптер, дәптердер",
            "мұғалімтер, кітаптер, дәптерлер"
        ],
        correctAnswer: 0
    },
    {
        question: "Здравствуйте!",
        answers: [
            "Саламатсыз ба!",
            "Салеметсіз ба!",
            "Сәлеметсиз пе!",
            "Сәлеметсіз бе!"
        ],
        correctAnswer: 3
    },
    {
        question: "Мен ертең жұмысқа ......",
        answers: [
            "барамын",
            "барасың",
            "барады",
            "бардым"
        ],
        correctAnswer: 0
    },
    {
        question: "Ол кітап __________ отыр.",
        answers: [
            "Оқиын",
            "Оқып",
            "Оқыған",
            "Оқу"
        ],
        correctAnswer: 1
    },
    {
        question: "\"Мой друг в школе\"",
        answers: [
            "Менің досым мектепке",
            "Менің досым мектепге",
            "Менің досым мектепте",
            "Менің досым мектептен"
        ],
        correctAnswer: 2
    },
    {
        question: "Выберите правильный вариант вопросительных частиц.",
        answers: [
            "Бұл қызыл қалам ма?",
            "Бұл қарындаш ба?",
            "Бұл сурет па?",
            "Бұл бала ма?"
        ],
        correctAnswer: 0
    },
    {
        question: "Допишите правильный ряд местоимений: Менің, …, Сіздің, Оның.",
        answers: [
            "Сенің",
            "Сіздер",
            "Сендер",
            "Сен"
        ],
        correctAnswer: 0
    },
    {
        question: "Сколько мягких звуков в слове \"Мұғалім\"?",
        answers: [
            "1",
            "3",
            "2",
            "Нет"
        ],
        correctAnswer: 0
    },
    {
        question: "Найдите противоположные слова.",
        answers: [
            "Ата - ана",
            "Жаңа - әдемі",
            "Үлкен - кішкентай",
            "Қап-қара"
        ],
        correctAnswer: 2
    },
    {
        question: "__________ атым Сабина. Мен Астанада тұрамын.",
        answers: [
            "Мен",
            "Менде",
            "Сенің",
            "Менің"
        ],
        correctAnswer: 3
    },
    {
        question: "Найдите глаголы.",
        answers: [
            "Әдемі, сары, ақылды",
            "Мен, сен, сіз",
            "Жазу, тыңдау, айту",
            "Дұрыс, келесі, өтірік"
        ],
        correctAnswer: 2
    },
    {
        question: "\"Он не учитель. Он ученик\"",
        answers: [
            "Ол мұғалім жоқ. Ол оқушы",
            "Ол мұғалім емес. Ол оқушы",
            "Сен мұғалім емессің. Сен оқушысың",
            "Ол оқушы емес. Ол мұғалім"
        ],
        correctAnswer: 1
    },
    {
        question: "На какие вопросы отвечают числительные?",
        answers: [
            "Қалай? Қандай?",
            "Кімнен? Неден?",
            "Қашан? Қайдан?",
            "Қанша? Неше?"
        ],
        correctAnswer: 3
    },
    {
        question: "Переведите: Жүргізуші, өрт сөндіруші, аспаз",
        answers: [
            "пилот, пожарный, столовая",
            "водитель, скорая помощь, повар",
            "водитель, пожарный, повар",
            "телеведущий, пожарный, официант"
        ],
        correctAnswer: 2
    },
    {
        question: "Напишите окончания –нікі/–дікі/–тікі в правильном порядке. Анау қалам Аружан+... Мынау ойыншық Талғат+... Бұл телефон Аида+...",
        answers: [
            "Аружан+тікі, Талғат+дікі, Аида+нікі",
            "Аружан+нікі, Талғат+тікі, Аида+дікі",
            "Аружан+дікі, Талғат+нікі, Аида+тікі",
            "Аружан+дікі, Талғат+тікі, Аида+нікі"
        ],
        correctAnswer: 3
    },
    {
        question: "Переведите: \"Это не первый класс\".",
        answers: [
            "Бұл бірінші сынып емес",
            "Бұл бір сынып емес",
            "Бұл бірінші сынып жоқ",
            "Бұл бір сынып"
        ],
        correctAnswer: 0
    },
    {
        question: "Найдите правильный вариант даты 08.03.",
        answers: [
            "Сегіз наурыз",
            "Сегізінші наурыз",
            "Жетінші наурыз",
            "Жеті наурыз"
        ],
        correctAnswer: 1
    },
    {
        question: "Добавьте окончание 1-лица: Мен достарыммен тауда демала+…",
        answers: [
            "мын",
            "мін",
            "сың",
            "сіз"
        ],
        correctAnswer: 0
    },
    {
        question: "Отрицайте предложение.",
        answers: [
            "Мен ойнамаймын. Сен айтбайсың. Сіз жазбайсыз.",
            "Мен ойнабаймын. Сен айтпайсың. Сіз жазбайсыз.",
            "Мен ойнамаймын. Сен айтмайсың. Сіз жазпайсыз.",
            "Мен ойнамаймын. Сен айтпайсың. Сіз жазбайсыз."
        ],
        correctAnswer: 3
    },
    {
        question: "Добавьте окончание 2-лица: Сен ақылды…",
        answers: [
            "нет",
            "+сен",
            "+сыз",
            "+сың"
        ],
        correctAnswer: 3
    },
    {
        question: "Мы друзья",
        answers: [
            "Біз дос",
            "Біздер достар",
            "Біздің досымыз",
            "Біз досмыз",
            "Біз доспыз"
        ],
        correctAnswer: 4
    },
    {
        question: "Прямо сейчас",
        answers: [
            "Мен тізім жазып жатырмын.",
            "Мен тізім жазып жатқан жоқпын.",
            "Мен тізім жазамын.",
            "Мен тізім жаздым.",
            "Мен тізім жазбадым."
        ],
        correctAnswer: 0
    },
    {
        question: "Я пью чай с сахаром",
        answers: [
            "Мен қантбен шай ішемін",
            "Мен қант және шай ішемін",
            "Мен қантпен шай ішемін",
            "Мен қант шай ішемін",
            "Мен қанттан шай ішемін"
        ],
        correctAnswer: 2
    },
    {
        question: "Время 1:45 прописью",
        answers: [
            "бірден қырық бес минут қалды",
            "екіге он бес минут қалды",
            "бірден қырық бес минут кетті",
            "бір жарым болды",
            "сағат екі қырық бес"
        ],
        correctAnswer: 1
    },
    {
        question: "Прошедшее время",
        answers: [
            "Мен кітапханаға барамын",
            "Мен кітапханадамын",
            "Мен кітапханада бармаймын.",
            "Мен кітапханаға бара жатырмын",
            "Мен кітапханада болдым"
        ],
        correctAnswer: 4
    }
];

export const VARIANT_LABEL = ['А)', 'Ә)', 'Б)', 'В)', 'Г)'];
