export const TEST = [
    {
        question: "Көптік жалғау дұрыс жалғанған қатарды табыңыз.",
        answers: [
            "мұғалімдер, кітаптар, дәптерлер",
            "мұғалімдар, кітаптер, дәптерлер",
            "мұғалімлер, кітаптер, дәптердер",
            "мұғалімтер, кітаптер, дәптерлер"
        ],
        correctAnswer: 0
    },
    {
        question: "Берілген сөзді қазақ тіліне аударыңыз. Здравствуйте! Hello!",
        answers: [
            "Саламатсыз ба!",
            "Салеметсіз бе!",
            "Сәлеметсиз пе!",
            "Сәлеметсіз бе!"
        ],
        correctAnswer: 3
    },
    {
        question: "Мен ертең жұмысқа …",
        answers: [
            "барамын",
            "барасың",
            "барады",
            "бардым"
        ],
        correctAnswer: 0
    },
    {
        question: "Ол кітап … отыр.",
        answers: [
            "оқиын",
            "оқып",
            "оқыған",
            "оқу"
        ],
        correctAnswer: 1
    },
    {
        question: "Берілген сөйлемді қазақ тіліне аударыңыз: «Мой друг в школе». «My friend at school».",
        answers: [
            "Менің досым мектеп-ке",
            "Менің досым мектеп+ге",
            "Менің досым мектеп+те",
            "Менің досым мектеп+тен"
        ],
        correctAnswer: 2
    },
    {
        question: "Есімдіктер қатарын дұрыс толықтырыңыз: Менің, …, Сіздің, Оның.",
        answers: [
            "Сенің",
            "Сіздер",
            "Сендер",
            "Сен"
        ],
        correctAnswer: 0
    },
    {
        question: "«Мұғалім» сөзінде неше жіңішке дауысты дыбыс бар?",
        answers: [
            "1",
            "3",
            "2",
            "Нет"
        ],
        correctAnswer: 0
    },
    {
        question: "Мағыналары қарама-қарсы сөздер қатарын табыңыз.",
        answers: [
            "Ата-ана",
            "Жаңа-әдемі",
            "Үлкен-кішкентай",
            "Қап-қара"
        ],
        correctAnswer: 2
    },
    {
        question: "…. атым Сабина. Мен Астанада тұрамын.",
        answers: [
            "Мен",
            "Менде",
            "Сенің",
            "Менің"
        ],
        correctAnswer: 3
    },
    {
        question: "Етістікті табыңыз.",
        answers: [
            "Әдемі, сары, ақылды",
            "Мен, сен, сіз",
            "Жазу, тыңдау, айту",
            "Дұрыс, келесі, өтірік"
        ],
        correctAnswer: 2
    },
    {
        question: "Сөйдемді қазақшаға аударыңыз. «Он не учитель. Он ученик». «He is not a teacher. He is a student».",
        answers: [
            "Ол мұғалім жоқ. Ол оқушы",
            "Ол мұғалім емес. Ол оқушы",
            "Сен мұғалім емессің. Сен оқушысың",
            "Ол оқушы емес. Ол мұғалім"
        ],
        correctAnswer: 1
    },
    {
        question: "Сан есімдер қандай сұрақтарға жауап береді?",
        answers: [
            "Қалай? Қандай?",
            "Кімнен? Неден?",
            "Қашан? Қайдан?",
            "Қанша? Неше?"
        ],
        correctAnswer: 3
    },
    {
        question: "Аударыңыз: Жүргізуші, өрт сөндіруші, аспаз",
        answers: [
            "пилот, пожарный, столовая",
            "водитель, скорая помощь, повар",
            "водитель, пожарный, повар",
            "телеведущий, пожарный, официант"
        ],
        correctAnswer: 2
    },
    {
        question: "-нікі/-дікі/-тікі жалғауларын дұрыс жалғаңыз. Анау қалам Аружан+… . Мынау ойыншық Талғат+… . Бұл телефон Аида+…",
        answers: [
            "Аружан+тікі, Талғат+дікі, Аида+нікі",
            "Аружан+нікі, Талғат+тікі, Айда+дікі",
            "Аружан+дікі, Талғат+нікі, Айда+тікі",
            "Аружан+дікі, Талғат+тікі, Айда+нікі"
        ],
        correctAnswer: 3
    },
    {
        question: "Сөйлемді қазақ тіліне аударыңыз: «Это не первый класс». «This is not the first grade».",
        answers: [
            "Бұл бірінші сынып емес",
            "Бұл бір сынып емес",
            "Бұл бірінші сынып жоқ",
            "Бұл бір сынып"
        ],
        correctAnswer: 0
    },
    {
        question: "08.03. берілген күннің дұрыс жазылған нұсқасын табыңыз.",
        answers: [
            "Сегіз наурыз",
            "Сегізінші наурыз",
            "Жетінші наурыз",
            "Жеті наурыз"
        ],
        correctAnswer: 1
    },
    {
        question: "1-жақ қосымшасын дұрыс жалғаңыз: Мен достарыммен тауда демала+… .",
        answers: [
            "мын",
            "мін",
            "сың",
            "сіз"
        ],
        correctAnswer: 0
    },
    {
        question: "Болымсыз етістік жұрнағы дұрыс жалғанған қатарды табыңыз.",
        answers: [
            "Мен ойнамаймын. Сен айтбайсың. Сіз жазбайсыз.",
            "Мен ойнабаймын. Сен айтпайсың. Сіз жазбайсыз.",
            "Мен ойнамаймын. Сен айтмайсың. Сіз жазпайсыз.",
            "Мен ойнамаймын. Сен айтпайсың. Сіз жазбайсыз."
        ],
        correctAnswer: 3
    },
    {
        question: "2-жақ қосымшасын дұрыс жалғаңыз: Сен ақылды…",
        answers: [
            "нет",
            "+сен",
            "+сыз",
            "+сың"
        ],
        correctAnswer: 3
    },
    {
        question: "Біз дос…",
        answers: [
            "Біз дос",
            "Біздер достар",
            "Біздің досымыз",
            "Біз досмыз",
            "Біз доспыз"
        ],
        correctAnswer: 4
    },
    {
        question: "Нақ осы шақты табыңыз.",
        answers: [
            "Мен тізім жазып жатырмын.",
            "Мен тізім жазып жатқан жоқпын.",
            "Мен тізім жазып жатырмын.",
            "Мен тізім жазып жатырмын.",
            "Мен тізім жазамын."
        ],
        correctAnswer: 0
    },
    {
        question: "Сөйлемді қазақ тіліне аударыңыз: Я пью чай с сахаром. I drink tea with sugar.",
        answers: [
            "Мен қантбен шай ішемін",
            "Мен қант және шай ішемін",
            "Мен қантпен шай ішемін",
            "Мен қант шай ішемін",
            "Мен қанттан шай ішемін"
        ],
        correctAnswer: 2
    },
    {
        question: "1:45 көрсетілген уақыт жазбаша қалай дұрыс жазылады?",
        answers: [
            "бірден қырық бес минут қалды",
            "екіге он бес минут қалды",
            "бірден қырық бес минут кетті",
            "бір жарым болды",
            "сағат екі қырық бес"
        ],
        correctAnswer: 1
    },
    {
        question: "Өткен шақты табыңыз.",
        answers: [
            "Мен кітапханаға барамын",
            "Мен кітапханадамын",
            "Мен кітапханада бармаймын.",
            "Мен кітапханаға бара жатырмын",
            "Мен кітапханада болдым"
        ],
        correctAnswer: 4
    }
];

export const VARIANT_LABEL = ['А)', 'Ә)', 'Б)', 'В)', 'Г)'];
