import dedent from 'dedent';

export const LISTENING_1_AUDIO = "src/assets/audio/test/Бірінші-тыңдалым.mp3";
export const LISTENING_1_TEST = [
    {
        question: "Қонақтар автобусқа мінетін аялдаманы белгілеңіз.",
        answers: [
            "Орталық стадион",
            "«Керемет» дүкені",
            "С.Мұқанов көшесі",
            "«Алтай» аялдамасы"
        ],
        correctAnswer: 0
    },
    {
        question: "Қонақтарды қай күнге шақырғанын анықтаңыз.",
        answers: [
            "сенбі күнге",
            "жұма күнге",
            "бейсенбі күнге",
            "жексенбі күнге"
        ],
        correctAnswer: 1
    },
    {
        question: "Орталық стадионнан жүретін автобусты табыңыз.",
        answers: [
            "3-ші",
            "9-шы",
            "32-ші",
            "44-ші"
        ],
        correctAnswer: 3
    },
    {
        question: "Қонақ шақырған үй орналасқан көшені көрсетіңіз.",
        answers: [
            "Алтай",
            "Керемет",
            "Стадион",
            "Мұқанов"
        ],
        correctAnswer: 3
    },
    {
        question: "Үй иесі телефон арқылы не үшін хабарласқанын көрсетіңіз.",
        answers: [
            "құттықтауға",
            "қажетін сұрауға",
            "жағдайын білуге",
            "қонаққа шақыруға"
        ],
        correctAnswer: 3
    }
];

export const LISTENING_2_AUDIO = "src/assets/audio/test/Екінші-тыңдалым.mp3";
export const LISTENING_2_TEST = [
    {
        question: "Диалогке сәйкес сөйлемді толықтырыңыз.\n\n... тұзды су іше береді.",
        answers: [
            "Киви",
            "Тырна",
            "Шағала",
            "Қаршыға"
        ],
        correctAnswer: 2
    },
    {
        question: "Әжесінің мамандығын көрсетіңіз.",
        answers: [
            "биолог",
            "педагог",
            "филолог",
            "зерттеуші"
        ],
        correctAnswer: 0
    },
    {
        question: "Сұраққа жауап беріңіз.\n\nКиви қандай құс?",
        answers: [
            "жер бетіндегі ең кішкентай құс",
            "тоғыз апта аш жүре алатын құс",
            "әлемдегі қанаты жоқ жалғыз құс",
            "ең жоғары биікке ұша алатын құс"
        ],
        correctAnswer: 2
    },
    {
        question: "Фламингоның ерекшелігін көрсетіңіз.",
        answers: [
            "бір аяқта тұрып ұйықтайды",
            "бұтаққа қонып еркін демалады",
            "аузына су толтырып жүре алады",
            "оның сүйектерінен қанаттары ауыр"
        ],
        correctAnswer: 0
    },
    {
        question: "Диалогке қатысушылар барған жерді анықтаңыз.",
        answers: [
            "Балалар алаңындағы пингвин",
            "Саябақтағы хайуанаттар бағы",
            "Мектептегі құстар павильоны",
            "Саябақтағы құстар павильоны"
        ],
        correctAnswer: 3
    }
];

export const LISTENING_3_AUDIO = "src/assets/audio/test/Үшінші-тыңдалым.mp3";
export const LISTENING_3_TEST = [
    {
        question: "Ең үлкен гүл Раффлезия Арнольдтың салмағын көрсетіңіз.",
        answers: [
            "он келідей",
            "он келіге тарта",
            "он келіге жуық",
            "он келіден астам"
        ],
        correctAnswer: 3
    },
    {
        question: "Елтаңбалардағы гүл белгісі нені білдіретінін табыңыз.",
        answers: [
            "гүлге деген құрмет",
            "әлемдік гүл екендігі",
            "гүлді сақтауға шақыру",
            "гүлдің пайдасын көрсету"
        ],
        correctAnswer: 0
    },
    {
        question: "Әлемдегі ең қымбат гүлді анықтаңыз.",
        answers: [
            "Малайзиялық алтын орхидея",
            "Раффлезия Арнольд Индонезияда",
            "Оңтүстік Американың тауларында",
            "Германияның Хильдесхайм қаласында"
        ],
        correctAnswer: 0
    },
    {
        question: "Мәтіннің логикалық жалғасын табыңыз.\n\nНидерланды қызғалдақтарымен танымал, ... .",
        answers: [
            "бұл ерекше гүл Оңтүстік Американың тауларында өседі",
            "бірақ олар шыбынмен, құстармен қоректенетін жыртқыш гүл",
            "Иран және басқа да көптеген елдердің елтаңбаларындағы гүлдер",
            "бұл гүлдерді Голландия 16 ғасырда Түркиядан әкелгені айтылған"
        ],
        correctAnswer: 3
    },
    {
        question: "Мәтіннің не туралы екенін анықтаңыз.",
        answers: [
            "Ерекше гүлдердің тарихы",
            "Әлемдегі гүлдердің пайдасы",
            "Гүлдерді баптаудың ерекшелігі",
            "Әртүрлі мемлекеттің елтаңбалары"
        ],
        correctAnswer: 1
    },
    {
        question: "Мәтінге сәйкес сөйлемді жалғастырыңыз.\n\nБіздің білуімізше, ең көне бақтарды...",
        answers: [
            "түріктер танымал еткен",
            "қоңыздар тозаңдандырған",
            "ежелгі мысырлықтар баптаған",
            "бұрынғы адамдар өсіре бастаған"
        ],
        correctAnswer: 2
    },
    {
        question: "Собордың жанындағы раушан бұтасының жасы қаншада екенін анықтаңыз.",
        answers: [
            "ғасырдан асады",
            "жүз елу жылдай",
            "мың жылға таяу",
            "мың жылдан астам"
        ],
        correctAnswer: 3
    },
    {
        question: "Мәтінге сәйкес сөйлемді жалғастырыңыз.\n\nЕң кішкентай гүлдер...",
        answers: [
            "жерден өнеді",
            "тоғандарда өседі",
            "көлдерде шығады",
            "теңіздерде көбейеді"
        ],
        correctAnswer: 1
    },
    {
        question: "Әлемдегі жыртқыш гүлдер немен қоректенетінін көрсетіңіз.",
        answers: [
            "аралармен, құстармен, тышқанмен",
            "тышқанмен, шыбынмен, құстармен",
            "қоңыздармен, құстармен, масалармен",
            "жануарлармен, шыбындармен, арамен"
        ],
        correctAnswer: 1
    },
    {
        question: "Оңтүстік Американың тауларында өсетін гүлдің ерекшелігін көрсетіңіз.",
        answers: [
            "бір ғасыр болғанда гүл ашады",
            "бірнеше ғасырлар бойы гүлдемейді",
            "бір ғасырдан асқан уақытта гүлдейді",
            "бір ғасырдан кейін жер астында өнеді"
        ],
        correctAnswer: 2
    }
];

export const READING_1_TEXT = dedent(`
    <b>1-матін</b>

    Меруерт қалада отбасымен көпқабатты үйде пәтер жалдап тұрады. Пәтері екі бөлмелі және төртінші қабатта орналасқан. Бөлмелерде жаңа жиһаздар бар. Қонақ бөлмеде диван, орындықтар және теледидар тұр. Ас үйде үстел, орындықтар және тоңазытқыш бар.
    Меруерттің әкесі ауылда тұрады. Оның жер үйі бар. Жер үйі үш қабатты, ауласында жеміс ағаштары өсіп тұр. Үйдің іші кең, жылы және жайлы. Әжесінің үйінде үлкен пеш, кілемдер және ағаштан жасалған жиһаздар бар.
    Меруерт аптаның алтыншы, жетінші күндері әжесінің жер үйіне қонаққа барады. Ол әжесіне күндіз көмектесіп, кешке бақшада жүреді. Меруертке әжесінің үйі ұнайды.
`);
export const READING_1_TEST = [
    {
        question: "Меруерттің әжесі қандай үйде тұрады?",
        answers: [
            "пәтерде",
            "жер үйде",
            "қонақүйде",
            "биік үйде"
        ],
        correctAnswer: 1
    },
    {
        question: "Меруерттің пәтері орналасқан қабатты көрсетіңіз.",
        answers: [
            "үшінші",
            "жетінші",
            "төртінші",
            "алтыншы"
        ],
        correctAnswer: 2
    },
    {
        question: "Заттың саны көрсетілген қатарды анықтаңыз.",
        answers: [
            "екі бөлме",
            "демалыс күн",
            "жаңа жиһаздар",
            "көпқабатты үй"
        ],
        correctAnswer: 0
    },
    {
        question: "Асты сызылған сөзге қойылатын сұрақты табыңыз.\n\nМеруерт күндіз әжесіне көмектеседі.",
        answers: [
            "кім?",
            "қалай?",
            "қашан?",
            "қайтіп?"
        ],
        correctAnswer: 2
    },
    {
        question: "Қонақ бөлме мен асүйдегі жиһазды табыңыз.",
        answers: [
            "кілем",
            "орындық",
            "теледидар",
            "тоңазытқыш"
        ],
        correctAnswer: 1
    },
    {
        question: "Қажетті сөзді қойыңыз.\n\nМеруертке жер үй ұнайды, ... кең және ауасы таза.",
        answers: [
            "себебі",
            "алайда",
            "дегенмен",
            "сондықтан"
        ],
        correctAnswer: 0
    }
];

export const READING_2_TEXT = dedent(`
    <b>2-матін</b>

    Жаз айлары – жүріп тұруға ең қолайлы, жайлы, тамаша уақыт. Үлкендердің де, жастардың да демалысқа шығатын кезі. Жаз мезгілі маусым айынан басталады. 
    Бұл кез мал өсіп, тіршіліктің біраз басылған шағы.
    Жаздың ең ыстық айы – шілде. Тамыз айында ыстық, біраз басылады. Бұл мезгілде егін орағы мен бау-бақша өнімдерін жинау басталып, дала тағы да қарбалас шаққа түседі. Бау-бақшалардағы жұмыс қылу жүреді. Тәтті кауын, қызыл шырынды қарбыз анадайдан иісі аңқып, жақындасаң, көздің жауын алады. Қауын, қарбыз, қызанақ тиеген мәшинелер қала мен екі арада тоқтамайды. Құмырсқа қысқа азық жинап, илеуін өсімдік дәндеріне толтырады. Олар жұмыс істеуден шаршамайды. Жем алар жеріне жол салып алған.
    Қырдағы түп кандай әдемі! Сүттей жарық ай сәулесінен барлығы анық көрінеді. Ауылдың шетінде мал мен иттің даусы естіледі. Шегірткенің шырылы да бір тоқтамайды.
`);
export const READING_2_TEST = [
    {
        question: "«Алар» сөзіне мағынасы қарсы сөзді табыңыз.\n\nЖем алар жеріне жол салып алған.",
        answers: [
            "берер",
            "көрер",
            "табар",
            "шашар"
        ],
        correctAnswer: 0
    },
    {
        question: "Асты сызылған сөзге мағыналас сөзді табыңыз.\n\nЖаздың соңына қарай ыстық біршама басылады.",
        answers: [
            "азаяды",
            "күшейеді",
            "көтеріледі",
            "байқалады"
        ],
        correctAnswer: 0
    },
    {
        question: "Мәтінде жауабы жоқ сұрақты табыңыз.",
        answers: [
            "Жаз мезгілі қалай суреттелген?",
            "Тамыз айында ауа райы қандай болады?",
            "Құмырсқалар қысқа қалай дайындалады?",
            "Егін орағы мен өнім жинауға кімдер көмектеседі?"
        ],
        correctAnswer: 3
    },
    {
        question: "Сөйлемнен күшейту мәнді сөзді табыңыз.",
        answers: [
            "Жаздың ең ыстық айы - шілде.",
            "Бау-бақшалардағы жұмыс қызу жүреді.",
            "Шегірткенің шырылы да басылмайды.",
            "Құмырсқа жаз бойы азық жинаумен болады."
        ],
        correctAnswer: 0
    },
    {
        question: "Мәтін не туралы?",
        answers: [
            "Әдемі түн",
            "Егін орағы",
            "Жаз мезгілі",
            "Құмырсқаның илеуі"
        ],
        correctAnswer: 2
    },
    {
        question: "Мәтін мазмұнына сәйкес келмейтін ақпаратты таңдаңыз.",
        answers: [
            "Жаз айлары маусым айынан басталады.",
            "Қауын, қарбыз тиелген көліктер көп жүреді.",
            "Тәтті жеміс-жидектің иісі аңқып, көздің жауын алады.",
            "Қауын, қарбыз артқан көліктер біздің үйдің жанынан өтеді."
        ],
        correctAnswer: 3
    },
    {
        question: "«Жинау» сөзіне мағынасы қарсы сөзді табыңыз.",
        answers: [
            "егу",
            "теру",
            "шашу",
            "өткізу"
        ],
        correctAnswer: 2
    },
    {
        question: "Мәтін мазмұнына сәйкес ақпаратты таңдаңыз.",
        answers: [
            "Жаз мезгілінде тауға жиі шығамыз.",
            "Жазда теңіз ауасымен демалуды жақсы көреміз.",
            "Жазда үлкендер де, жастар да демалысқа шығады.",
            "Біз жаз айларына қарағанда күзде жиі қыдырамыз."
        ],
        correctAnswer: 2
    },
    {
        question: "Мәтінде жауабы бар сұрақты табыңыз.",
        answers: [
            "Жазда егін оратын көліктерді қайдан алдырады?",
            "Тамыз айында ауа райы қандай болады?",
            "Атасының бау-бақшасында қандай жемістер өседі?",
            "Жазда егін оруға, өнім жинауға кімдер көмектеседі?"
        ],
        correctAnswer: 1
    },
    {
        question: "«Нені?» сұрағына сәйкес жауабы бар сөйлемді көрсетіңіз.",
        answers: [
            "Жаздың түні де тұнық, әдемі болады.",
            "Шегірткенің шырылы да бір тынбайды.",
            "Ауылдың шетінде мал мен иттің дауысы естіледі.",
            "Бұл мезгілде егін жинау науқаны басталады."
        ],
        correctAnswer: 3
    }
];

export const READING_3_TEXT = dedent(`
    <b>3-матін</b>

    2015 жылдың 21 желтоқсанында әлемді елең еткізген тарихи оқиға болды. Илон Маск негізін қалаған SpaceX компаниясы зымыранын ғарышқа жіберіп, сәтті қондырды. Әдетте, ғарышқа көтерілген зымыран сау қайтпайды, қайта қолдануға жарамайды. Ал бас-аяғы бүтін, қайтадан қолдануға жарайтын зымыранның жасалуы ғарышқа ұшу шығынын азайтты. Бұл сол жылдың айтулы оқиғасы болды. Марсқа турист жіберуді армандап, бірнеше жыл осы бағытта жұмыс істеген Маск мүмкін емес нәрсені жасады.
    Ол SpaceX, Tesla Motors және SolarCity сияқты айтулы компаниялардың негізін қалады. Сонымен қатар интернет төлем жүйесі PayPal-дың да негізін қалаушылардың бірі болды. Бірнеше жобаны іске асырып, табысқа жеткен Масктің көпшіліктің көкейіне қонатын, Стив Джобспен жақындастыратын қасиеті – өзгеше дүниені армандауы.
    Ғарышқа зымыран жіберу, электр көлігін шығару, күн сәулесі энергиясын жалпыға қолжетімді ету бағытында еңбек етіп жүрген Маск шын мәнінде ерекше кәсіпкер. Оңтүстік Африканың тумасы Илон Маск 17 жасында Канадаға келген. Онтарионың Куинс университетінен бастап, кейін Пенсильванияда оқуын жалғастырған. Университетте туған жобаларына жан бітіру үшін бағдарламашылар мекені Кремний алқабынан бір-ақ шыққан.
    Илон Масктің өзгеше тағдыры туралы еңбек жазылды. Оның авторы – Эшли Ванс. Ол Масктің өміріндегі ерекше уақыттарды егжей-тегжейлі сипаттап, оларды еркін еңсеріп үйренген тұлғаның жүйкесі құрыш, мұраты биік деп санайды.
`);
export const READING_3_TEST = [
    {
        question: "Әлем назарын аударған айтулы оқиғаны көрсетіңіз.",
        answers: [
            "Илон Маск туралы кітаптың жазылуы.",
            "Интернет төлем жүйесі PayPal-дың іске қосылуы.",
            "Tesla Motors компаниясының өнімдерін таныстыру.",
            "SpaceX компаниясы шығарған зымыранның ғарыштан оралуы."
        ],
        correctAnswer: 3
    },
    {
        question: "«Тұтыну» сөзіне мәндес болатын сөздер қатарын белгілеңіз.",
        answers: [
            "жан бітіру, қолдау",
            "жасау, жүзеге асыру",
            "пайдалану, қолдану",
            "еңбектену, жалғастыру"
        ],
        correctAnswer: 2
    },
    {
        question: "Илон Масктің арманын көрсетіңіз.",
        answers: [
            "Канадада оқу орнын ашу",
            "Интернет арқылы төлем жасау",
            "Өзінің өмірі жайында кітап жазу",
            "Басқа ғаламшарға саяхатшы жіберу"
        ],
        correctAnswer: 3
    },
    {
        question: "Мәтінге сәйкес келмейтін ақпаратты көрсетіңіз.",
        answers: [
            "Маск Джобспен дос әрі әріптес болған.",
            "Пенсильванияда білімін жалғастырған.",
            "Tesla Motors компаниясының негізін қалаған.",
            "Илон Маск Оңтүстік Африкада дүниеге келген."
        ],
        correctAnswer: 0
    },
    {
        question: "Мақсат мәнді сөйлемді табыңыз.",
        answers: [
            "Қайтадан қолдануға жарайтын зымыран ғарышқа ұшу шығынын азайтты.",
            "Ол білімін Куинс университетінен бастап, Пенсильванияда жалғастырған.",
            "Кітапта Масктің өміріндегі ерекше уақыты егжей-тегжейлі сипатталады.",
            "Илон Маск өзінің жобаларына жан бітіру үшін Кремний алқабына барады."
        ],
        correctAnswer: 3
    },
    {
        question: "Мәтінде жауабы жоқ сұрақты табыңыз.",
        answers: [
            "Илон Маск қандай бағыттарда еңбектеніп жүр?",
            "SpaceX компаниясы зымырандарының ерекшелігі неде?",
            "Илон Маск Кремний алқабына қандай мақсатпен барды?",
            "Илон Масктің өзгеше тағдыры туралы еңбек жазылды ма?"
        ],
        correctAnswer: 1
    },
    {
        question: "Орындаушысы көрсетілмеген әрекет бар сөйлемді белгілеңіз.",
        answers: [
            "Илон Масктің өзгеше тағдыры туралы еңбек жазылды.",
            "Илон Марсқа турист жіберуді армандап, осы бағытта жұмыс істеді.",
            "Кітап авторы Маскті жүйкесі құрыш, мұраты биік адам деп санайды.",
            "Оңтүстік Африканың тумасы Илон Маск 17 жасында Канадаға келді."
        ],
        correctAnswer: 0
    },
    {
        question: "Эшли Вэнстің кім екенін анықтаңыз.",
        answers: [
            "Масктің әріптесі",
            "Кітаптың авторы",
            "Университет оқытушысы",
            "Кремний алқабында бағдарламашы"
        ],
        correctAnswer: 1
    },
    {
        question: "«Айтулы оқиға» сөз тіркесіне мағынасы қарсы тіркесті табыңыз.",
        answers: [
            "қызық оқиға",
            "елеулі оқиға",
            "ерекше оқиға",
            "елеусіз оқиға"
        ],
        correctAnswer: 3
    },
    {
        question: "Илон Маскті Джобспен жақындастыратын қасиетін белгілеңіз.",
        answers: [
            "Бірнеше жобалардың авторы болуы.",
            "Ақылға сыймайтын нәрсені іске асыруы.",
            "Университетте оқып жүргенде жоба жасауы.",
            "Электр қуатын тұтынатын пойыздарды шығаруы."
        ],
        correctAnswer: 1
    },
    {
        question: "Асты сызылған сөзге сұрақ қойыңыз.\n\n«Жақындастыратын қасиет»",
        answers: [
            "Нені?",
            "Қалай?",
            "Қандай?",
            "Не істеді?"
        ],
        correctAnswer: 2
    },
    {
        question: "Илон Масктің Кремний алқабына бару себебін табыңыз.",
        answers: [
            "Сынақ тапсыру",
            "Жобаларын жүзеге асыру",
            "Зымыранын ғарышқа ұшыру",
            "Бағдарламашылармен кездесу"
        ],
        correctAnswer: 1
    }
];

export const READING_4_TEXT = dedent(`
    <b>4-матін</b>

    Тары дақылының шығу тарихы өте ерте заманға, яғни 5-7 мың жылдыққа барады. Жер шарында тарының 500-ден астам түрі өседі екен. Тарының қай жерде тұңғыш пайда болғанын көптеген елдердің ғалымдары зерттеген. Нәтижесінде оның шығу тегі шығыс елдерінде, соның ішінде Үндістан, Моңғолия мен Алтайда деген қорытындыға келген. Сонымен қатар тарының шығыс елдерінен Еуропаға ертедегі қоныстанушылар арқылы тарағаны дәлелденген.
    Ауыл шаруашылығы мен өндірісте де тарының пайдасы зор. Тарының сабанын жеген сауын сиырдың сүтінің өнімі мен құнарлығы артады екен. Сабанының сапасы қыста көктемдегі көк майсадан кем түспейтіні дәлелденген. Тары сабанында дәрумендер мол болғандықтан, малдар сүйсініп жейді.
    Тары дәнінен спирт алынса, сабағынан қағаз шығарады. Тарыны жеген тауықтар көп жұмыртқалайды. Жұмыртқаның қабығы қатты болады, ұзақ сақталады. Ғалымдардың зерттеуі бойынша, тарының емдік қасиеті қазіргі медицинада дәлелденген. Ол күш-қуат берумен қатар, бауырдың, бүйректің жұмысын жақсартып, терлетуге әсер етеді. Қыздырып басқан тары ісікті қайтарып, тіс ауырғанды тоқтатады. Ерте заманнан тарының қасиетін білген емшілер оны бауырға таптырмас ем деп санаған.
    Халқымыз тарыны «жауынгер дақыл» деп атайды. «Кеспе көже күн батқанша, бидай көже ел жатқанша, тары көже таң атқанша» деп бекер айтпаған. Ұзақ аурудан әлсіреген адамға тез күш жинау үшін тары көже берген. Тары көже әрі сусын, әрі тамақ болады.
    Ерте кезде талқан дайындаудың екі тәсілі болған. Бірі – қол диірменге тарту, екіншісі – келіге түю. Екі тәсілмен дайындағанда да талқанның майдаланбай шығуына ерекше мән берілген.
    Қалып қоятын түйіршіктері болады, оны «талқанның сағы» дейді. Талқанның сағын бөліп алу үшін жайпақ табаққа салып тазартады. Сонда сағы талқанның бетіне бөлініп шығады да, ұнтағы астында қалады. Бетіндегі сағын алып тастай отырып, талқанның ұнтағын бөліп алады. Талқан аса дәмді әрі құнарлы тағам.
`);
export const READING_4_TEST = [
    {
        question: "Тарының басқа елдерге таралу себебі",
        answers: [
            "жорықтар арқылы",
            "медицина арқылы",
            "сауда-саттық арқылы",
            "тұқымының шашылуы арқылы"
        ],
        correctAnswer: 0
    },
    {
        question: "Тары көженің пайдасын көрсетіңіз.",
        answers: [
            "Тіс ауырғанды тоқтатқан.",
            "Ауру адамды орнынан тұрғызған.",
            "Ыстық тердің шығуына әсер еткен.",
            "Бауырға таптырмас ем екенін білген."
        ],
        correctAnswer: 1
    },
    {
        question: "Диірменнен өткен не келіге түйілген тары ұнтағының атауы",
        answers: [
            "сақ",
            "көже",
            "сабан",
            "талқан"
        ],
        correctAnswer: 3
    },
    {
        question: "Болжал мәнді сөйлемді табыңыз.",
        answers: [
            "Әлсіреп ауырған адам тары көже ішуі қажет.",
            "Тарының сабанында көптеген дәрумендер бар.",
            "Халқымыз тарыны «жауынгер дақыл» деп атаған.",
            "Тары басқа елдерге жорықтар арқылы таралуы мүмкін."
        ],
        correctAnswer: 3
    },
    {
        question: "Қарсылықты мәнді сөйлемді табыңыз.",
        answers: [
            "Бидай көже ел жатқанша, тары көже таң атқанша.",
            "Тары адамға күш-қуат беріп, бауырдың жұмысын жақсартады.",
            "Тарының емдік қасиеті медицинада дәлелденсе де, аз тұтынамыз.",
            "Сағы талқанның бетіне бөлініп шығады да, ұнтағы астында қалады."
        ],
        correctAnswer: 2
    },
    {
        question: "Мәтіндегі қосымша ақпаратты табыңыз.",
        answers: [
            "Тарының адам денсаулығына пайдасы мол.",
            "Тары дақылы шығыс елдерінде пайда болған.",
            "Тары жеген тауық жұмыртқасының қабығы қатты болады.",
            "Ауыл шаруашылығында тары сабанының пайдасы өте көп."
        ],
        correctAnswer: 0
    },
    {
        question: "«Тары көже таң атқанша» деген сөздің білдіретін мағынасын анықтаңыз.",
        answers: [
            "тоқтық",
            "байлық",
            "ауырлық",
            "тыныштық"
        ],
        correctAnswer: 0
    },
    {
        question: "Диірменнен өткізгеннен кейін қалатын ірі түйіршіктердің атауы",
        answers: [
            "тарыныӊ дәні",
            "талқанның сағы",
            "тарыныӊ сабаны",
            "талқанның ұнтағы"
        ],
        correctAnswer: 1
    },
    {
        question: "Тары сабанының ерекшелігіне жатпайтын қатарды анықтаңыз.",
        answers: [
            "Құнарлы көк шөппен пара-пар.",
            "Құрамында дәрумендер өте көп.",
            "Дәнін қағаз шығаруға пайдаланады.",
            "Сабан жеген сиырлар сүтті болады."
        ],
        correctAnswer: 2
    },
    {
        question: "Сөйлемнің мағынасын анықтаңыз.\n\nТары сабанында дәрумендер мол болғандықтан, малдар сүйсініп жейді.",
        answers: [
            "себеп",
            "мезгіл",
            "қарсылықты",
            "мақсат мәнді"
        ],
        correctAnswer: 0
    },
    {
        question: "Сөйлемнің мағынасын анықтаңыз.\n\nКеспе көже күн батқанша, бидай көже ел жатқанша, тары көже таң атқанша.",
        answers: [
            "мақсат",
            "болжау",
            "салыстыру",
            "себеп-салдар"
        ],
        correctAnswer: 1
    },
    {
        question: "«Егер», «онда» сөздерін қатыстырып айтуға болатын сөйлемді көрсетіңіз.",
        answers: [
            "Тауықтар тары жесе, көп жұмыртқалайды.",
            "Тары шығыс елдерінде пайда болып, Еуропаға тараған.",
            "Тарының сабанында пайдалы заттар көп, малдар сүйсініп жейді.",
            "Талқан дайындаудың екі жолы бар: қол диірменге тарту, келіге түю."
        ],
        correctAnswer: 0
    }
];

export const VARIANT_LABEL = ['A)', 'B)', 'C)', 'D)', 'E)', 'F)'];
export const VARIANT_LABEL_LOWER_CASE = ['А)', 'Ә)', 'Б)', 'В)', 'Г)', 'Д)'];
