import { Level } from "src/generated/prisma/enums";
import dedent from 'dedent';

export interface Topic {
    title: {
        kk: string;
        ru: string;
        en: string;
    };
    description: {
        kk: string;
        ru: string;
        en: string;
    };
    writingTitle: {
        kk: string;
        ru: string;
        en: string;
    };
    writing: string;
    reading: string;
    readingTest: {
        question: string;
        answers: string[];
    }[];
    listeningAudioPath: string;
    listeningTitle: {
        kk: string;
        ru: string;
        en: string;
    };
    listening: string;
    speakingTitle: {
        kk: string;
        ru: string;
        en: string;
    };
    speaking: string;
}

export const TOPICS: Record<Level, Topic[]> = {
    [Level.A1]: [
        {
            title: {
                kk: "АЛҒАШҚЫ ТАНЫСТЫҚ",
                ru: "ЗНАКОМСТВО",
                en: "FIRST MEETING"
            },
            description: {
                kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    сәлеметсіз бе!
                    сәлем!
                    қалыңыз қалай?
                    танысып қояйық!
                    танысқаныма қуаныштымын!
                    атыңыз кім?
                    кешіріңіз.
                    рақмет!
                    тамаша!
                    оқасы жоқ.
                    менің атым...
                    қайырлы таң!
                    қайырлы күн!
                    кеш жарық!
                    қайырлы түн!
                    қош келдіңіз!
                    сау болыңыз!

                    ГРАММАТИКА
                    ӘЛІПБИ
                    ДАУЫСТЫ ДАУЫССЫЗ ДЫБЫСТАР

                    Қазақ тілінде.
                    Қазақ әліпбиінде 42 әріп бар. 
                    Оның 33-і орыс тілімен бірдей, ал 9 әріп — тек қазақ тіліне тән төл дыбыстар.
                    Кирилл әліпбиіне негізделген қазақ әліпбиінде қазақ тіліне тән тоғыз әріп бар. 
                    Қазақ әліпби	Тек қазақ тіліне тән төл дыбыстар
                    А, Ә, Б, В, Г, Ғ, Д, Е, Ё, Ж, З, И, Й, К, Қ, Л, М, Н, Ң, О, Ө, П, Р, С, Т, У, Ұ, Ү, Ф, Х, Һ, Ц, Ч, Ш, Щ, Ъ, Ы, І, Ь, Э, Ю, Я.	Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І.
                    Қазақ тіліндегі дыбыстар екі үлкен топқа бөлінеді: дауысты және дауыссыз.
                    Дауысты дыбыстар (12)
                    Дауысты дыбыстар өздігінен анық естіледі, айтқанда ауа еш кедергісіз шығады.
                    А, Ә, Е, Ё, И, О, Ө, Ұ, Ү, У, Ы, І
                    Ескерту: Қазақ тілінің төл сөздерінде негізінен А, Ә, Е, И, О, Ө, Ұ, Ү, Ы, І қолданылады. Ё көбіне кірме сөздерде кездеседі.
                    Дауыссыз дыбыстар (25)
                    Дауыссыз дыбыстарды айтқанда ауа ағынына кедергі жасалады.
                    Б, В, Г, Ғ, Д, Ж, З, Й, К, Қ, Л, М, Н, Ң, П, Р, С, Т, Ф, Х, Һ, Ц, Ч, Ш, Щ
                    Дауыссыз дыбыстар үшке бөлінеді:
                    Қатаң	Ұяң	Үнді
                    П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч	Б, В, Г, Ғ, Д, Ж, З	Й, Л, М, Н, Ң, Р
                    Есте сақтаңыз:
                    Дауысты – әндетіп, созып айтуға болады.
                    Дауыссыз – жеке өзі толық айтылмайды, көбіне дауысты дыбыспен бірге айтылады.
                `),
                ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    қазақ тілі	русский 
                    сәлеметсіз бе!	здравствуйте!
                    сәлем!	привет!
                    қалыңыз қалай?	как ваши дела?
                    танысып қояйық!	давайте познакомимся!
                    танысқаныма қуаныштымын!	рад(а) знакомству!
                    атыңыз кім?	как вас зовут?
                    кешіріңіз.	извините.
                    рақмет!	спасибо!
                    тамаша!	отлично!
                    оқасы жоқ.	не за что.
                    менің атым...	меня зовут...
                    қайырлы таң!	доброе утро!
                    қайырлы күн!	добрый день!
                    кеш жарық!	добрый вечер!
                    қайырлы түн!	спокойной ночи!
                    қош келдіңіз!	добро пожаловать!
                    сау болыңыз!	до свидания!

                    ГРАММАТИКА.
                    ӘЛІПБИ. АЛФАВИТ.
                    ДАУЫСТЫ ДАУЫССЫЗ ДЫБЫСТАР. ГЛАСНЫЕ И СОГЛАСНЫЕ ЗВУКИ.

                    В казахском алфавите 42 буквы. Из них 33 буквы совпадают с буквами русского алфавита, а 9 букв являются специфическими буквами казахского языка.
                    Казахский алфавит, основанный на кириллице, содержит девять букв, обозначающих звуки, характерные только для казахского языка.
                    Казахский алфавит	Исконные звуки, характерные только для казахского языка.
                    А, Ә, Б, В, Г, Ғ, Д, Е, Ё, Ж, З, И, Й, К, Қ, Л, М, Н, Ң, О, Ө, П, Р, С, Т, У, Ұ, Ү, Ф, Х, Һ, Ц, Ч, Ш, Щ, Ъ, Ы, І, Ь, Э, Ю, Я.	Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І.
                    Звуки казахского языка делятся на две большие группы: гласные и согласные.
                    Гласные звуки (12)
                    Гласные звуки произносятся свободно и отчётливо. При их произношении воздух проходит через речевой аппарат без препятствий.
                    А, Ә, Е, Ё, И, О, Ө, Ұ, Ү, У, Ы, І
                    Примечание: В исконно казахских словах в основном используются А, Ә, Е, И, О, Ө, Ұ, Ү, Ы, І. 
                    Ескерту: Буква Ё встречается преимущественно в заимствованных словах.
                    Согласные звуки (25)
                    При произношении согласных звуков воздушная струя встречает препятствие.
                    Б, В, Г, Ғ, Д, Ж, З, Й, К, Қ, Л, М, Н, Ң, П, Р, С, Т, Ф, Х, Һ, Ц, Ч, Ш, Щ
                    Согласные звуки делятся на три группы:
                    Глухие	Звонкие	Сонорные
                    П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч	Б, В, Г, Ғ, Д, Ж, З	Й, Л, М, Н, Ң, Р
                    Запомните: Гласные можно произносить протяжно и певуче.
                    Согласные самостоятельно полностью не произносятся и обычно произносятся вместе с гласными звуками.
                `),
                en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    қазақ тілі	english 
                    сәлеметсіз бе!	hello!
                    сәлем!	hi!
                    қалыңыз қалай?	how are you?
                    танысып қояйық!	let's get acquainted!
                    танысқаныма қуаныштымын!	nice to meet you!
                    атыңыз кім?	what is your name?
                    кешіріңіз.	excuse me.
                    рақмет!	thank you!
                    тамаша!	excellent!
                    оқасы жоқ.	you're welcome.
                    менің атым...	my name is...
                    қайырлы таң!	good morning!
                    қайырлы күн!	good afternoon!
                    кеш жарық!	good evening!
                    қайырлы түн!	good night!
                    қош келдіңіз!	welcome!
                    сау болыңыз!	goodbye!


                    The Kazakh alphabet has 42 letters. Of these, 33 are the same as in the Russian alphabet, while 9 letters represent unique sounds found only in the Kazakh language. The Kazakh alphabet, based on the Cyrillic script, includes nine letters that are specific to the Kazakh language.
                    Kazakh alphabet.	Native sounds unique to the Kazakh language.
                    А, Ә, Б, В, Г, Ғ, Д, Е, Ё, Ж, З, И, Й, К, Қ, Л, М, Н, Ң, О, Ө, П, Р, С, Т, У, Ұ, Ү, Ф, Х, Һ, Ц, Ч, Ш, Щ, Ъ, Ы, І, Ь, Э, Ю, Я.	Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І.

                    The sounds of the Kazakh language are divided into two main groups: vowels and consonants.
                    Vowel Sounds (12)
                    Vowel sounds are pronounced clearly and freely. When they are pronounced, the air passes through the speech organs without any obstruction.
                    А, Ә, Е, Ё, И, О, Ө, Ұ, Ү, У, Ы, І
                    Note: In native Kazakh words, the letters А, Ә, Е, И, О, Ө, Ұ, Ү, Ы, І are mainly used. The letter Ё is found mostly in borrowed words.
                    Consonant Sounds (25)
                    When consonant sounds are pronounced, the airflow is obstructed.
                    Б, В, Г, Ғ, Д, Ж, З, Й, К, Қ, Л, М, Н, Ң, П, Р, С, Т, Ф, Х, Һ, Ц, Ч, Ш, Щ
                    Consonant sounds are divided into three groups:
                    Voiceless consonants	Voiced consonants	Sonorant consonants
                    П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч	Б, В, Г, Ғ, Д, Ж, З	Й, Л, М, Н, Ң, Р
                `)
            },
            writingTitle: {
                kk: "Түсіп қалған әріпті жазыңыз.",
                ru: "Вставьте пропущенную букву.",
                en: "Write the missing letter."
            },
            writing: dedent(`
                Ат_ңы_ кім?
                К_ші_ің_з.
                Ра_м_т!
                Қ_й_рлы т_н!
                Қ_ш к_лдің_з!
                С_ле_!
                Қай_рлы т_ң!
                Са_ б_лыңы_!
                Оқа_ы ж_қ.
                С_ле_етсі_ бе!
                К_ш ж_рық!
                Та_ысқ_ны_а қ_а_ышты_ын!
            `),
            reading: dedent(`
                <b>Демалыс күні</b>

                Жексенбі күні Айдос ерте тұрды. Ауа райы жақсы болды. Ол таңғы ас ішті.
                Содан кейін Айдос жұбайы мен баласымен саябаққа барды. Олар саябақта серуендеді. Баласы балалар алаңында ойнады.Түсте олар дәмханаға барды. Шай ішіп, бауырсақ жеді. Отбасы бірге жақсы уақыт өткізді.Кешке олар үйге қайтты. Айдос гүлдерге су құйды. Барлығы жақсы демалып, жаңа аптаға дайын болды.
            `),
            readingTest: [
                {
                    question: "Айдос қай күні ерте тұрды?",
                    answers: [
                        "Дүйсенбі күні",
                        "Жексенбі күні",
                        "Сейсенбі күні",
                        "Жұма күні"
                    ],
                },
                {
                    question: "Айдос кімдермен саябаққа барды?",
                    answers: [
                        "Досымен",
                        "Жұбайы және баласымен",
                        "Әкесімен",
                        "Жұбайы және қызымен"
                    ],
                },
                {
                    question: "Кешке Айдос не істеді?",
                    answers: [
                        "Теледидар көрді",
                        "Достарымен кездесті",
                        "Спортпен айналысты",
                        "Гүлдерге су құйды"
                    ],
                },
                {
                    question: "Қазақ тіліне тән төл дыбыстарды белгілеңіз?",
                    answers: [
                        "А, Ә, Б, В, Г, Ғ, Д, Е, Ё",
                        "Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, І",
                        "А, Ә, И, Й, К, Қ, Л, М, Н",
                        "Ә, Ғ, Ң, Қ, Ө, Ұ, Ү, Һ, С"
                    ],
                },
                {
                    question: "Қатаң дауыссыз дыбыстарды белгілеңіз?",
                    answers: [
                        "П, Ф, К, Қ, Т, С, Ш, Щ, Х, Һ, Ц, Ч",
                        "Б, В, Г, Ғ, Д, Ж, З",
                        "Й, Л, М, Н, Ң, Р",
                        "Р, Г, Ғ, Д, Ж, З, П, Ф, К, Қ"
                    ],
                },
            ],
            listeningAudioPath: `src/assets/audio/A1-1_Алғашқы-таныстық.mp3`,
            listeningTitle: {
                kk: "Сөйлемді толықтырыңыз.",
                ru: "Дополните предложение.",
                en: "Complete the sentence."
            },
            listening: dedent(`
                Сәлеметсіздер ме!  ________– Айбек. Мен ________. Ақтөбе қаласында тұрамын, бірақ туған жерім – ________. Осыдан екі жыл бұрын жұмысқа байланысты Ақтөбеге көшіп келдім. Қазір ақпараттық технологиялар саласында ________ болып жұмыс істеймін.
                Бос уақытымда спортпен айналысқанды, ________және жаңа жерлерге саяхаттағанды ұнатамын. Сонымен қатар ________ және ________ тілдерін үйреніп жүрмін. Себебі болашақта халықаралық компанияда жұмыс істегім келеді.
                Мен қазақ тілі курсына ________ қатысып отырмын. Бұл курсқа әртүрлі мамандық иелері келген екен. Бүгін бірнеше адаммен таныстым. Олардың арасында ________, ________ және студенттер бар. Барлығы қазақ тілінде еркін сөйлегісі келеді. Мен де күн сайын жаңа сөздерді жаттап, сөйлесу дағдыларымды дамытуға тырысамын.
                Менің ойымша, жаңа адамдармен танысу – өзіңді дамытуға жақсы мүмкіндік. Себебі әр адамның өмірлік ________ мен ________ әртүрлі болады. Сондықтан бұл курста жақсы достар тауып, қазақ тілінде еркін сөйлеймін деп сенемін.
            `),
            speakingTitle: {
                kk: "Сөздерді аударып айтыңыз.",
                ru: "Переведите слова.",
                en: "Translate the words."
            },
            speaking: dedent(`
                Кітап, қайырлы күн, сау болыңыз, танысқаныма қуаныштымын, тамаша, кешіріңіз, мысық.
            `)
        },
    ],
    [Level.A2]: [],
    [Level.B1]: [],
    [Level.B2]: [],
    [Level.C1]: []
};
