import { Topic } from "..";
import dedent from 'dedent';

export const B1_3_TOPIC: Topic = {
    title: {
        kk: "БІЛІМ – БОЛАШАҚ КЕПІЛІ",
        ru: "ОБРАЗОВАНИЕ — ЗАЛОГ БУДУЩЕГО",
        en: "EDUCATION IS THE KEY TO THE FUTURE"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    академиялық орта
                    бағалау жүйесі
                    бағдарлама
                    білік
                    білім беру жүйесі
                    білім деңгейі
                    білім сапасы
                    білімге құштар
                    білімін жетілдіру
                    дағды
                    даналық сөздер
                    деңгей
                    дүниежүзіне әйгілі
                    еңбек
                    жасанды интеллект
                    жоба
                    жүйе
                    заманауи маман
                    заманауи технология
                    зерделі
                    зерттеу жұмысы
                    кәсіби білік
                    кәсіби даму
                    кітап қоры
                    қабілет

                    ГРАММАТИКА
                    ЕСІМШЕ, ҚАЛАУ РАЙ, МОДАЛЬ СӨЗДЕР

                    Есімше – етістіктен  жасалып, қимылдың белгісін білдіретін етістік түрі. Есімше сөйлемде сын есім сияқты қызмет атқарады.
                    Қалау рай – адамның бір нәрсені қалауын, ниетін, тілегін білдіретін етістік түрі.
                        Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	
                    Есімше	(-ған/-ген, -атын/-етін)	
                    Оқыған студент, дамып жатқан технология

                    Қалау рай
                    Мақсат, ниет айтуда қолданылады
                    (-ғы/-гі келеді)	Мен шетелде оқығым келеді
                    Модаль сөздер
                    Кеңес, талап айтуға ыңғайлы
                        (керек, қажет, маңызды)
                        Әр адам білім алуы керек
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақша	Орысша
                    академиялық орта	академическая среда
                    бағалау жүйесі	система оценивания
                    бағдарлама	программа
                    білік	квалификация
                    білім беру жүйесі	система образования
                    білім деңгейі	уровень знаний
                    білім сапасы	качество образования
                    білімге құштар	стремящийся к знаниям
                    білімін жетілдіру	совершенствовать знания
                    дағды	навык
                    даналық сөздер	мудрые слова
                    деңгей	уровень
                    дүниежүзіне әйгілі	всемирно известный
                    еңбек	труд
                    жасанды интеллект	искусственный интеллект
                    жоба	проект
                    жүйе	система
                    заманауи маман	современный специалист
                    заманауи технология	современная технология
                    зерделі	умный
                    зерттеу жұмысы	исследовательская работа
                    кәсіби білік	профессиональная квалификация
                    кәсіби даму	профессиональное развитие
                    кітап қоры	книжный фонд
                    қабілет	способность

                    ГРАММАТИКА.
                    ПРИЧАСТИЕ, ЖЕЛАТЕЛЬНОЕ НАКЛОНЕНИЕ, МОДАЛЬНЫЕ СЛОВА.

                    Есімше – етістіктен  жасалып, қимылдың белгісін білдіретін етістік түрі. Есімше сөйлемде сын есім сияқты қызмет атқарады.
                    Қалау рай – адамның бір нәрсені қалауын, ниетін, тілегін білдіретін етістік түрі.
                        Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	
                    Есімше	(-ған/-ген, -атын/-етін)	
                    Оқыған студент, дамып жатқан технология

                    Қалау рай
                    Мақсат, ниет айтуда қолданылады
                    (-ғы/-гі келеді)	Мен шетелде оқығым келеді
                    Модаль сөздер
                    Кеңес, талап айтуға ыңғайлы
                        (керек, қажет, маңызды)
                        Әр адам білім алуы керек
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	Орысша	English
                    академиялық орта	академическая среда	 academic environment
                    бағалау жүйесі	система оценивания	assessment system
                    бағдарлама	программа	program
                    білік	квалификация	qualification
                    білім беру жүйесі	система образования	education system
                    білім деңгейі	уровень знаний	level of knowledge
                    білім сапасы	качество образования	quality of education
                    білімге құштар	стремящийся к знаниям	eager for knowledge
                    білімін жетілдіру	совершенствовать знания	improve knowledge
                    дағды	навык	skill
                    даналық сөздер	мудрые слова	words of wisdom
                    деңгей	уровень	level
                    дүниежүзіне әйгілі	всемирно известный	world-famous
                    еңбек	труд	labor / work
                    жасанды интеллект	искусственный интеллект	artificial intelligence
                    жоба	проект	project
                    жүйе	система	system
                    заманауи маман	современный специалист	modern specialist
                    заманауи технология	современная технология	modern technology
                    зерделі	умный	intelligent
                    зерттеу жұмысы	исследовательская работа	research work
                    кәсіби білік	профессиональная квалификация	professional qualification
                    кәсіби даму	профессиональное развитие	professional development
                    кітап қоры	книжный фонд	library collection
                    қабілет	способность	ability

                    GRAMMAR
                    Participle, desiderative mood (optative), modal words.

                    Есімше – етістіктен  жасалып, қимылдың белгісін білдіретін етістік түрі. Есімше сөйлемде сын есім сияқты қызмет атқарады.
                    Қалау рай – адамның бір нәрсені қалауын, ниетін, тілегін білдіретін етістік түрі.
                        Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	
                    Есімше	(-ған/-ген, -атын/-етін)	
                    Оқыған студент, дамып жатқан технология

                    Қалау рай
                    Мақсат, ниет айтуда қолданылады
                    (-ғы/-гі келеді)	Мен шетелде оқығым келеді
                    Модаль сөздер
                    Кеңес, талап айтуға ыңғайлы
                        (керек, қажет, маңызды)
                        Әр адам білім алуы керек
                `)
    },
    writingTitle: {
        kk: "Сөздерді дұрыс ретімен орналастырып, сөйлем құраңыз.",
        ru: "Расположите слова в правильном порядке и составьте предложение.",
        en: "Put the words in the correct order and make a sentence."
    },
    writing: dedent(`
                1.	студенттер / онлайн курсқа / белсенді / қатысып / жүр 
                2.	мектепте / заманауи / қолданылып / технологиялар / жатыр 
                3.	мұғалімдер / кәсіби / үнемі / дамуға / ұмтылады 
                4.	ғылыми зерттеу / жас ғалымдар / жүргізіп / жатыр 
                5.	университетте / халықаралық / ұйымдастырылды / жоба 
                6.	білім ордасында / тәжірибелі мамандар / жұмыс / істейді 
                7.	оқушылар / терең / алуға / білім / тырысады
            `),
    reading: dedent(`
                <b>«Әбу Насыр әл-Фараби – дүниежүзілік әйгілі ғалым»</b>

                Әбу Насыр әл-Фараби – дүниежүзіне ұлы ғалым. Аристотельден кейінгі екінші ұстаз, «Шығыстың Аристотелі» атанған. Әбу Насыр әл-Фараби орта ғасырда қазақтың ежелгі қаласы Отырарда дүниеге келген. Отырарды арабтар Фараб деп атаған, осыдан ол Әбу Насыр Фараби, яғни Фарабтан шыққан Әбу Насыр атанған. Бұл қаланың орны – қазіргі Оңтүстік Қазақстан облысы Отырар ауданында. Отырар өз кезінде ірі мәдени-сауда орталығы болған. Ал Отырардағы кітапхана XI-XII ғасырларда өзінің кітап қоры жағынан дүниежүзіне әйгілі кітапханалар қатарында болған. Әбу Насыр әл-Фарабидің балалық шағы Арыс, Сырдария бойында өткен. Отырар медресесінде дәріс алып, ондағы аса бай кітапханадағы қолжазбаларды оқып меңгерді. Әбу Насыр әл-Фараби білімін тереңдету үшін сол кездегі білім орталықтары саналатын Бағдад, Дамаскі (Шам), Каирде болған. Мұнда ол білімін әбден толықтырып, өзінің ақылының, алғырлығы мен асқан байсалдылығы арқасында көп ұзамай ірі ғалымдардың арасында үлкен абырой-беделге ие болған. Әбу Насыр әл-Фараби 150-200-ден астам ғылыми еңбек жазған. Оның ішінде «Музыканың ұлы кітабы», «Ғалымдардың шығуы», «Әлеуметтік-этникалық трактаттары», «Философиялық трактаттары» т.б. еңбектері әлемге әйгілі, ғылымның дамуына жол ашты.
                Ғалым 950 жылы 80 жасында Дамаскіде дүние салған. Фарабидің қолжазбалары дүниежүзінің көп кітапханаларына тарап кеткен және ол жерлерде сақтаулы тұр. Алматыдағы Қазақ ұлттық университеті Әбу Насыр әл-Фараби есімімен аталады. Университет алдында оған орнатылған ескерткіш бар. Алматыдағы әсем көшелердің бірі де ғұлама ғалым есімімен аталған.
            `),
    readingTest: [
        {
            "question": "Әбу Насыр әл-Фараби кім болған?",
            "answers": [
                "Батыр",
                "Ақын",
                "Ұлы ғалым",
                "Суретші"
            ]
        },
        {
            "question": "Әл-Фарабиді қалай атаған?",
            "answers": [
                "Қазақтың ақыны",
                "Шығыстың Аристотелі",
                "Ұлы жазушы",
                "Дала ойшылы"
            ]
        },
        {
            "question": "Әл-Фараби қай қалада дүниеге келген?",
            "answers": [
                "Түркістан",
                "Тараз",
                "Отырар",
                "Самарқан"
            ]
        },
        {
            "question": "Отырар қаласын арабтар қалай атаған?",
            "answers": [
                "Шам",
                "Бағдад",
                "Фараб",
                "Каир"
            ]
        },
        {
            "question": "Әл-Фарабидің балалық шағы қай жерде өткен?",
            "answers": [
                "Іле бойында",
                "Арыс, Сырдария бойында",
                "Ертіс бойында",
                "Балқаш маңында"
            ]
        },
        {
            "question": "Әл-Фараби білімін тереңдету үшін қай қалаларда болған?",
            "answers": [
                "Алматы, Астана, Түркістан",
                "Мәскеу, Киев, Омбы",
                "Бағдад, Дамаск, Каир",
                "Тараз, Шымкент, Семей"
            ]
        },
        {
            "question": "Әл-Фараби қанша ғылыми еңбек жазған?",
            "answers": [
                "20-дан астам",
                "50-ден астам",
                "150–200-ден астам",
                "500-ден астам"
            ]
        },
        {
            "question": "Қай еңбек әл-Фарабиге тиесілі?",
            "answers": [
                "Абай жолы",
                "Музыканың ұлы кітабы",
                "Көшпенділер",
                "Қозы Көрпеш"
            ]
        },
        {
            "question": "Әл-Фараби қай жылы дүниеден өткен?",
            "answers": [
                "850 жылы",
                "900 жылы",
                "950 жылы",
                "1000 жылы"
            ]
        },
        {
            "question": "Алматыдағы Қазақ ұлттық университеті кімнің есімімен аталады?",
            "answers": [
                "Абай Құнанбайұлы",
                "Шоқан Уәлиханов",
                "Ыбырай Алтынсарин",
                "Әбу Насыр әл-Фараби"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/b1/B1-3_Білім---болашақ-кепілі.mp3`,
    listeningTitle: {
        kk: "Тиісті сөзді жазып, сөйлемді толықтырыңыз.",
        ru: "Напишите подходящее слово и дополните предложение.",
        en: "Write the correct word and complete the sentence."
    },
    listening: dedent(`
                1.	Қазіргі таңда білім беру саласы __________________ келеді. 
                2.	Көптеген мектептер мен университеттер __________________ кеңінен қолданады. 
                3.	Онлайн платформалар арқылы студенттер __________________ білім ала алады. 
                4.	Педагогтер кәсіби дамуға ерекше __________________ бөледі. 
                5.	Сабақ барысында интерактивті __________________ жиі қолданылады. 
                6.	Кейбір оқу орындары электронды кітапханалар мен арнайы оқу __________________ пайдаланады. 
                7.	Әр адам терең білім алып, үнемі __________________ жүруі қажет.
            `),
    speakingTitle: {
        kk: "Тақырыпқа байланысты тірек сөздерді пайдаланып, қысқаша әңгіме құраңыз.",
        ru: "Составьте короткий рассказ, используя опорные слова по теме.",
        en: "Write a short story using the key words related to the topic."
    },
    speaking: dedent(`
                сапалы білім алу 
                заманауи технологиялар
                кәсіби даму
                терең білімді маман 
                болашаққа үлкен мүмкіндік
                арнайы платформа
                халықаралық жоба
            `)
};
