import { Topic } from "..";
import dedent from 'dedent';

export const B1_6_TOPIC: Topic = {
    title: {
        kk: "ҚОРШАҒАН ОРТА",
        ru: "ОКРУЖАЮЩАЯ СРЕДА",
        en: "ENVIRONMENT"
    },
    description: {
        kk: "src/assets/document/b1/kk/6 - сабақ В1 қоршаған орта.docx",
        ru: "src/assets/document/b1/ru/6. В1 ОКРУЖАЮЩАЯ СРЕДА.docx",
        en: "src/assets/document/b1/en/6. В1 ENVIRONMENT.docx"
    },
    writingTitle: {
        kk: "Сөздерді дұрыс ретімен орналастырып, сөйлем құраңыз.",
        ru: "Расположите слова в правильном порядке и составьте предложение.",
        en: "Put the words in the correct order and make a sentence."
    },
    writing: dedent(`
        1. ауа / ауылда / қалаға қарағанда / тазарақ
        2. ең / орман / табиғаттың / маңызды / байлығы
        3. өте / бүгін / ауа / таза
        4. кейбір / лас / аудандар / емес / аса
        5. өзеннің / былтырғыдан / суы / таза
        6. адамдар / қоршаған ортаны / қорғауға / белсендірек / қатысады
        7. табиғатты / болашақ / ұрпақ / маңызды / үшін / сақтау
    `),
    writingAnswer: dedent(`
        1.	Ауылда ауа қалаға қарағанда тазарақ.
        2.	Орман — табиғаттың ең маңызды байлығы.
        3.	Бүгін ауа өте таза.
        4.	Кейбір аудандар аса лас емес.
        5.	Өзеннің суы былтырғыдан таза.
        6.	Адамдар қоршаған ортаны қорғауға белсендірек қатысады.
        7.	Табиғатты болашақ ұрпақ үшін сақтау маңызды.
    `),
    reading: dedent(`
        Қазақстан аумағында табиғатты қорғауға арналған көптеген қорықтар бар. Қорық – ерекше қорғалатын табиғи аумақ. Оның негізгі мақсаты – табиғаттағы сирек кездесетін жануарлар мен өсімдіктерді сақтау, олардың санын көбейту және табиғи тепе-теңдікті қорғау. Қорық аумағында аң аулауға, ағаш кесуге, құрылыс жұмыстарын жүргізуге немесе табиғатқа зиян келтіретін әрекеттер жасауға тыйым салынады.
        Қазақстандағы алғашқы қорық – 1926 жылы құрылған Ақсу-Жабағылы қорығы. Ол еліміздің оңтүстігінде орналасқан және Орталық Азиядағы ең көне қорықтардың бірі саналады. Бұл қорықта қызғалдақтың сирек түрлері, қар барысы, арқар және көптеген құстар мекендейді.
        Сонымен қатар Қазақстанда Қорғалжын, Наурызым, Марқакөл, Үстірт және Алакөл сияқты қорықтар бар. Әсіресе Қорғалжын қорығы қызғылт қоқиқаздарымен танымал. Жыл сайын бұл жерге мыңдаған құстар ұшып келеді. Қорықтар тек табиғатты қорғау үшін ғана емес, ғылыми зерттеулер жүргізу үшін де маңызды орын болып саналады.
        Қазіргі таңда экологиялық мәселелердің көбеюіне байланысты қорықтардың маңызы артып келеді. Табиғатты қорғау – әр адамның азаматтық міндеті. Егер біз қоршаған ортаға жауапкершілікпен қарасақ, болашақ ұрпаққа табиғат байлығын сақтап қала аламыз
    `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі тақырыбы қандай?",
            "answers": [
                "Қорықтар",
                "қоршаған орта",
                "алғашқы қорық",
                "экология"
            ]
        },
        {
            "question": "Қай сөз салыстырмалы шырайда тұр?",
            "answers": [
                "сирек",
                "өте сирек",
                "сиректеу",
                "ең сирек"
            ]
        },
        {
            "question": "Қазақстандағы алғашқы қорық қай жылы құрылды?",
            "answers": [
                "1924",
                "1925",
                "1926",
                "1927"
            ]
        },
        {
            "question": "Қорықтың негізгі мақсаты қандай?",
            "answers": [
                "туризмді дамыту",
                "табиғатты қорғау",
                "қала салу",
                "өнеркәсіп ашу"
            ]
        },
        {
            "question": "Қорықтар не үшін маңызды деп саналған?",
            "answers": [
                "экологиялық мәселелер үшін",
                "тазалық үшін",
                "құрылыс үшін",
                "ғылыми зерттеулер жүргізу үшін"
            ]
        },
        {
            "question": "Күшейтпелі шырайдағы сөзді табыңыз?",
            "answers": [
                "көне",
                "көнелеу",
                "ең көне",
                "көнелі"
            ]
        },
        {
            "question": "«Өте» сөзі қандай шырай жасауға көмектеседі?",
            "answers": [
                "жай шырай",
                "салыстырмалы шырай",
                "күшейтпелі шырай",
                "асырмалы шырай"
            ]
        },
        {
            "question": "Қазіргі таңда қорықтың маңызы неге артып келеді?",
            "answers": [
                "турист саны көп",
                "экологиялық мәселе көбейгендіктен",
                "лас ауадан",
                "қала көбейгендіктен"
            ]
        },
        {
            "question": "Табиғатты қорғау кімнің міндеті?",
            "answers": [
                "оқушы",
                "ғалым",
                "орманшы",
                "әр адам"
            ]
        },
        {
            "question": "Қай сөйлем дұрыс құрылған?",
            "answers": [
                "Ауа ең таза.",
                "Ауа таза ең.",
                "Ең таза ауа",
                "Таза ең ауа."
            ]
        }
    ],
    readingAnswer: dedent(`
        1. а) Қорықтар 
        2. б) сиректеу
        3. ә) 1925
        4. ә) табиғатты қорғау 
        5. а) экологиялық мәселелер үшін
        6. б) ең көне 
        7. б) күшейтпелі шырай 
        8. ә) экологиялық мәселе көбейгендіктен
        9. в) әр адам 
        10. б) Ең таза ауа
    `),
    listeningAudioPath: `src/assets/audio/b1/B1-6_Қоршаған-орта.mp3`,
    listeningTitle: {
        kk: "Тиісті сөзді жазып, сөйлемді толықтырыңыз.",
        ru: "Напишите подходящее слово и дополните предложение.",
        en: "Write the correct word and complete the sentence."
    },
    listening: dedent(`
        1. Қазіргі кезде қоршаған ортаны қорғау мәселесі өте ________.
        2. Кейбір қалаларда ауа бұрынғыдан ________.
        3. Адамдарды қоғамдық көлікті көбірек пайдалануға ________.
        4. Ағаш отырғызу жұмыстары жүргізіліп ________.
        5. Қайта өңдеу табиғатты қорғауға ________.
        6. Табиғат неғұрлым таза болса, адамдардың ________ соғұрлым жақсы болады.
        7. Пластик қалдықтарды аз пайдалану ________.
    `),
    listeningAnswer: dedent(`
        1. Қазіргі кезде қоршаған ортаны қорғау мәселесі өте маңызды.
        2. Кейбір қалаларда ауа бұрынғыдан лас.
        3. Адамдарды қоғамдық көлікті көбірек пайдалануға шақырады.
        4. Ағаш отырғызу жұмыстары жүргізіліп жатыр.
        5. Қайта өңдеу табиғатты қорғауға көмектеседі.
        6. Табиғат неғұрлым таза болса, адамдардың денсаулығы соғұрлым жақсы болады.
        7. Пластик қалдықтарды аз пайдалану маңызды.
    `),
    speakingTitle: {
        kk: "Тақырыпқа байланысты тірек сөздерді пайдаланып, қысқаша әңгіме құраңыз.",
        ru: "Составьте короткий рассказ, используя опорные слова по теме.",
        en: "Write a short story using the key words related to the topic."
    },
    speaking: dedent(`
        қоршаған орта
        таза ауа
        экологиялық мәсел
        ағаш отырғызу
        қоқыс
        қайта өңдеу 
        жасыл аймақ 
        табиғатты қорғау
    `),
    speakingAnswer: dedent(`
        Қоршаған ортаны қорғау – әр адамның міндеті. Таза ауа адам денсаулығы үшін өте маңызды. Қазіргі кезде экологиялық мәселе көп кездеседі. Сондықтан ағаш отырғызу және қоқысты қайта өңдеу керек. Жасыл аймақтарды көбейтіп, табиғатты қорғауымыз қажет.
    `)
};
