import { Topic } from "..";
import dedent from 'dedent';

export const B1_6_TOPIC: Topic = {
    title: {
        kk: "ҚОРШАҒАН ОРТА",
        ru: "ОКРУЖАЮЩАЯ СРЕДА",
        en: "ENVIRONMENT"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    Ауа ластануы
                    Жасыл аймақ
                    Жануарлар әлемі
                    Қайта өңдеу
                    Қоқыс
                    Қорық
                    Сенбілік
                    Су ресурстары
                    Табиғат
                    Табиғатты қорғау
                    Зиянды қалдық

                    ГРАММАТИКА
                    Сын есімнің шырайлары

                    Сын есім заттың сынын, түрін, түсін, сапасын, көлемін т.б білдіріп, қандай? қай? деген сұрақтарға жауап береді.
                    Жай шырай                    салыстырмалы шырай       күшейтпелі шырай
                    Сын есімнің шырайлары заттың сапасының әртүрлі деңгейін білдіреді.
                    Сын есім шырайлары	Жасалу жолы	Мысалы
                    Жай шырай	-	әдемі
                    Салыстырмалы шырай	-лау/-леу, -дау/-деу, -тау, -теу	әдемілеу, әдемірек
                    Күшейтпелі шырай	өте, тым, аса, ең	Өте әдемі, тым әдемі, әп-әдемі

                    Мысалдар:
                    Ауылдың ауасы қалаға қарағанда тазарақ.
                    Бұл саябақ өте әдемі.
                    Орман — табиғаттың ең маңызды бөлігі.
                    Биыл өзен суы былтырғыдан таза.
                    Қаладағы кейбір аудандар аса лас емес.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақша	Орысша	Ағылшынша
                    Ауа ластануы	Загрязнение воздуха	Air pollution
                    Жасыл аймақ	Зеленая зона	Green zone
                    Жануарлар әлемі	Животный мир	Animal world
                    Қайта өңдеу	Переработка	Recycling
                    Қоқыс	Мусор	Garbage
                    Қорық	Заповедник	Reserve
                    Сенбілік	Субботник	Subbotnik
                    Су ресурстары	Водные ресурсы	Water resourses
                    Табиғат	Природа	Nature
                    Табиғатты қорғау	Защищать природу	Nature protection
                    Зиянды қалдық	Вредный отход	Harmful waste

                    ГРАММАТИКА.
                    СТЕПЕНИ СРАВНЕНИЯ ИМЁН ПРИЛАГАТЕЛЬНЫХ.

                    Сын есім заттың сынын, түрін, түсін, сапасын, көлемін т.б білдіріп, қандай? қай? деген сұрақтарға жауап береді.
                    Жай шырай                    салыстырмалы шырай       күшейтпелі шырай
                    Сын есімнің шырайлары заттың сапасының әртүрлі деңгейін білдіреді.
                    Сын есім шырайлары	Жасалу жолы	Мысалы
                    Жай шырай	-	әдемі
                    Салыстырмалы шырай	-лау/-леу, -дау/-деу, -тау, -теу	әдемілеу, әдемірек
                    Күшейтпелі шырай	өте, тым, аса, ең	Өте әдемі, тым әдемі, әп-әдемі

                    Мысалдар:
                    Ауылдың ауасы қалаға қарағанда тазарақ.
                    Бұл саябақ өте әдемі.
                    Орман — табиғаттың ең маңызды бөлігі.
                    Биыл өзен суы былтырғыдан таза.
                    Қаладағы кейбір аудандар аса лас емес.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	Орысша	Ағылшынша
                    Ауа ластануы	Загрязнение воздуха	Air pollution
                    Жасыл аймақ	Зеленая зона	Green zone
                    Жануарлар әлемі	Животный мир	Animal world
                    Қайта өңдеу	Переработка	Recycling
                    Қоқыс	Мусор	Garbage
                    Қорық	Заповедник	Reserve
                    Сенбілік	Субботник	Subbotnik
                    Су ресурстары	Водные ресурсы	Water resourses
                    Табиғат	Природа	Nature
                    Табиғатты қорғау	Защищать природу	Nature protection
                    Зиянды қалдық	Вредный отход	Harmful waste

                    GRAMMAR
                    Degrees of comparison of adjectives.

                    Сын есім заттың сынын, түрін, түсін, сапасын, көлемін т.б білдіріп, қандай? қай? деген сұрақтарға жауап береді.
                    Жай шырай                    салыстырмалы шырай       күшейтпелі шырай
                    Сын есімнің шырайлары заттың сапасының әртүрлі деңгейін білдіреді.
                    Сын есім шырайлары	Жасалу жолы	Мысалы
                    Жай шырай	-	әдемі
                    Салыстырмалы шырай	-лау/-леу, -дау/-деу, -тау, -теу	әдемілеу, әдемірек
                    Күшейтпелі шырай	өте, тым, аса, ең	Өте әдемі, тым әдемі, әп-әдемі

                    Мысалдар:
                    Ауылдың ауасы қалаға қарағанда тазарақ.
                    Бұл саябақ өте әдемі.
                    Орман — табиғаттың ең маңызды бөлігі.
                    Биыл өзен суы былтырғыдан таза.
                    Қаладағы кейбір аудандар аса лас емес.
                `)
    },
    writingTitle: {
        kk: "Сөздерді дұрыс ретімен орналастырып, сөйлем құраңыз.",
        ru: "Расположите слова в правильном порядке и составьте предложение.",
        en: "Put the words in the correct order and make a sentence."
    },
    writing: dedent(`
                1. ауа / ауылда / қалаға қарағанда / тазарақ
                2. ең / орман / табиғаттың / маңызды / байлығы
                3. өте / бүгін / ауа / таза
                4. кейбір / лас / аудандар / емес / аса
                5. өзеннің / былтырғыдан / суы / таза
                6. адамдар / қоршаған ортаны / қорғауға / белсендірек / қатысады
                7. табиғатты / болашақ / ұрпақ / маңызды / үшін / сақтау
            `),
    reading: dedent(`
                Қазақстан аумағында табиғатты қорғауға арналған көптеген қорықтар бар. Қорық – ерекше қорғалатын табиғи аумақ. Оның негізгі мақсаты – табиғаттағы сирек кездесетін жануарлар мен өсімдіктерді сақтау, олардың санын көбейту және табиғи тепе-теңдікті қорғау. Қорық аумағында аң аулауға, ағаш кесуге, құрылыс жұмыстарын жүргізуге немесе табиғатқа зиян келтіретін әрекеттер жасауға тыйым салынады.
                Қазақстандағы алғашқы қорық – 1926 жылы құрылған Ақсу-Жабағылы қорығы. Ол еліміздің оңтүстігінде орналасқан және Орталық Азиядағы ең көне қорықтардың бірі саналады. Бұл қорықта қызғалдақтың сирек түрлері, қар барысы, арқар және көптеген құстар мекендейді.
                Сонымен қатар Қазақстанда Қорғалжын, Наурызым, Марқакөл, Үстірт және Алакөл сияқты қорықтар бар. Әсіресе Қорғалжын қорығы қызғылт қоқиқаздарымен танымал. Жыл сайын бұл жерге мыңдаған құстар ұшып келеді. Қорықтар тек табиғатты қорғау үшін ғана емес, ғылыми зерттеулер жүргізу үшін де маңызды орын болып саналады.
                Қазіргі таңда экологиялық мәселелердің көбеюіне байланысты қорықтардың маңызы артып келеді. Табиғатты қорғау – әр адамның азаматтық міндеті. Егер біз қоршаған ортаға жауапкершілікпен қарасақ, болашақ ұрпаққа табиғат байлығын сақтап қала аламыз
            `),
    readingTest: [
        {
            "question": "Мәтіннің негізгі тақырыбы қандай?",
            "answers": [
                "Қорықтар",
                "қоршаған орта",
                "алғашқы қорық",
                "экология"
            ]
        },
        {
            "question": "Қай сөз салыстырмалы шырайда тұр?",
            "answers": [
                "сирек",
                "өте сирек",
                "сиректеу",
                "ең сирек"
            ]
        },
        {
            "question": "Қазақстандағы алғашқы қорық қай жылы құрылды?",
            "answers": [
                "1924",
                "1925",
                "1926",
                "1927"
            ]
        },
        {
            "question": "Қорықтың негізгі мақсаты қандай?",
            "answers": [
                "туризмді дамыту",
                "табиғатты қорғау",
                "қала салу",
                "өнеркәсіп ашу"
            ]
        },
        {
            "question": "Қорықтар не үшін маңызды деп саналған?",
            "answers": [
                "экологиялық мәселелер үшін",
                "тазалық үшін",
                "құрылыс үшін",
                "ғылыми зерттеулер жүргізу үшін"
            ]
        },
        {
            "question": "Күшейтпелі шырайдағы сөзді табыңыз?",
            "answers": [
                "көне",
                "көнелеу",
                "ең көне",
                "көнелі"
            ]
        },
        {
            "question": "«Өте» сөзі қандай шырай жасауға көмектеседі?",
            "answers": [
                "жай шырай",
                "салыстырмалы шырай",
                "күшейтпелі шырай",
                "асырмалы шырай"
            ]
        },
        {
            "question": "Қазіргі таңда қорықтың маңызы неге артып келеді?",
            "answers": [
                "турист саны көп",
                "экологиялық мәселе көбейгендіктен",
                "лас ауадан",
                "қала көбейгендіктен"
            ]
        },
        {
            "question": "Табиғатты қорғау кімнің міндеті?",
            "answers": [
                "оқушы",
                "ғалым",
                "орманшы",
                "әр адам"
            ]
        },
        {
            "question": "Қай сөйлем дұрыс құрылған?",
            "answers": [
                "Ауа ең таза.",
                "Ауа таза ең.",
                "Ең таза ауа",
                "Таза ең ауа."
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/b1/B1-6_Қоршаған-орта.mp3`,
    listeningTitle: {
        kk: "Тиісті сөзді жазып, сөйлемді толықтырыңыз.",
        ru: "Напишите подходящее слово и дополните предложение.",
        en: "Write the correct word and complete the sentence."
    },
    listening: dedent(`
                1. Қазіргі кезде қоршаған ортаны қорғау мәселесі өте ________.
                2. Кейбір қалаларда ауа бұрынғыдан ________.
                3. Адамдарды қоғамдық көлікті көбірек пайдалануға ________.
                4. Ағаш отырғызу жұмыстары жүргізіліп ________.
                5. Қайта өңдеу табиғатты қорғауға ________.
                6. Табиғат неғұрлым таза болса, адамдардың ________ соғұрлым жақсы болады.
                7. Пластик қалдықтарды аз пайдалану ________.
            `),
    speakingTitle: {
        kk: "Тақырыпқа байланысты тірек сөздерді пайдаланып, қысқаша әңгіме құраңыз.",
        ru: "Составьте короткий рассказ, используя опорные слова по теме.",
        en: "Write a short story using the key words related to the topic."
    },
    speaking: dedent(`
                қоршаған орта
                таза ауа
                экологиялық мәсел
                ағаш отырғызу
                қоқыс
                қайта өңдеу 
                жасыл аймақ 
                табиғатты қорғау
            `)
};
