import { Topic } from "..";
import dedent from 'dedent';

export const B1_8_TOPIC: Topic = {
    title: {
        kk: "КӨЛІК ЖӘНЕ ЖАЯУ ЖҮРГІНШІ",
        ru: "ТРАНСПОРТ И ПЕШЕХОД",
        en: "TRAFFIC AND PEDESTRIAN"
    },
    description: {
        kk: "src/assets/document/b1/kk/8 - сабақ В1. Көлік және жаяу жүргінші дайын.docx",
        ru: "src/assets/document/b1/ru/8. В1. ТРАНСПОРТ И ПЕШЕХОД.docx",
        en: "src/assets/document/b1/en/8. В1. TRAFFIC AND PEDESTRIAN.docx"
    },
    writingTitle: {
        kk: "Сөздерді дұрыс ретімен орналастырып, сөйлем құраңыз.",
        ru: "Расположите слова в правильном порядке и составьте предложение.",
        en: "Put the words in the correct order and make a sentence."
    },
    writing: dedent(`
        1.	жаяу жүргіншілер жолынан / өту / керек
        2.	жүргізушілер / жол ережесін / сақтауы / қажет
        3.	көлікте / тағу / қауіпсіздік белдігін / керек
        4.	қызыл түсте / өтуге / болмайды
        5.	қоғамдық көлікте / мәдениетті / болу / қажет
        6.	жолда / телефонмен / сөйлесуге / болмайды
        7.	автобусқа / кезекпен / міну / керек
    `),
    writingAnswer: dedent(`
        1.	Жаяу жүргіншілер өткелінен өту керек.
        2.	Жүргізушілер жол ережесін сақтауы қажет.
        3.	Көлікте қауіпсіздік белдігін тағу керек.
        4.	Қызыл түсте өтуге болмайды.
        5.	Қоғамдық көлікте мәдениетті болу қажет.
        6.	Жолда телефонмен сөйлесуге болмайды.
        7.	Автобусқа кезекпен міну керек.
    `),
    reading: dedent(`
        <b>Жол қауіпсіздігі – ортақ жауапкершілік</b>

        Қазіргі таңда жол қауіпсіздігі — маңызды мәселелердің бірі. Күн сайын қала көшелерінде көптеген көлік қозғалады. Сондықтан жүргізушілер мен жаяу жүргіншілер жол ережесін жақсы білуі керек.
        Жолда бағдаршам мен жол белгілеріне назар аудару өте маңызды. Әсіресе, балалар мен қарт адамдар жолдан өткен кезде абай болуы қажет. Көлікте қауіпсіздік белдігін тағу адам өмірін сақтауға көмектеседі.
        Соңғы жылдары жол апаттарының саны көбейіп келеді. Оның негізгі себептері — жылдамдықты арттыру, телефон қолдану және ережені сақтамау. Мамандар жол мәдениетін дамыту қажет деп есептейді.
        Жол ережесін сақтау — әр адамның міндеті. Қауіпсіздік ережелерін орындау арқылы көптегенжол-көлік оиғасының алдын алуға болады.
    `),
    readingTest: [
        {
            "question": "Қазіргі таңда маңызды мәселелердің бірі не?",
            "answers": [
                "Спорт",
                "Жол қауіпсіздігі",
                "Музыка",
                "Туризм"
            ]
        },
        {
            "question": "Қала көшелерінде күн сайын не көп қозғалады?",
            "answers": [
                "Велосипедтер",
                "Адамдар",
                "Көлік",
                "Ұшақтар"
            ]
        },
        {
            "question": "Жүргізушілер мен жаяу жүргіншілер нені жақсы білуі керек?",
            "answers": [
                "Шет тілін",
                "Компьютерді",
                "Жол ережесін",
                "Спорт түрлерін"
            ]
        },
        {
            "question": "Жолда неге назар аудару маңызды?",
            "answers": [
                "Дүкендерге",
                "Бағдаршам мен жол белгілеріне",
                "Ауа райына",
                "Ғимараттарға"
            ]
        },
        {
            "question": "Жолдан өткен кезде кімдер абай болуы қажет?",
            "answers": [
                "Тек жүргізушілер",
                "Тек студенттер",
                "Балалар мен қарт адамдар",
                "Тек жолаушылар"
            ]
        },
        {
            "question": "Қауіпсіздік белдігін тағу неге көмектеседі?",
            "answers": [
                "Уақытты үнемдеуге",
                "Адам өмірін сақтауға",
                "Жылдам жүруге",
                "Көлікті жөндеуге"
            ]
        },
        {
            "question": "Жол апаттарының негізгі себептерінің бірі қандай?",
            "answers": [
                "Кітап оқу",
                "Телефон қолдану",
                "Музыка тыңдау",
                "Серуендеу"
            ]
        },
        {
            "question": "Мамандар нені дамыту қажет деп есептейді?",
            "answers": [
                "Спорт мәдениетін",
                "Кино мәдениетін",
                "Жол мәдениетін",
                "Музыка мәдениетін"
            ]
        },
        {
            "question": "Жол ережесін сақтау кімнің міндеті?",
            "answers": [
                "Мұғалімнің",
                "Дәрігердің",
                "Әр адамның",
                "Тек жүргізушінің"
            ]
        },
        {
            "question": "Қауіпсіздік ережелерін орындау неге көмектеседі?",
            "answers": [
                "Көлікті тез жүргізуге",
                "Жол-көлік оқиғасының алдын алуға",
                "Телефон қолдануға",
                "Бағдаршамды өзгертуге"
            ]
        }
    ],
    readingAnswer: dedent(`
        1. ә) Жол қауіпсіздігі
        2. б) Көлік
        3. б) Жол ережесін
        4. ә) Бағдаршам мен жол белгілеріне
        5. б) Балалар мен қарт адамдар
        6. ә) Адам өмірін сақтауға
        7. ә) Телефон қолдану
        8. б) Әр адамның 
        10. ә) Жол-көлік оқиғасының алдын алуға
    `),
    listeningAudioPath: `src/assets/audio/b1/B1-8_Көлік-және-жаяу-жүргінші.mp3`,
    listeningTitle: {
        kk: "Тиісті сөзді жазып, сөйлемді толықтырыңыз.",
        ru: "Напишите подходящее слово и дополните предложение.",
        en: "Write the correct word and complete the sentence."
    },
    listening: dedent(`
        1.	Қала көшелерінде __________ көбейіп келеді.
        2.	___________ сақтау өте маңызды. 
        3.	Жүргізушілер __________ асырмауы керек. 
        4.	Жаяу жүргіншілер арнайы __________ арқылы өтуі қажет. 
        5.	Телефонды жолда қолдану __________ туғызады. 
        6.	__________ көбі жүргізушілердің назар аудармауынан болады. 
        7.	Қазіргі уақытта қалаларда жаңа __________ орнатылып жатыр.
    `),
    listeningAnswer: dedent(`
        1.	Қала көшелерінде көлік саны көбейіп келеді.
        2.	Жол ережесін сақтау өте маңызды. 
        3.	Жүргізушілер жылдамдықты асырмауы керек. 
        4.	Жаяу жүргіншілер арнайы өткел арқылы өтуі қажет. 
        5.	Телефонды жолда қолдану қауіпті жағдай туғызады. 
        6.	Жол-көлік оқиғаларының көбі жүргізушілердің назар аудармауынан болады. 
        7.	Қазіргі уақытта қалаларда жаңа жол белгілері орнатылып жатыр. 
    `),
    speakingTitle: {
        kk: "Тақырыпқа байланысты тірек сөздерді пайдаланып, қысқаша әңгіме құраңыз.",
        ru: "Составьте короткий рассказ, используя опорные слова по теме.",
        en: "Write a short story using the key words related to the topic."
    },
    speaking: dedent(`
        жол қауіпсіздігі 
        жаяу жүргінші
        жол ережесі 
        қоғамдық көлік 
        қауіпсіздік белдіг
        бағдаршам
        жол белгісі 
        көлік кептелісі
    `),
    speakingAnswer: dedent(`
        Жол қауіпсіздігіне әр адам жауапкершілікпен қарауы керек. Жаяу жүргінші жол ережесін сақтап, бағдаршамға қарауы қажет. Жол белгілерін білу де өте маңызды. Қоғамдық көлікте қауіпсіздік белдігін тағу керек. Көлік кептелісі кезінде сабыр сақтап, жол ережесін бұзбау қажет.
    `)
};
