import { Topic } from "..";
import dedent from 'dedent';

export const B1_8_TOPIC: Topic = {
    title: {
        kk: "КӨЛІК ЖӘНЕ ЖАЯУ ЖҮРГІНШІ",
        ru: "ТРАНСПОРТ И ПЕШЕХОД",
        en: "TRAFFIC AND PEDESTRIAN"
    },
    description: {
        kk: dedent(`
                    ЖАҢА СӨЗДЕР
                    айыппұл
                    айыппұл төлеу
                    ереже бұзу
                    жүргізуші куәлігі
                    жүргінші, жолаушы
                    жылдамдық
                    жылдамдықты арттыру
                    жаяу жүргіншілерге арналған жол
                    жол белгісі
                    жол қозғалысы
                    жол жүру мәдениеті
                    жол-көлік оқиғасы
                    жолаушы
                    қауіпсіздік белдігі
                    қауіпсіздік ережесі
                    қарсы бағыт
                    қоғамдық көлік
                    қозғалысты реттеу
                    көлік құралдары
                    көлік кептелісі
                    кептеліс
                    құралдар
                    мәселе
                    сақ болу

                    ГРАММАТИКА
                    МОДАЛЬ СӨЗДЕР

                    Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	

                    Модаль сөздер:	керек, қажет, болмайды	Мысал
                    Міндет, талап		Жол ережесін сақтау керек.
                    Кеңес		Көлікте қауіпсіздік белдігін тағу қажет.
                    Тыйым салу		Бағдаршамның қызыл түсінде өтуге болмайды.
                    Ескерту		Жолда абай болу керек.
                    Ресми нұсқау		Жүргізуші жылдамдықты арттырмауы қажет.
                `),
        ru: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    НОВЫЕ СЛОВА. 
                    Қазақша	Орысша
                    айыппұл	штраф
                    айыппұл төлеу	оплачивать штраф
                    ереже бұзу	нарушать правило
                    жүргізуші куәлігі	водительское удостоверение
                    жүргінші, жолаушы	проезжий, прохожий, пешеход
                    жылдамдық	скорость
                    жылдамдықты арттыру	превышать скорость
                    жаяу жүргіншілерге арналған жол	дорога для пешеходов
                    жол белгісі	дорожный знак
                    жол қозғалысы	дорожное движение
                    жол жүру мәдениеті	культура дорожного движения
                    жол-көлік оқиғасы	дорожно-транспортное происшествие
                    жолаушы	пассажир
                    қауіпсіздік белдігі	ремень безопасности
                    қауіпсіздік ережесі	правило безопасности
                    қарсы бағыт	встречное направление
                    қоғамдық көлік	общественный транспорт
                    қозғалысты реттеу	регулировать движение
                    көлік құралдары	транспортные средства
                    көлік кептелісі	пробка на дороге
                    кептеліс	пробка
                    құралдар	средства
                    мәселе	проблема, вопрос, задача
                    сақ болу	быть осторожным

                    ГРАММАТИКА.
                    МОДАЛЬНЫЕ СЛОВА

                    Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	

                    Модаль сөздер:	керек, қажет, болмайды	Мысал
                    Міндет, талап		Жол ережесін сақтау керек.
                    Кеңес		Көлікте қауіпсіздік белдігін тағу қажет.
                    Тыйым салу		Бағдаршамның қызыл түсінде өтуге болмайды.
                    Ескерту		Жолда абай болу керек.
                    Ресми нұсқау		Жүргізуші жылдамдықты арттырмауы қажет.
                `),
        en: dedent(`
                    ЖАҢА СӨЗДЕР. 
                    NEW WORDS.
                    Қазақша	English
                    айыппұл	fine
                    айыппұл төлеу	pay a fine
                    ереже бұзу	break a rule
                    жүргізуші куәлігі	driver’s license
                    жүргінші, жолаушы	passerby / pedestrian
                    жылдамдық	speed
                    жылдамдықты арттыру	exceed the speed limit
                    жаяу жүргіншілерге арналған жол	pedestrian road / crosswalk
                    жол белгісі	road sign
                    жол қозғалысы	road traffic
                    жол жүру мәдениеті	road culture / traffic culture
                    жол-көлік оқиғасы	road traffic accident
                    жолаушы	passenger
                    қауіпсіздік белдігі	seat belt
                    қауіпсіздік ережесі	safety rule
                    қарсы бағыт	opposite direction
                    қоғамдық көлік	public transport
                    қозғалысты реттеу	regulate traffic
                    көлік құралдары	vehicles
                    көлік кептелісі	traffic jam
                    кептеліс	congestion / traffic jam
                    құралдар	means / tools
                    мәселе	problem / issue / task
                    сақ болу	be careful

                    GRAMMAR
                    Modal Verbs.

                    Модаль сөздер – сөйлеушініңойға, іс-әрекетке, ақпаратқа қатысты көзқарасын, сенімін, болжамын, қажеттілігін білдіретін сөздер.	

                    Модаль сөздер:	керек, қажет, болмайды	Мысал
                    Міндет, талап		Жол ережесін сақтау керек.
                    Кеңес		Көлікте қауіпсіздік белдігін тағу қажет.
                    Тыйым салу		Бағдаршамның қызыл түсінде өтуге болмайды.
                    Ескерту		Жолда абай болу керек.
                    Ресми нұсқау		Жүргізуші жылдамдықты арттырмауы қажет.
                `)
    },
    writingTitle: {
        kk: "Сөздерді дұрыс ретімен орналастырып, сөйлем құраңыз.",
        ru: "Расположите слова в правильном порядке и составьте предложение.",
        en: "Put the words in the correct order and make a sentence."
    },
    writing: dedent(`
                1.	жаяу жүргіншілер жолынан / өту / керек
                2.	жүргізушілер / жол ережесін / сақтауы / қажет
                3.	көлікте / тағу / қауіпсіздік белдігін / керек
                4.	қызыл түсте / өтуге / болмайды
                5.	қоғамдық көлікте / мәдениетті / болу / қажет
                6.	жолда / телефонмен / сөйлесуге / болмайды
                7.	автобусқа / кезекпен / міну / керек
            `),
    reading: dedent(`
                <b>Жол қауіпсіздігі – ортақ жауапкершілік</b>

                Қазіргі таңда жол қауіпсіздігі — маңызды мәселелердің бірі. Күн сайын қала көшелерінде көптеген көлік қозғалады. Сондықтан жүргізушілер мен жаяу жүргіншілер жол ережесін жақсы білуі керек.
                Жолда бағдаршам мен жол белгілеріне назар аудару өте маңызды. Әсіресе, балалар мен қарт адамдар жолдан өткен кезде абай болуы қажет. Көлікте қауіпсіздік белдігін тағу адам өмірін сақтауға көмектеседі.
                Соңғы жылдары жол апаттарының саны көбейіп келеді. Оның негізгі себептері — жылдамдықты арттыру, телефон қолдану және ережені сақтамау. Мамандар жол мәдениетін дамыту қажет деп есептейді.
                Жол ережесін сақтау — әр адамның міндеті. Қауіпсіздік ережелерін орындау арқылы көптегенжол-көлік оиғасының алдын алуға болады.
            `),
    readingTest: [
        {
            "question": "Қазіргі таңда маңызды мәселелердің бірі не?",
            "answers": [
                "Спорт",
                "Жол қауіпсіздігі",
                "Музыка",
                "Туризм"
            ]
        },
        {
            "question": "Қала көшелерінде күн сайын не көп қозғалады?",
            "answers": [
                "Велосипедтер",
                "Адамдар",
                "Көлік",
                "Ұшақтар"
            ]
        },
        {
            "question": "Жүргізушілер мен жаяу жүргіншілер нені жақсы білуі керек?",
            "answers": [
                "Шет тілін",
                "Компьютерді",
                "Жол ережесін",
                "Спорт түрлерін"
            ]
        },
        {
            "question": "Жолда неге назар аудару маңызды?",
            "answers": [
                "Дүкендерге",
                "Бағдаршам мен жол белгілеріне",
                "Ауа райына",
                "Ғимараттарға"
            ]
        },
        {
            "question": "Жолдан өткен кезде кімдер абай болуы қажет?",
            "answers": [
                "Тек жүргізушілер",
                "Тек студенттер",
                "Балалар мен қарт адамдар",
                "Тек жолаушылар"
            ]
        },
        {
            "question": "Қауіпсіздік белдігін тағу неге көмектеседі?",
            "answers": [
                "Уақытты үнемдеуге",
                "Адам өмірін сақтауға",
                "Жылдам жүруге",
                "Көлікті жөндеуге"
            ]
        },
        {
            "question": "Жол апаттарының негізгі себептерінің бірі қандай?",
            "answers": [
                "Кітап оқу",
                "Телефон қолдану",
                "Музыка тыңдау",
                "Серуендеу"
            ]
        },
        {
            "question": "Мамандар нені дамыту қажет деп есептейді?",
            "answers": [
                "Спорт мәдениетін",
                "Кино мәдениетін",
                "Жол мәдениетін",
                "Музыка мәдениетін"
            ]
        },
        {
            "question": "Жол ережесін сақтау кімнің міндеті?",
            "answers": [
                "Мұғалімнің",
                "Дәрігердің",
                "Әр адамның",
                "Тек жүргізушінің"
            ]
        },
        {
            "question": "Қауіпсіздік ережелерін орындау неге көмектеседі?",
            "answers": [
                "Көлікті тез жүргізуге",
                "Жол-көлік оқиғасының алдын алуға",
                "Телефон қолдануға",
                "Бағдаршамды өзгертуге"
            ]
        }
    ],
    listeningAudioPath: `src/assets/audio/b1/B1-8_Көлік-және-жаяу-жүргінші.mp3`,
    listeningTitle: {
        kk: "Тиісті сөзді жазып, сөйлемді толықтырыңыз.",
        ru: "Напишите подходящее слово и дополните предложение.",
        en: "Write the correct word and complete the sentence."
    },
    listening: dedent(`
                1.	Қала көшелерінде __________ көбейіп келеді.
                2.	___________ сақтау өте маңызды. 
                3.	Жүргізушілер __________ асырмауы керек. 
                4.	Жаяу жүргіншілер арнайы __________ арқылы өтуі қажет. 
                5.	Телефонды жолда қолдану __________ туғызады. 
                6.	__________ көбі жүргізушілердің назар аудармауынан болады. 
                7.	Қазіргі уақытта қалаларда жаңа __________ орнатылып жатыр.
            `),
    speakingTitle: {
        kk: "Тақырыпқа байланысты тірек сөздерді пайдаланып, қысқаша әңгіме құраңыз.",
        ru: "Составьте короткий рассказ, используя опорные слова по теме.",
        en: "Write a short story using the key words related to the topic."
    },
    speaking: dedent(`
                жол қауіпсіздігі 
                жаяу жүргінші
                жол ережесі 
                қоғамдық көлік 
                қауіпсіздік белдіг
                бағдаршам
                жол белгісі 
                көлік кептелісі
            `)
};
